#pragma once

// Lost Ark (1.2.0.3) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_Engine_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.Actor
// 0x021C (0x0274 - 0x0058)
class AActor : public UObject
{
public:
	unsigned char                                      UnknownData00[0x21C];                                     // 0x0058(0x021C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Actor");
		return ptr;
	}


	void STATIC_GetActorSpriteComponent();
	void STATIC_GetActorMetrics();
	void OnMobileTouch();
	void STATIC_IsMobileTouchEnabled();
	void STATIC_ShouldBeHiddenBySHOW_NavigationNodes();
	void WillOverlap();
	void STATIC_GetAvoidanceVector();
	void ReplicationEnded();
	void PostDemoRewind();
	void AnimTreeUpdated();
	void SupportsKismetModification();
	void STATIC_GetAnimTrailParticleSystem();
	void TrailsNotifyEnd();
	void TrailsNotifyTick();
	void TrailsNotify();
	void CreateForceField();
	void PlayParticleEffect();
	void STATIC_GetAimAdhesionExtent();
	void STATIC_GetAimFrictionExtent();
	void STATIC_IsInPersistentLevel();
	void OnRigidBodySpringOverextension();
	void STATIC_GetPackageGuid();
	void PostInitAnimTree();
	void RootMotionExtracted();
	void RootMotionProcessed();
	void RootMotionModeChanged();
	void PostRenderFor();
	void STATIC_NativePostRenderFor();
	void STATIC_SetHUDLocation();
	void OnRanOver();
	void RigidBodyCollision();
	void InterpolationChanged();
	void InterpolationFinished();
	void InterpolationStarted();
	void SpawnedByKismet();
	void STATIC_GetTargetLocation();
	void STATIC_FindGoodEndView();
	void STATIC_NotifyLocalPlayerTeamReceived();
	void ScriptGetTeamNum();
	void STATIC_GetTeamNum();
	void STATIC_PawnBaseDied();
	void STATIC_IsPlayerOwned();
	void GetActorEyesViewPoint();
	void STATIC_IsStationary();
	void GetActorFaceFXAsset();
	void CanActorPlayFaceFXAnim();
	void STATIC_IsActorPlayingFaceFXAnim();
	void TickSkelControl();
	void SetSkelControlScale();
	void SetMorphWeight();
	void StopActorFaceFXAnim();
	void PlayActorFaceFXAnim();
	void FinishAnimControl();
	void SetAnimPosition();
	void BeginAnimControl();
	void OnAnimPlay();
	void OnAnimEnd();
	void DoKismetAttachment();
	void STATIC_OnAttachToActor();
	void STATIC_OnToggleHidden();
	void STATIC_OnChangeCollision();
	void STATIC_OnSetPhysics();
	void STATIC_OnSetBlockRigidBody();
	void STATIC_OnSetVelocity();
	void STATIC_OnTeleport();
	void STATIC_OnModifyHealth();
	void STATIC_PrestreamTextures();
	void ShutDown();
	void STATIC_SetNetUpdateTime();
	void ForceNetRelevant();
	void STATIC_OnDestroy();
	void ClearLatentAction();
	void STATIC_FindEventsOfClass();
	void ActivateEventClass();
	void TriggerGlobalEventClass();
	void ReceivedNewEvent();
	void TriggerEventClass();
	void DebugMessagePlayer();
	void STATIC_ImpactEffectIsRelevant();
	void ActorEffectIsRelevant();
	void EffectIsRelevant();
	void ApplyFluidSurfaceContinuousForce();
	void ApplyFluidSurfaceImpact();
	void CanSplash();
	void STATIC_PlayTeleportEffect();
	void STATIC_IsInPain();
	void STATIC_Reset();
	void GetFaceFXAudioComponent();
	void ModifyHearSoundComponent();
	void STATIC_GetPhysicsName();
	void DisplayDebug();
	void STATIC_GetDebugName();
	void STATIC_MatchStarting();
	void STATIC_GetLocalString();
	void STATIC_ReplaceText();
	void STATIC_GetHumanReadableName();
	void STATIC_GetItemName();
	void CalcCamera();
	void EndViewTarget();
	void BecomeViewTarget();
	void CheckForErrors();
	void DebugFreezeGame();
	void STATIC_GetGravityZ();
	void CheckHitInfo();
	void TakeRadiusDamage();
	void HealDamage();
	void TakeDamage();
	void STATIC_KilledBy();
	void STATIC_HurtRadius();
	void StopsProjectile();
	void NotifySkelControlBeyondLimit();
	void ConstraintBrokenNotify();
	void SetInitialState();
	void PostBeginPlay();
	void BroadcastLocalizedTeamMessage();
	void BroadcastLocalizedMessage();
	void PreBeginPlay();
	void STATIC_GetALocalPlayerController();
	void STATIC_LocalPlayerControllers();
	void AllOwnedComponents();
	void ComponentList();
	void STATIC_OverlappingActors();
	void CollidingActors();
	void VisibleCollidingActors();
	void VisibleActors();
	void TraceActors();
	void TouchingActors();
	void BasedActors();
	void ChildActors();
	void DynamicActors();
	void AllActors();
	void STATIC_GetURLMap();
	void STATIC_PostTeleport();
	void STATIC_PreTeleport();
	void STATIC_GetDestination();
	void CalculateMinSpeedTrajectory();
	void SuggestTossVelocity();
	void STATIC_PlayerCanSeeMe();
	void STATIC_MakeNoise();
	void ActivateOcclusion();
	void STATIC_PostTrigger();
	void STATIC_SetSwitch();
	void STATIC_SetState();
	void STATIC_SetRTPCValue();
	void STATIC_PostAkEventOnBone();
	void STATIC_PostAkEvent();
	void STATIC_PlaySoundBase();
	void STATIC_PlayAkEvent();
	void STATIC_PlaySound();
	void CreateAudioComponent();
	void STATIC_ResetTimerTimeDilation();
	void STATIC_ModifyTimerTimeDilation();
	void STATIC_GetRemainingTimeForTimer();
	void STATIC_GetTimerRate();
	void STATIC_GetTimerCount();
	void STATIC_IsTimerActive();
	void STATIC_PauseTimer();
	void ClearAllTimers();
	void ClearTimer();
	void STATIC_SetTimer();
	void TornOff();
	void Destroy();
	void Spawn();
	void STATIC_IsBlockedBy();
	void STATIC_GetBoundingCylinder();
	void STATIC_GetComponentsBoundingBox();
	void STATIC_IsOverlapping();
	void ContainsPoint();
	void STATIC_FindSpot();
	void TraceAllPhysicsAssetInteractions();
	void STATIC_FastTrace();
	void STATIC_PointCheckComponent();
	void TraceComponent();
	void Trace();
	void VolumeBasedDestroy();
	void OutsideWorldBounds();
	void FellOutOfWorld();
	void UsedBy();
	void OverRotated();
	void ClampRotation();
	void OnSleepRBPhysics();
	void OnWakeRBPhysics();
	void RanInto();
	void EncroachedBy();
	void EncroachingOn();
	void CollisionChanged();
	void SpecialHandling();
	void Detach();
	void Attach();
	void BaseChange();
	void Bump();
	void UnTouch();
	void PostTouch();
	void Touch();
	void PhysicsVolumeChange();
	void Landed();
	void Falling();
	void HitWall();
	void Timer();
	void Tick();
	void LostChild();
	void GainedChild();
	void Destroyed();
	void STATIC_SetTickIsDisabled();
	void STATIC_SetTickGroup();
	void STATIC_ReattachComponent();
	void DetachComponent();
	void AttachComponent();
	void UnClock();
	void Clock();
	void STATIC_SetPhysics();
	void STATIC_SetOnlyOwnerSee();
	void STATIC_SetHidden();
	void ChartData();
	void STATIC_FlushDebugStrings();
	void DrawDebugFrustrum();
	void DrawDebugString();
	void DrawDebugCone();
	void DrawDebugCylinder();
	void DrawDebugSphere();
	void DrawDebugCoordinateSystem();
	void DrawDebugStar();
	void DrawDebugBox();
	void DrawDebugPoint();
	void DrawDebugLine();
	void STATIC_FlushPersistentDebugLines();
	void STATIC_GetBasedPosition();
	void STATIC_SetBasedPosition();
	void BP2Vect();
	void Vect2BP();
	void STATIC_SetForcedInitialReplicatedProperty();
	void ReplicatedEvent();
	void STATIC_GetAggregateBaseVelocity();
	void STATIC_IsOwnedBy();
	void STATIC_GetBaseMost();
	void STATIC_IsBasedOn();
	void STATIC_SearchForBaseBelow();
	void STATIC_FindBase();
	void STATIC_SetOwner();
	void STATIC_SetBase();
	void STATIC_GetTerminalVelocity();
	void AutonomousPhysics();
	void STATIC_MoveSmooth();
	void STATIC_fixedTurn();
	void STATIC_SetShadowParentOnAllAttachedComponents();
	void STATIC_SetHardAttach();
	void STATIC_SetRelativeLocation();
	void STATIC_SetRelativeRotation();
	void STATIC_SetZone();
	void STATIC_MovingWhichWay();
	void STATIC_SetRotation();
	void STATIC_SetLocation();
	void STATIC_Move();
	void STATIC_SetDrawScale3D();
	void STATIC_SetDrawScale();
	void STATIC_SetCollisionType();
	void STATIC_SetCollisionSize();
	void SetCollision();
	void STATIC_FinishAnim();
	void STATIC_Sleep();
	void ConsoleCommand();
	void STATIC_ForceUpdateComponents();
};


// Class Engine.Info
// 0x0000 (0x0274 - 0x0274)
class AInfo : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Info");
		return ptr;
	}

};


// Class Engine.ZoneInfo
// 0x0014 (0x0288 - 0x0274)
class AZoneInfo : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0274(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ZoneInfo");
		return ptr;
	}

};


// Class Engine.WorldInfo
// 0x081C (0x0AA4 - 0x0288)
class AWorldInfo : public AZoneInfo
{
public:
	unsigned char                                      UnknownData00[0x81C];                                     // 0x0288(0x081C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.WorldInfo");
		return ptr;
	}


	void ClearObjectPools();
	void ToggleHostMigration();
	void NotifyHostMigrationStateChanged();
	void BeginHostMigration();
	void CanBeginHostMigration();
	void STATIC_FindEnvironmentVolume();
	void STATIC_GetWorldInfo();
	void STATIC_GetWorldFractureSettings();
	void DoMemoryTracking();
	void STATIC_GetDemoRewindPoints();
	void STATIC_GetDemoFrameInfo();
	void STATIC_IsPlayingDemo();
	void STATIC_IsRecordingDemo();
	void STATIC_GetDetailMode();
	void STATIC_GetMapName();
	void STATIC_SetMapInfo();
	void STATIC_GetMapInfo();
	void STATIC_SetSeamlessTravelMidpointPause();
	void STATIC_IsInSeamlessTravel();
	void STATIC_SeamlessTravel();
	void CommitMapChange();
	void CancelPendingMapChange();
	void STATIC_IsMapChangeReady();
	void STATIC_IsPreparingMapChange();
	void STATIC_PrepareMapChange();
	void STATIC_NotifyMatchStarted();
	void AllClientConnections();
	void AllPawns();
	void AllControllers();
	void STATIC_NavigationPointCheck();
	void STATIC_RadiusNavigationPoints();
	void AllNavigationPoints();
	void STATIC_Reset();
	void PostBeginPlay();
	void PreBeginPlay();
	void ThisIsNeverExecuted();
	void ServerTravel();
	void STATIC_GetGameClass();
	void STATIC_GetAddressURL();
	void VerifyNavList();
	void STATIC_ForceGarbageCollection();
	void STATIC_IsPlayInMobilePreview();
	void STATIC_IsPlayInPreview();
	void STATIC_IsPlayInEditor();
	void STATIC_IsWithGFx();
	void STATIC_IsConsoleBuild();
	void STATIC_IsDemoBuild();
	void STATIC_GetLocalURL();
	void STATIC_SetLevelRBGravity();
	void STATIC_GetAllRootSequences();
	void STATIC_GetGameSequence();
	void STATIC_GetGravityZ();
	void UpdateMusicTrack();
	void STATIC_SetMusicVolume();
	void STATIC_IsMenuLevel();
	void AddOnScreenDebugMessage();
	void ReplicatedEvent();
	void STATIC_GetNavMeshPathGoalEvaluatorFromCache();
	void STATIC_GetNavMeshPathConstraintFromCache();
	void STATIC_ReleaseCachedConstraintsAndEvaluators();
};


// Class Engine.DownloadableContentEnumerator
// 0x0040 (0x0098 - 0x0058)
class UDownloadableContentEnumerator : public UObject
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0058(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DownloadableContentEnumerator");
		return ptr;
	}


	void TriggerFindDLCDelegates();
	void STATIC_InstallDLC();
	void STATIC_InstallAllDLC();
	void DeleteDLC();
	void ClearFindDLCDelegate();
	void AddFindDLCDelegate();
	void OnFindDLCComplete();
	void STATIC_FindDLC();
};


// Class Engine.DownloadableContentManager
// 0x00B0 (0x0108 - 0x0058)
class UDownloadableContentManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0058(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DownloadableContentManager");
		return ptr;
	}


	void OnRefreshComplete();
	void AddPackagesToFullyLoad();
	void STATIC_RefreshDLCEnumComplete();
	void STATIC_RefreshDLC();
	void STATIC_OnContentChange();
	void STATIC_OnStorageDeviceChange();
	void STATIC_OnLoginChange();
	void Init();
	void STATIC_InstallNonPackageFiles();
	void STATIC_InstallPackages();
	void UpdateObjectLists();
	void STATIC_MarkPerObjectConfigPendingKill();
	void AddSectionToObjectList();
	void STATIC_GetDLCNonPackageFilePath();
	void ClearDLC();
	void STATIC_InstallDLCs();
	void STATIC_InstallDLC();
};


// Class Engine.Engine
// 0x0898 (0x08F8 - 0x0060)
class UEngine : public USubsystem
{
public:
	unsigned char                                      UnknownData00[0x898];                                     // 0x0060(0x0898) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Engine");
		return ptr;
	}


	void TranslateGFxUIMessage();
	void STATIC_GetIdentifierForVendor();
	void STATIC_GetSystemSettingFloat();
	void STATIC_GetSystemSettingInt();
	void STATIC_GetSystemSettingBool();
	void STATIC_LaunchURL();
	void BasicLoadObject();
	void BasicSaveObject();
	void AddTextureStreamingSlaveLoc();
	void STATIC_GetWorldPostProcessChain();
	void STATIC_GetDefaultPostProcessChain();
	void STATIC_GetEngine();
	void STATIC_IsRealDStereoEnabled();
	void AddOverlayWrapped();
	void AddOverlay();
	void STATIC_RemoveAllOverlays();
	void StopMovie();
	void STATIC_PlayLoadMapMovie();
	void STATIC_GetLastMovieName();
	void STATIC_GetAudioDevice();
	void STATIC_IsUsingES2Renderer();
	void STATIC_IsStereoscopic3D();
	void STATIC_IsSplitScreen();
	void STATIC_GetAdditionalFont();
	void STATIC_GetUltraFont();
	void STATIC_GetSubtitleFont();
	void STATIC_GetLargeFont();
	void STATIC_GetMediumFont();
	void STATIC_GetSmallFont();
	void STATIC_GetTinyFont();
	void STATIC_HasNetworkConnection();
	void BuildBugSubmissionString();
	void STATIC_GetDevicePushNotificationToken();
	void STATIC_GetOSVersion();
	void STATIC_GetDeviceUUID();
	void STATIC_GetBuildDate();
	void STATIC_GetCurrentWorldInfo();
	void STATIC_IsGame();
	void IsEditor();
};


// Class Engine.GameEngine
// 0x01DC (0x0AD4 - 0x08F8)
class UGameEngine : public UEngine
{
public:
	unsigned char                                      UnknownData00[0x1DC];                                     // 0x08F8(0x01DC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.GameEngine");
		return ptr;
	}


	void STATIC_HasSecondaryScreenActive();
	void STATIC_GetDLCManager();
	void STATIC_GetDLCEnumerator();
	void STATIC_GetOnlineSubsystem();
	void DestroyNamedNetDriver();
	void CreateNamedNetDriver();
};


// Class Engine.EngineBaseTypes
// 0x0000 (0x0058 - 0x0058)
class UEngineBaseTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.EngineBaseTypes");
		return ptr;
	}

};


// Class Engine.Brush
// 0x0030 (0x02A4 - 0x0274)
class ABrush : public AActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0274(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Brush");
		return ptr;
	}

};


// Class Engine.BrushShape
// 0x0000 (0x02A4 - 0x02A4)
class ABrushShape : public ABrush
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BrushShape");
		return ptr;
	}

};


// Class Engine.Volume
// 0x000C (0x02B0 - 0x02A4)
class AVolume : public ABrush
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x02A4(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Volume");
		return ptr;
	}


	void ProcessActorSetVolume();
	void CollisionChanged();
	void STATIC_OnToggle();
	void DisplayDebug();
	void PostBeginPlay();
	void EncompassesPoint();
	void Encompasses();
};


// Class Engine.BlockingVolume
// 0x0004 (0x02B4 - 0x02B0)
class ABlockingVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B0(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BlockingVolume");
		return ptr;
	}


	void STATIC_OnToggle();
};


// Class Engine.DynamicBlockingVolume
// 0x0004 (0x02B8 - 0x02B4)
class ADynamicBlockingVolume : public ABlockingVolume
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x02B4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DynamicBlockingVolume");
		return ptr;
	}


	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void PostBeginPlay();
};


// Class Engine.CullDistanceVolume
// 0x0014 (0x02C4 - 0x02B0)
class ACullDistanceVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x02B0(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.CullDistanceVolume");
		return ptr;
	}

};


// Class Engine.DDLExcludeVolume
// 0x0000 (0x02B0 - 0x02B0)
class ADDLExcludeVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DDLExcludeVolume");
		return ptr;
	}

};


// Class Engine.LevelGridVolume
// 0x00AC (0x035C - 0x02B0)
class ALevelGridVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0xAC];                                      // 0x02B0(0x00AC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LevelGridVolume");
		return ptr;
	}

};


// Class Engine.LevelStreamingVolume
// 0x001C (0x02CC - 0x02B0)
class ALevelStreamingVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x02B0(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LevelStreamingVolume");
		return ptr;
	}


	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_OnToggle();
};


// Class Engine.LightmassCharacterIndirectDetailVolume
// 0x0000 (0x02B0 - 0x02B0)
class ALightmassCharacterIndirectDetailVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LightmassCharacterIndirectDetailVolume");
		return ptr;
	}

};


// Class Engine.LightmassImportanceVolume
// 0x0000 (0x02B0 - 0x02B0)
class ALightmassImportanceVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LightmassImportanceVolume");
		return ptr;
	}

};


// Class Engine.MassiveLODOverrideVolume
// 0x0000 (0x02B0 - 0x02B0)
class AMassiveLODOverrideVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.MassiveLODOverrideVolume");
		return ptr;
	}

};


// Class Engine.PathBlockingVolume
// 0x0000 (0x02B0 - 0x02B0)
class APathBlockingVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PathBlockingVolume");
		return ptr;
	}

};


// Class Engine.PhysicsVolume
// 0x0050 (0x0300 - 0x02B0)
class APhysicsVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x02B0(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PhysicsVolume");
		return ptr;
	}


	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_ShouldSaveForCheckpoint();
	void STATIC_OnSetDamageInstigator();
	void STATIC_NotifyPawnBecameViewTarget();
	void STATIC_ModifyPlayer();
	void CausePainTo();
	void Touch();
	void TimerPop();
	void CollisionChanged();
	void STATIC_OnToggle();
	void PawnLeavingVolume();
	void PawnEnteredVolume();
	void ActorLeavingVolume();
	void ActorEnteredVolume();
	void PhysicsChangedFor();
	void STATIC_Reset();
	void PostBeginPlay();
	void STATIC_GetZoneVelocityForActor();
	void STATIC_GetGravityZ();
};


// Class Engine.DefaultPhysicsVolume
// 0x0000 (0x0300 - 0x0300)
class ADefaultPhysicsVolume : public APhysicsVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DefaultPhysicsVolume");
		return ptr;
	}


	void Destroyed();
};


// Class Engine.GravityVolume
// 0x0004 (0x0304 - 0x0300)
class AGravityVolume : public APhysicsVolume
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0300(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.GravityVolume");
		return ptr;
	}

};


// Class Engine.LadderVolume
// 0x0040 (0x0340 - 0x0300)
class ALadderVolume : public APhysicsVolume
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0300(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LadderVolume");
		return ptr;
	}


	void PhysicsChangedFor();
	void PawnLeavingVolume();
	void PawnEnteredVolume();
	void STATIC_InUse();
	void PostBeginPlay();
};


// Class Engine.PortalVolume
// 0x0010 (0x02C0 - 0x02B0)
class APortalVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x02B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PortalVolume");
		return ptr;
	}

};


// Class Engine.PostProcessVolume
// 0x0184 (0x0434 - 0x02B0)
class APostProcessVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x184];                                     // 0x02B0(0x0184) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PostProcessVolume");
		return ptr;
	}


	void STATIC_OnToggle();
};


// Class Engine.PrecomputedVisibilityOverrideVolume
// 0x0020 (0x02D0 - 0x02B0)
class APrecomputedVisibilityOverrideVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x02B0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PrecomputedVisibilityOverrideVolume");
		return ptr;
	}

};


// Class Engine.PrecomputedVisibilityVolume
// 0x0000 (0x02B0 - 0x02B0)
class APrecomputedVisibilityVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PrecomputedVisibilityVolume");
		return ptr;
	}

};


// Class Engine.ReverbVolume
// 0x0044 (0x02F4 - 0x02B0)
class AReverbVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x02B0(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ReverbVolume");
		return ptr;
	}

};


// Class Engine.TriggerVolume
// 0x0000 (0x02B0 - 0x02B0)
class ATriggerVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.TriggerVolume");
		return ptr;
	}


	void StopsProjectile();
	void PostBeginPlay();
};


// Class Engine.DroppedPickup
// 0x001C (0x0290 - 0x0274)
class ADroppedPickup : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0274(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DroppedPickup");
		return ptr;
	}


	void STATIC_RecheckValidTouch();
	void STATIC_PickedUpBy();
	void STATIC_GiveTo();
	void Landed();
	void DetourWeight();
	void EncroachedBy();
	void SetPickupParticles();
	void SetPickupMesh();
	void STATIC_Reset();
	void ReplicatedEvent();
	void Destroyed();
	void STATIC_RemoveFromNavigation();
	void AddToNavigation();
};


// Class Engine.DynamicSMActor
// 0x0050 (0x02C4 - 0x0274)
class ADynamicSMActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0274(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DynamicSMActor");
		return ptr;
	}


	void STATIC_SetLightEnvironmentToNotBeDynamic();
	void Detach();
	void Attach();
	void CanBasePawn();
	void STATIC_SetStaticMesh();
	void STATIC_OnSetMaterial();
	void OnSetMesh();
	void ReplicatedEvent();
	void PostBeginPlay();
};


// Class Engine.InterpActor
// 0x004C (0x0310 - 0x02C4)
class AInterpActor : public ADynamicSMActor
{
public:
	unsigned char                                      UnknownData00[0x4C];                                      // 0x02C4(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.InterpActor");
		return ptr;
	}


	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_ShouldSaveForCheckpoint();
	void ShutDown();
	void InterpolationChanged();
	void InterpolationFinished();
	void InterpolationStarted();
	void STATIC_PlayMovingSound();
	void STATIC_FinishedOpen();
	void STATIC_Restart();
	void Detach();
	void Attach();
	void RanInto();
	void EncroachingOn();
	void PostBeginPlay();
};


// Class Engine.Emitter
// 0x0034 (0x02A8 - 0x0274)
class AEmitter : public AActor
{
public:
	unsigned char                                      UnknownData00[0x34];                                      // 0x0274(0x0034) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Emitter");
		return ptr;
	}


	void STATIC_HideSelf();
	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_ShouldSaveForCheckpoint();
	void STATIC_OnSetParticleSysParam();
	void STATIC_SetActorParameter();
	void STATIC_SetExtColorParameter();
	void STATIC_SetColorParameter();
	void STATIC_SetVectorParameter();
	void STATIC_SetFloatParameter();
	void ShutDown();
	void STATIC_OnParticleEventGenerator();
	void STATIC_OnToggle();
	void OnParticleSystemFinished();
	void ReplicatedEvent();
	void PostBeginPlay();
	void SetTemplate();
};


// Class Engine.EmitterPool
// 0x0070 (0x02E4 - 0x0274)
class AEmitterPool : public AActor
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0274(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.EmitterPool");
		return ptr;
	}


	void STATIC_SpawnEmitterCustomLifetime();
	void STATIC_SpawnEmitterMeshAttachment();
	void STATIC_SpawnEmitter();
	void STATIC_GetPooledComponent();
	void STATIC_GetFreeMatInstConsts();
	void STATIC_FreeMaterialInstanceConstants();
	void STATIC_GetFreeStaticMeshComponent();
	void STATIC_FreeStaticMeshComponents();
	void STATIC_ReturnToPool();
	void ClearPoolComponents();
	void OnParticleSystemFinished();
};


// Class Engine.HUD
// 0x0320 (0x0594 - 0x0274)
class AHUD : public AActor
{
public:
	unsigned char                                      UnknownData00[0x320];                                     // 0x0274(0x0320) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.HUD");
		return ptr;
	}


	void OnLostFocusPause();
	void STATIC_NotifyBindPostProcessEffects();
	void STATIC_PlayerOwnerDied();
	void STATIC_GetFontSizeIndex();
	void DrawText();
	void DisplayKismetMessages();
	void DisplayLocalMessages();
	void DrawMessageText();
	void DrawMessage();
	void STATIC_GetScreenCoords();
	void AddLocalizedMessage();
	void STATIC_LocalizedMessage();
	void AddConsoleMessage();
	void STATIC_ShouldShowConsoleMessage();
	void DisplayConsoleMessages();
	void Message();
	void ClearMessage();
	void DisplayBadConnectionAlert();
	void DrawHUD();
	void PostRender();
	void STATIC_PreCalcValues();
	void DrawRoute();
	void STATIC_ShowDebugInfo();
	void ToggleDirectorInfoDebug();
	void ToggleDirectorInfoHUD();
	void STATIC_ShouldDisplayDebug();
	void STATIC_ShowDebug();
	void STATIC_SetShowScores();
	void STATIC_ShowScores();
	void STATIC_ShowHUD();
	void ToggleHUD();
	void AddPostRenderedActor();
	void STATIC_RemovePostRenderedActor();
	void DrawActorOverlays();
	void PostBeginPlay();
	void Draw2DLine();
	void Draw3DLine();
};


// Class Engine.AutoTestManager
// 0x00C4 (0x0338 - 0x0274)
class AAutoTestManager : public AInfo
{
public:
	unsigned char                                      UnknownData00[0xC4];                                      // 0x0274(0x00C4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.AutoTestManager");
		return ptr;
	}


	void CheckForSentinelRun();
	void StartMatch();
	void STATIC_GetNextAutomatedTestingMap();
	void STATIC_IncrementNumberOfMatchesPlayed();
	void STATIC_IncrementAutomatedTestingMapIndex();
	void CloseAutomatedMapTestTimer();
	void STATIC_StartAutomatedMapTestTimerWorker();
	void StartAutomatedMapTestTimer();
	void DoMemoryTracking();
	void DoTimeBasedSentinelStatGathering();
	void DoSentinel_ViewDependentMemoryAtSpecificLocation();
	void DoSentinel_PerfAtSpecificLocation();
	void DoSentinel_MemoryAtSpecificLocation();
	void STATIC_GetTravelLocations();
	void STATIC_HandlePerLoadedMapAudioStats();
	void DoSentinelActionPerLoadedMap();
	void DoTravelTheWorld();
	void EndSentinelRun();
	void AddSentinelPerTimePeriodStats();
	void BeginSentinelRun();
	void STATIC_InitializeOptions();
	void Timer();
	void PostBeginPlay();
};


// Class Engine.CoverGroup
// 0x0018 (0x028C - 0x0274)
class ACoverGroup : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0274(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.CoverGroup");
		return ptr;
	}


	void STATIC_OnToggle();
	void ToggleGroup();
	void DisableGroup();
	void EnableGroup();
};


// Class Engine.ExponentialHeightFog
// 0x000C (0x0280 - 0x0274)
class AExponentialHeightFog : public AInfo
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0274(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ExponentialHeightFog");
		return ptr;
	}


	void STATIC_OnToggle();
	void ReplicatedEvent();
	void PostBeginPlay();
};


// Class Engine.FileWriter
// 0x0020 (0x0294 - 0x0274)
class AFileWriter : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0274(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.FileWriter");
		return ptr;
	}


	void Destroyed();
	void STATIC_Logf();
	void CloseFile();
	void STATIC_OpenFile();
};


// Class Engine.FileLog
// 0x0000 (0x0294 - 0x0294)
class AFileLog : public AFileWriter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.FileLog");
		return ptr;
	}


	void CloseLog();
	void STATIC_OpenLog();
};


// Class Engine.GameInfo
// 0x024C (0x04C0 - 0x0274)
class AGameInfo : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x24C];                                     // 0x0274(0x024C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.GameInfo");
		return ptr;
	}


	void ClearOnlineDelegates();
	void STATIC_InitCrowdPopulationManager();
	void OnEngineHasLoaded();
	void STATIC_OnDestroyOnlineGameComplete();
	void StandbyCheatDetected();
	void EnableStandbyCheatDetection();
	void BeginBVT();
	void CheckForSentinelRun();
	void STATIC_ShouldAutoContinueToNextRound();
	void STATIC_IsDoingASentinelRun();
	void STATIC_IsCheckingForMemLeaks();
	void STATIC_IsCheckingForFragmentation();
	void STATIC_IsAutomatedPerfTesting();
	void STATIC_SetBandwidthLimit();
	void DoTravelTheWorld();
	void TellClientsToTravelToSession();
	void TellClientsPartyHostIsLeaving();
	void TellClientsToReturnToPartyHost();
	void STATIC_OnServerCreateComplete();
	void STATIC_RegisterServer();
	void STATIC_OnLoginChange();
	void STATIC_OnLoginFailed();
	void ClearAutoLoginDelegates();
	void STATIC_ProcessServerLogin();
	void MatineeCancelled();
	void STATIC_RecalculateSkillRating();
	void UpdateGameplayMuteList();
	void STATIC_NotifyArbitratedMatchEnd();
	void STATIC_MatchIsInProgress();
	void ArbitrationRegistrationComplete();
	void STATIC_RegisterServerForArbitration();
	void STATIC_StartArbitratedMatch();
	void STATIC_StartArbitrationRegistration();
	void STATIC_ProcessClientRegistrationCompletion();
	void UpdateGameSettingsCounts();
	void STATIC_SetSeamlessTravelViewTarget();
	void HandleSeamlessTravelPlayer();
	void UpdateGameSettings();
	void PostSeamlessTravel();
	void SwapPlayerControllers();
	void GetSeamlessTravelActorList();
	void STATIC_OverridePRI();
	void STATIC_FindInactivePRI();
	void AddInactivePRI();
	void PostCommitMapChange();
	void PreCommitMapChange();
	void AllowPausing();
	void AllowCheats();
	void AllowMutator();
	void STATIC_PlayerCanRestart();
	void STATIC_PlayerCanRestartGame();
	void DriverLeftVehicle();
	void CanLeaveVehicle();
	void DriverEnteredVehicle();
	void STATIC_ModifyScoreKill();
	void STATIC_ScoreKill();
	void CheckScore();
	void STATIC_ScoreObjective();
	void AddObjectiveScore();
	void STATIC_RatePlayerStart();
	void ChoosePlayerStart();
	void STATIC_FindPlayerStart();
	void STATIC_ShouldSpawnAtStartSpot();
	void EndLogging();
	void STATIC_GameEventsPoll();
	void EndOnlineGame();
	void STATIC_PerformEndGameHandling();
	void EndGame();
	void WriteOnlinePlayerScores();
	void WriteOnlineStats();
	void CheckEndGame();
	void CheckModifiedEndGame();
	void BroadcastLocalizedTeam();
	void BroadcastLocalized();
	void BroadcastTeam();
	void Broadcast();
	void STATIC_RestartGame();
	void STATIC_GetTravelType();
	void STATIC_GetNextMap();
	void STATIC_SendPlayer();
	void STATIC_PickTeam();
	void ChangeTeam();
	void ChangeName();
	void DiscardInventory();
	void STATIC_PickupQuery();
	void STATIC_ShouldRespawn();
	void CheckRelevance();
	void STATIC_ReduceDamage();
	void CanSpectate();
	void STATIC_KickBan();
	void STATIC_Kick();
	void BroadcastDeathMessage();
	void STATIC_PreventDeath();
	void STATIC_Killed();
	void STATIC_NotifyKilled();
	void STATIC_SetPlayerDefaults();
	void STATIC_Mutate();
	void AddDefaultInventory();
	void AcceptInventory();
	void UnregisterPlayer();
	void STATIC_Logout();
	void PreExit();
	void CalculatedNetSpeed();
	void UpdateNetSpeeds();
	void PostLogin();
	void UpdateBestNextHosts();
	void BestNextHostSort();
	void STATIC_GenericPlayerInitialization();
	void STATIC_ReplicateStreamingStatus();
	void STATIC_GetDefaultPlayerClass();
	void STATIC_SpawnDefaultPawnFor();
	void STATIC_RestartPlayer();
	void STATIC_StartBots();
	void StartHumans();
	void STATIC_OnStartOnlineGameComplete();
	void StartOnlineGame();
	void StartMatch();
	void Login();
	void STATIC_SpawnPlayerController();
	void STATIC_GetNextPlayerID();
	void AtCapacity();
	void STATIC_RejectLogin();
	void STATIC_ResumeLogin();
	void STATIC_PauseLogin();
	void PreLogin();
	void STATIC_RequiresPassword();
	void STATIC_ProcessClientTravel();
	void STATIC_ProcessServerTravel();
	void STATIC_RemoveMutator();
	void AddMutator();
	void NotifyPendingConnectionLost();
	void InitGame();
	void SetGameType();
	void GetDefaultGameClassPath();
	void STATIC_GetIntOption();
	void STATIC_HasOption();
	void STATIC_ParseOption();
	void STATIC_GetKeyValue();
	void STATIC_GrabOption();
	void STATIC_SetGameSpeed();
	void DebugPause();
	void STATIC_ForceClearUnpauseDelegates();
	void ClearPause();
	void STATIC_SetPause();
	void CanUnpause();
	void STATIC_GetNumPlayers();
	void STATIC_GetNetworkNumber();
	void STATIC_InitGameReplicationInfo();
	void ForceKickPlayer();
	void KickIdler();
	void GameEnding();
	void STATIC_NotifyNavigationChanged();
	void DoNavFearCostFallOff();
	void STATIC_ShouldStartInCinematicMode();
	void Timer();
	void STATIC_ResetLevel();
	void STATIC_ShouldReset();
	void STATIC_Reset();
	void DisplayDebug();
	void PostBeginPlay();
	void STATIC_GetCoverReplicator();
	void PreBeginPlay();
	void STATIC_GetMapCommonPackageName();
	void STATIC_GetSupportedGameTypes();
};


// Class Engine.Mutator
// 0x001C (0x0290 - 0x0274)
class AMutator : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0274(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Mutator");
		return ptr;
	}


	void STATIC_NetDamage();
	void STATIC_ScoreKill();
	void STATIC_ScoreObjective();
	void STATIC_PreventDeath();
	void STATIC_OverridePickupQuery();
	void CheckEndGame();
	void STATIC_HandleRestartGame();
	void STATIC_FindPlayerStart();
	void GetSeamlessTravelActorList();
	void STATIC_InitMutator();
	void DriverLeftVehicle();
	void CanLeaveVehicle();
	void DriverEnteredVehicle();
	void STATIC_NotifyLogin();
	void STATIC_NotifyLogout();
	void CheckReplacement();
	void CheckRelevance();
	void STATIC_IsRelevant();
	void AlwaysKeep();
	void AddMutator();
	void STATIC_ModifyPlayer();
	void STATIC_ModifyLogin();
	void STATIC_Mutate();
	void Destroyed();
	void STATIC_MutatorIsAllowed();
	void PreBeginPlay();
};


// Class Engine.PotentialClimbWatcher
// 0x0000 (0x0274 - 0x0274)
class APotentialClimbWatcher : public AInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PotentialClimbWatcher");
		return ptr;
	}


	void Tick();
};


// Class Engine.Route
// 0x0024 (0x0298 - 0x0274)
class ARoute : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x0274(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Route");
		return ptr;
	}


	void STATIC_MoveOntoRoutePath();
	void STATIC_ResolveRouteIndex();
};


// Class Engine.WindPointSource
// 0x0008 (0x027C - 0x0274)
class AWindPointSource : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0274(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.WindPointSource");
		return ptr;
	}

};


// Class Engine.Inventory
// 0x0074 (0x02E8 - 0x0274)
class AInventory : public AActor
{
public:
	unsigned char                                      UnknownData00[0x74];                                      // 0x0274(0x0074) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Inventory");
		return ptr;
	}


	void STATIC_GetLocalString();
	void DropFrom();
	void DenyPickupQuery();
	void STATIC_ItemRemovedFromInvManager();
	void ClientGivenTo();
	void STATIC_GivenTo();
	void AnnouncePickup();
	void STATIC_GiveTo();
	void DetourWeight();
	void BotDesireability();
	void Destroyed();
	void STATIC_GetHumanReadableName();
};


// Class Engine.Weapon
// 0x00D0 (0x03B8 - 0x02E8)
class AWeapon : public AInventory
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x02E8(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Weapon");
		return ptr;
	}


	void STATIC_GetTargetDistance();
	void CacheAIController();
	void WeaponIsDown();
	void StillFiring();
	void STATIC_ShouldRefire();
	void STATIC_NotifyWeaponFinishedFiring();
	void STATIC_NotifyWeaponFired();
	void STATIC_HandleFinishedFiring();
	void TryPutDown();
	void GetPhysicalFireStartLoc();
	void GetMuzzleLoc();
	void CustomFire();
	void STATIC_ProjectileFire();
	void STATIC_ProcessInstantHit();
	void STATIC_InstantFire();
	void STATIC_PassThroughDamage();
	void CalcWeaponFire();
	void STATIC_GetTraceOwner();
	void GetTraceRange();
	void STATIC_GetAdjustedAim();
	void STATIC_FireAmmunition();
	void STATIC_FireModeUpdated();
	void STATIC_SetCurrentFireMode();
	void STATIC_SendToFiringState();
	void STATIC_ForceEndFire();
	void EndFire();
	void STATIC_ServerStopFire();
	void StopFire();
	void BeginFire();
	void STATIC_ServerStartFire();
	void STATIC_StartFire();
	void ClientWeaponSet();
	void ClientGivenTo();
	void DetachWeapon();
	void AttachWeaponTo();
	void ClearFlashLocation();
	void STATIC_SetFlashLocation();
	void ClearFlashCount();
	void STATIC_IncrementFlashCount();
	void WeaponEmpty();
	void DenyPickupQuery();
	void STATIC_PutDownWeapon();
	void Activate();
	void TimeWeaponEquipping();
	void TimeWeaponPutDown();
	void STATIC_RefireCheckTimer();
	void TimeWeaponFiring();
	void STATIC_GetFireInterval();
	void StopFireEffects();
	void STATIC_PlayFireEffects();
	void StopWeaponAnimation();
	void STATIC_PlayWeaponAnimation();
	void STATIC_GetWeaponAnimNodeSeq();
	void STATIC_FireOnRelease();
	void CanAttack();
	void STATIC_GetWeaponRating();
	void STATIC_GetAIRating();
	void STATIC_MaxRange();
	void AddSpread();
	void STATIC_GetProjectileClass();
	void ClearPendingFire();
	void STATIC_SetPendingFire();
	void STATIC_PendingFire();
	void STATIC_GetPendingFireLength();
	void STATIC_HasAnyAmmo();
	void STATIC_HasAmmo();
	void AddAmmo();
	void ConsumeAmmo();
	void STATIC_GetWeaponDebug();
	void DisplayDebug();
	void DenyClientWeaponSet();
	void IsFiring();
	void ClientWeaponThrown();
	void CanThrow();
	void DropFrom();
	void DoOverridePrevWeapon();
	void DoOverrideNextWeapon();
	void STATIC_HolderDied();
	void STATIC_ItemRemovedFromInvManager();
	void Destroyed();
};


// Class Engine.InventoryManager
// 0x002C (0x02A0 - 0x0274)
class AInventoryManager : public AActor
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0274(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.InventoryManager");
		return ptr;
	}


	void UpdateController();
	void ClientWeaponSet();
	void ChangedWeapon();
	void ClearPendingWeapon();
	void CancelWeaponChange();
	void STATIC_SetPendingWeapon();
	void STATIC_InternalSetCurrentWeapon();
	void STATIC_ServerSetCurrentWeapon();
	void STATIC_SetCurrentWeapon();
	void STATIC_NextWeapon();
	void STATIC_PrevWeapon();
	void SwitchToBestWeapon();
	void STATIC_GetBestWeapon();
	void STATIC_GetWeaponRatingFor();
	void DrawHUD();
	void STATIC_OwnerDied();
	void DiscardInventory();
	void STATIC_RemoveFromInventory();
	void AddInventory();
	void CreateInventory();
	void FindInventoryType();
	void STATIC_HandlePickupQuery();
	void Destroyed();
	void STATIC_SetupFor();
	void STATIC_InventoryActors();
	void ClearAllPendingFire();
	void STATIC_IsPendingFire();
	void ClearPendingFire();
	void STATIC_SetPendingFire();
	void STATIC_GetPendingFireLength();
	void PostBeginPlay();
};


// Class Engine.Keypoint
// 0x0008 (0x027C - 0x0274)
class AKeypoint : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0274(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Keypoint");
		return ptr;
	}

};


// Class Engine.TargetPoint
// 0x000C (0x0288 - 0x027C)
class ATargetPoint : public AKeypoint
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x027C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.TargetPoint");
		return ptr;
	}

};


// Class Engine.MaterialInstanceActor
// 0x0008 (0x027C - 0x0274)
class AMaterialInstanceActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0274(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.MaterialInstanceActor");
		return ptr;
	}

};


// Class Engine.MatineeActor
// 0x00E0 (0x0354 - 0x0274)
class AMatineeActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0xE0];                                      // 0x0274(0x00E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.MatineeActor");
		return ptr;
	}


	void CheckPriorityRefresh();
	void Update();
	void AddAIGroupActor();
};


// Class Engine.NavigationPoint
// 0x0118 (0x038C - 0x0274)
class ANavigationPoint : public AActor
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x0274(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NavigationPoint");
		return ptr;
	}


	void GetDebugAbbrev();
	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_ShouldSaveForCheckpoint();
	void ShutDown();
	void STATIC_OnToggle();
	void STATIC_IsOnDifferentNetwork();
	void STATIC_GetAllNavInRadius();
	void STATIC_GetNearestNavToPoint();
	void STATIC_GetNearestNavToActor();
	void STATIC_ProceedWithMove();
	void SuggestMovePreparation();
	void DetourWeight();
	void Accept();
	void SpecialCost();
	void CanTeleport();
	void STATIC_IsUsableAnchorFor();
	void STATIC_GetReachSpecTo();
	void STATIC_GetBoundingCylinder();
};


// Class Engine.CoverLink
// 0x0099 (0x0425 - 0x038C)
class ACoverLink : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x99];                                      // 0x038C(0x0099) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.CoverLink");
		return ptr;
	}


	void GetDebugAbbrev();
	void STATIC_GetLocationDescription();
	void GetDebugString();
	void AddCoverSlot();
	void BreakFracturedMeshes();
	void STATIC_GetSwatTurnTarget();
	void ShutDown();
	void ApplyCheckpointRecord();
	void CreateCheckpointRecord();
	void STATIC_OnToggle();
	void IsEnabled();
	void AutoAdjustSlot();
	void STATIC_OnModifyCover();
	void SetSlotPlayerOnly();
	void STATIC_NotifySlotOwnerCoverDisabled();
	void SetSlotEnabled();
	void SetDisabled();
	void STATIC_GetSlotActions();
	void STATIC_HasFireLinkTo();
	void STATIC_GetFireLinkTo();
	void AllowLeftTransition();
	void AllowRightTransition();
	void STATIC_GetSlotIdxToRight();
	void STATIC_GetSlotIdxToLeft();
	void STATIC_IsRightEdgeSlot();
	void STATIC_IsLeftEdgeSlot();
	void STATIC_IsEdgeSlot();
	void STATIC_FindSlots();
	void STATIC_IsStationarySlot();
	void STATIC_IsValidClaimBetween();
	void STATIC_IsValidClaim();
	void UnClaim();
	void Claim();
	void SetInvalidUntil();
	void STATIC_IsExposedTo();
	void STATIC_GetSlotViewPoint();
	void STATIC_GetSlotRotation();
	void STATIC_GetSlotLocation();
	void UnPackFireLinkInteractionInfo();
	void STATIC_PackFireLinkInteractionInfo();
	void STATIC_GetFireLinkTargetCoverInfo();
};


// Class Engine.DoorMarker
// 0x0018 (0x03A4 - 0x038C)
class ADoorMarker : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x038C(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DoorMarker");
		return ptr;
	}


	void SuggestMovePreparation();
	void STATIC_ProceedWithMove();
	void SpecialHandling();
	void STATIC_MoverClosed();
	void STATIC_MoverOpened();
	void PostBeginPlay();
};


// Class Engine.DynamicAnchor
// 0x0008 (0x0394 - 0x038C)
class ADynamicAnchor : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x038C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DynamicAnchor");
		return ptr;
	}

};


// Class Engine.Ladder
// 0x0010 (0x039C - 0x038C)
class ALadder : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x038C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Ladder");
		return ptr;
	}


	void SuggestMovePreparation();
};


// Class Engine.AutoLadder
// 0x0000 (0x039C - 0x039C)
class AAutoLadder : public ALadder
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.AutoLadder");
		return ptr;
	}

};


// Class Engine.LiftCenter
// 0x0028 (0x03B4 - 0x038C)
class ALiftCenter : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x038C(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LiftCenter");
		return ptr;
	}


	void STATIC_ProceedWithMove();
	void SuggestMovePreparation();
	void SpecialHandling();
	void PostBeginPlay();
};


// Class Engine.LiftExit
// 0x000C (0x0398 - 0x038C)
class ALiftExit : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x038C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LiftExit");
		return ptr;
	}


	void SuggestMovePreparation();
	void WaitForLift();
	void CanBeReachedFromLiftBy();
};


// Class Engine.PathNode
// 0x0000 (0x038C - 0x038C)
class APathNode : public ANavigationPoint
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PathNode");
		return ptr;
	}


	void GetDebugAbbrev();
};


// Class Engine.VolumePathNode
// 0x0008 (0x0394 - 0x038C)
class AVolumePathNode : public APathNode
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x038C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.VolumePathNode");
		return ptr;
	}

};


// Class Engine.PickupFactory
// 0x002C (0x03B8 - 0x038C)
class APickupFactory : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x038C(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PickupFactory");
		return ptr;
	}


	void DelayRespawn();
	void Destroyed();
	void STATIC_SetPickupVisible();
	void STATIC_SetPickupHidden();
	void STATIC_RespawnEffect();
	void STATIC_GetRespawnTime();
	void STATIC_RecheckValidTouch();
	void STATIC_PickedUpBy();
	void STATIC_GiveTo();
	void STATIC_ReadyToPickup();
	void STATIC_SpawnCopyFor();
	void DetourWeight();
	void StartSleeping();
	void STATIC_SetRespawn();
	void CheckForErrors();
	void STATIC_Reset();
	void SetPickupMesh();
	void ShutDown();
	void SetInitialState();
	void STATIC_InitializePickup();
	void PreBeginPlay();
	void ReplicatedEvent();
};


// Class Engine.PlayerStart
// 0x0010 (0x039C - 0x038C)
class APlayerStart : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x038C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PlayerStart");
		return ptr;
	}


	void PostRenderFor();
	void STATIC_OnToggle();
};


// Class Engine.PortalMarker
// 0x0008 (0x0394 - 0x038C)
class APortalMarker : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x038C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PortalMarker");
		return ptr;
	}


	void CanTeleport();
};


// Class Engine.Pylon
// 0x0118 (0x04A4 - 0x038C)
class APylon : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x038C(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Pylon");
		return ptr;
	}


	void CanReachPylon();
	void STATIC_OnToggle();
	void IsEnabled();
	void SetEnabled();
	void PostBeginPlay();
	void NotifyPathChanged();
	void VerifyTopLevelConnections();
	void STATIC_GetTestPathExtent();
	void STATIC_FlushDynamicEdges();
	void UpdateMeshForPreExistingNavMeshObstacles();
	void STATIC_OnPylonStatusChange();
};


// Class Engine.AISwitchablePylon
// 0x0004 (0x04A8 - 0x04A4)
class AAISwitchablePylon : public APylon
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x04A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.AISwitchablePylon");
		return ptr;
	}


	void IsEnabled();
	void SetEnabled();
	void PostBeginPlay();
};


// Class Engine.DynamicPylon
// 0x0004 (0x04A8 - 0x04A4)
class ADynamicPylon : public APylon
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x04A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DynamicPylon");
		return ptr;
	}


	void StoppedMoving();
	void StartedMoving();
	void STATIC_FlushDynamicEdges();
	void STATIC_RebuildDynamicEdges();
	void PostBeginPlay();
};


// Class Engine.Teleporter
// 0x002C (0x03B8 - 0x038C)
class ATeleporter : public ANavigationPoint
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x038C(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Teleporter");
		return ptr;
	}


	void SpecialHandling();
	void PostTouch();
	void Touch();
	void Accept();
	void PostBeginPlay();
	void CanTeleport();
};


// Class Engine.Note
// 0x0010 (0x0284 - 0x0274)
class ANote : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0274(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Note");
		return ptr;
	}

};


// Class Engine.NoteBalloon
// 0x0014 (0x0298 - 0x0284)
class ANoteBalloon : public ANote
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0284(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NoteBalloon");
		return ptr;
	}

};


// Class Engine.Projectile
// 0x005C (0x02D0 - 0x0274)
class AProjectile : public AActor
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x0274(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Projectile");
		return ptr;
	}


	void ApplyFluidSurfaceImpact();
	void STATIC_GetRange();
	void StaticGetTimeToLocation();
	void STATIC_GetTimeToLocation();
	void FellOutOfWorld();
	void STATIC_IsStationary();
	void STATIC_RandSpin();
	void Explode();
	void EncroachedBy();
	void HitWall();
	void STATIC_ProcessTouch();
	void Touch();
	void STATIC_HurtRadius();
	void STATIC_ProjectileHurtRadius();
	void STATIC_Reset();
	void CanSplash();
	void STATIC_GetTeamNum();
	void Init();
	void PostBeginPlay();
	void PreBeginPlay();
	void EncroachingOn();
};


// Class Engine.RigidBodyBase
// 0x0000 (0x0274 - 0x0274)
class ARigidBodyBase : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.RigidBodyBase");
		return ptr;
	}

};


// Class Engine.SceneCaptureActor
// 0x0008 (0x027C - 0x0274)
class ASceneCaptureActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0274(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneCaptureActor");
		return ptr;
	}


	void STATIC_OnToggle();
};


// Class Engine.SceneCapture2DActor
// 0x0008 (0x0284 - 0x027C)
class ASceneCapture2DActor : public ASceneCaptureActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x027C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneCapture2DActor");
		return ptr;
	}

};


// Class Engine.SceneCaptureCubeMapActor
// 0x0010 (0x028C - 0x027C)
class ASceneCaptureCubeMapActor : public ASceneCaptureActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x027C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneCaptureCubeMapActor");
		return ptr;
	}

};


// Class Engine.SceneCaptureReflectActor
// 0x0010 (0x028C - 0x027C)
class ASceneCaptureReflectActor : public ASceneCaptureActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x027C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneCaptureReflectActor");
		return ptr;
	}

};


// Class Engine.SceneCapturePortalActor
// 0x0000 (0x028C - 0x028C)
class ASceneCapturePortalActor : public ASceneCaptureReflectActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneCapturePortalActor");
		return ptr;
	}

};


// Class Engine.PortalTeleporter
// 0x001C (0x02A8 - 0x028C)
class APortalTeleporter : public ASceneCapturePortalActor
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x028C(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PortalTeleporter");
		return ptr;
	}


	void StopsProjectile();
	void CreatePortalTexture();
	void TransformHitLocation();
	void TransformVectorDir();
	void TransformActor();
};


// Class Engine.StaticMeshActorBase
// 0x0000 (0x0274 - 0x0274)
class AStaticMeshActorBase : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.StaticMeshActorBase");
		return ptr;
	}

};


// Class Engine.StaticMeshActor
// 0x0025 (0x0299 - 0x0274)
class AStaticMeshActor : public AStaticMeshActorBase
{
public:
	unsigned char                                      UnknownData00[0x25];                                      // 0x0274(0x0025) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.StaticMeshActor");
		return ptr;
	}


	void PreBeginPlay();
};


// Class Engine.StaticMeshCollectionActor
// 0x0014 (0x0288 - 0x0274)
class AStaticMeshCollectionActor : public AStaticMeshActorBase
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0274(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.StaticMeshCollectionActor");
		return ptr;
	}

};


