#pragma once

// Lost Ark (1.12.11.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_EFGame_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class EFGame.EFActionNotify_AnimEvent
// 0x001C (0x0074 - 0x0058)
class UEFActionNotify_AnimEvent : public UObject
{
public:
	struct FString                                     Desc;                                                     // 0x0058(0x0010) (NonTransactional, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      IsActive : 1;                                             // 0x0068(0x0004) (NonTransactional, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              StartTime;                                                // 0x006C(0x0004) (NonTransactional, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              InterpTime;                                               // 0x0070(0x0004) (NonTransactional, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_CancelParticles
// 0x0000 (0x0074 - 0x0074)
class UEFActionNotify_AnimEvent_CancelParticles : public UEFActionNotify_AnimEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_CancelParticles");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor
// 0x0030 (0x00A4 - 0x0074)
class UEFActionNotify_AnimEvent_MaterialParamterLinearColor : public UEFActionNotify_AnimEvent
{
public:
	struct FString                                     ParamName;                                                // 0x0074(0x0010) (EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FLinearColor                                StartValue;                                               // 0x0084(0x0010) (EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FLinearColor                                EndValue;                                                 // 0x0094(0x0010) (EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar
// 0x0018 (0x008C - 0x0074)
class UEFActionNotify_AnimEvent_MaterialParamterScalar : public UEFActionNotify_AnimEvent
{
public:
	struct FString                                     ParamName;                                                // 0x0074(0x0010) (Interp, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              StartValue;                                               // 0x0084(0x0004) (Interp, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              EndValue;                                                 // 0x0088(0x0004) (Interp, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar");
		return ptr;
	}

};


// Class EFGame.EFActorMotionBase
// 0x0000 (0x0058 - 0x0058)
class UEFActorMotionBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionBase");
		return ptr;
	}

};


// Class EFGame.EFActorMotionLocationCycle
// 0x0019 (0x0071 - 0x0058)
class UEFActorMotionLocationCycle : public UEFActorMotionBase
{
public:
	float                                              fTime;                                                    // 0x0058(0x0004)
	struct FVector                                     vPreValue;                                                // 0x005C(0x000C)
	float                                              fMotionRange;                                             // 0x0068(0x0004) (Interp, NonTransactional, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              fMotionCycle;                                             // 0x006C(0x0004) (Interp, NonTransactional, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x0070(0x0001) (Interp, NonTransactional, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionLocationCycle");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationAcyclic
// 0x0005 (0x005D - 0x0058)
class UEFActorMotionRotationAcyclic : public UEFActorMotionBase
{
public:
	float                                              fMotionVel;                                               // 0x0058(0x0004) (RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x005C(0x0001) (RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationAcyclic");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationCyclic
// 0x0019 (0x0071 - 0x0058)
class UEFActorMotionRotationCyclic : public UEFActorMotionBase
{
public:
	float                                              fTime;                                                    // 0x0058(0x0004)
	struct FRotator                                    vPreValue;                                                // 0x005C(0x000C)
	float                                              fMotionRange;                                             // 0x0068(0x0004) (Interp, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              fMotionCycle;                                             // 0x006C(0x0004) (Interp, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x0070(0x0001) (Interp, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationCyclic");
		return ptr;
	}

};


// Class EFGame.EFAfterImageSkeletalMeshComponent
// 0x0000 (0x08E8 - 0x08E8)
class UEFAfterImageSkeletalMeshComponent : public USkeletalMeshComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAfterImageSkeletalMeshComponent");
		return ptr;
	}

};


// Class EFGame.EFAkAudioDevice
// 0x0240 (0x0300 - 0x00C0)
class UEFAkAudioDevice : public UAkAudioDevice
{
public:
	unsigned char                                      UnknownData00[0x240];                                     // 0x00C0(0x0240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAkAudioDevice");
		return ptr;
	}

};


// Class EFGame.EFAN_Params
// 0x001C (0x0074 - 0x0058)
class UEFAN_Params : public UObject
{
public:
	struct FString                                     Desc;                                                     // 0x0058(0x0010) (EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      IsActive : 1;                                             // 0x0068(0x0004) (EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              StartTime;                                                // 0x006C(0x0004) (EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              InterpTime;                                               // 0x0070(0x0004) (EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Params");
		return ptr;
	}

};


// Class EFGame.EFAN_Particle
// 0x017C (0x01F0 - 0x0074)
class UEFAN_Particle : public UEFAN_Params
{
public:
	struct FString                                     LookInfoKey;                                              // 0x0074(0x0010) (Interp, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              RelativeSpawnTime;                                        // 0x0084(0x0004) (Interp, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              DurationTime;                                             // 0x0088(0x0004) (Interp, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FEFParticleSystemInfo                       ParticleInfo;                                             // 0x008C(0x0158)
	class UEFParticleData*                             ParticleDataInfo;                                         // 0x01E4(0x0008) (Interp, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bSkipIfOwnerIsHidden : 1;                                 // 0x01EC(0x0004) (Interp, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Particle");
		return ptr;
	}

};


// Class EFGame.EFAN_Trail
// 0x001C (0x0090 - 0x0074)
class UEFAN_Trail : public UEFAN_Params
{
public:
	float                                              RelativeSpawnTime;                                        // 0x0074(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              Duration;                                                 // 0x0078(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	class UAnimNotify_Trails*                          AnimTrails;                                               // 0x007C(0x0008) (RepNotify, NonTransactional, EditorOnly, ArchetypeProperty, EditHide)
	TEnumAsByte<EFEQUIP_PART>                          TrailParts;                                               // 0x0084(0x0001) (RepNotify, NonTransactional, EditorOnly, ArchetypeProperty, EditHide)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
	int                                                TrailPartsIndex;                                          // 0x0088(0x0004) (RepNotify, NonTransactional, EditorOnly, ArchetypeProperty, EditHide)
	unsigned long                                      bSkipIfOwnerIsHidden : 1;                                 // 0x008C(0x0004) (RepNotify, NonTransactional, EditorOnly, ArchetypeProperty, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Trail");
		return ptr;
	}

};


// Class EFGame.EFBarrier
// 0x0008 (0x027C - 0x0274)
class AEFBarrier : public AActor
{
public:
	class UStaticMeshComponent*                        StaticMeshComponent;                                      // 0x0274(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBarrier");
		return ptr;
	}

};


// Class EFGame.EFCharacterParts
// 0x002C (0x05B4 - 0x0588)
class AEFCharacterParts : public APawn
{
public:
	struct FName                                       AttachSocketName;                                         // 0x0588(0x0008)
	class UEFPartsSkelComponent*                       PartsMeshComponent;                                       // 0x0590(0x0008)
	class APawn*                                       ParentPawn;                                               // 0x0598(0x0008)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x05A0(0x0008)
	int                                                AttachedPSIIndex;                                         // 0x05A8(0x0004)
	class AEFPawn*                                     AttachOtherPawn;                                          // 0x05AC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCharacterParts");
		return ptr;
	}


	void OnParticleSystemFinished();
	void ClearAttachedPSIIndex();
	void NotifyChangedBase();
	void BaseChange();
	void EncroachingOn();
	void EncroachedBy();
	void Destroyed();
};


// Class EFGame.EFCheatManager
// 0x0000 (0x0098 - 0x0098)
class UEFCheatManager : public UGameCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCheatManager");
		return ptr;
	}


	void InternalDebugLookAt();
	void InternalVisualizePhysicsCompartmentUsage();
	void InternalSetPhysicsCompartmentCount();
	void InternalTogglePhysicsCompartmentForEFPawns();
	void InternalSetCamTargetBlendTime();
	void InternalClearCamTarget();
	void InternalSetCamTarget();
	void InternalCamPrevTarget();
	void InternalCamNextTarget();
	void InternalGetPlayerCamera();
	void InternalToggleCullDistanceVolume();
	void InternalToggleCPUSkinning();
	void InternalToggleOneFrameThreadLag();
	void InternalToggleUpdateDLEOptimize();
	void InternalToggleMeshObjectUpdateOptimize();
	void InternalToggleUpdateBoundsOptimize();
	void InternalToggleDynamicFoliageOptimize();
	void InternalToggleCameraODAOptimize();
	void InternalToggleParticleOptimizeILG();
};


// Class EFGame.EFClient
// 0x0030 (0x0268 - 0x0238)
class UEFClient : public UWindowsClient
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0238(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFClient");
		return ptr;
	}

};


// Class EFGame.EFConsole
// 0x0014 (0x027C - 0x0268)
class UEFConsole : public UConsole
{
public:
	TArray<struct FEFAutoCompleteCommand>              EFAutoCompleteCommandList;                                // 0x0268(0x0010)
	unsigned long                                      bInputPaused : 1;                                         // 0x0278(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFConsole");
		return ptr;
	}


	void IsValidEFCommand();
	void InputAxis();
	void InputKey();
};


// Class EFGame.EFDecalCollisionComponent
// 0x000C (0x0290 - 0x0284)
class UEFDecalCollisionComponent : public UPrimitiveComponent
{
public:
	float                                              ApplyOwnerSizeRate;                                       // 0x0284(0x0004) (NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FColor                                      DecalCollisionColor;                                      // 0x0288(0x0004) (NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bDrawBoundingBox : 1;                                     // 0x028C(0x0004)
	unsigned long                                      bDrawNonColliding : 1;                                    // 0x028C(0x0004)
	unsigned long                                      bAlwaysRenderIfSelected : 1;                              // 0x028C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalCollisionComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalComponent
// 0x0010 (0x0420 - 0x0410)
class UEFDecalComponent : public UDecalComponent
{
public:
	unsigned long                                      bSkipChangeLocation : 1;                                  // 0x0410(0x0004)
	unsigned long                                      bFirstUpdate : 1;                                         // 0x0410(0x0004)
	unsigned long                                      bSpawnedByParticleModule : 1;                             // 0x0410(0x0004)
	unsigned long                                      bDropDistortion : 1;                                      // 0x0410(0x0004)
	struct FVector                                     SpawnLocation;                                            // 0x0414(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalFloorActor
// 0x000C (0x0290 - 0x0284)
class AEFDecalFloorActor : public ADecalActor
{
public:
	unsigned long                                      bUseFloorChecks : 1;                                      // 0x0284(0x0004) (Interp, NonTransactional, NotForConsole, RepRetry, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UEFDecalCollisionComponent*                  FloorCollisionComponent;                                  // 0x0288(0x0008) (Interp, NonTransactional, NotForConsole, RepRetry, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalFloorActor");
		return ptr;
	}


	void GetBoundingCylinder();
};


// Class EFGame.EFDecalManager
// 0x0000 (0x02B8 - 0x02B8)
class AEFDecalManager : public ADecalManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalManager");
		return ptr;
	}


	void SpawnDecalMinimal();
};


// Class EFGame.EFFracturedStaticMeshActor
// 0x0004 (0x0314 - 0x0310)
class AEFFracturedStaticMeshActor : public AFracturedStaticMeshActor
{
public:
	int                                                FracturedId;                                              // 0x0310(0x0004) (NonTransactional, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFFracturedStaticMeshActor");
		return ptr;
	}

};


// Class EFGame.EFGameInfo
// 0x0248 (0x0708 - 0x04C0)
class AEFGameInfo : public AGameInfo
{
public:
	unsigned long                                      bShowLikeMouseOver : 1;                                   // 0x04C0(0x0004)
	unsigned long                                      bNameTagAlpha : 1;                                        // 0x04C0(0x0004)
	unsigned long                                      bNameTagMonShowAll : 1;                                   // 0x04C0(0x0004)
	unsigned long                                      bIsPIE : 1;                                               // 0x04C0(0x0004)
	unsigned long                                      bIsMapLoaded : 1;                                         // 0x04C0(0x0004)
	struct FNameTagAlphaInfo                           sNameTagAlpha;                                            // 0x04C4(0x0010)
	struct FNameTagMonInfo                             sDefaultNameTagMon;                                       // 0x04D4(0x0004)
	struct FNameTagMonInfo                             sMouseOverNameTagMon;                                     // 0x04D8(0x0004)
	float                                              fNameTagHeight;                                           // 0x04DC(0x0004)
	struct FString                                     DefaultServerAddress;                                     // 0x04E0(0x0010)
	int                                                DefaultServerPort;                                        // 0x04F0(0x0004)
	int                                                DefaultPCClassId;                                         // 0x04F4(0x0004)
	struct FString                                     DefaultPCName;                                            // 0x04F8(0x0010)
	struct FString                                     DefaultLoginID;                                           // 0x0508(0x0010)
	struct FString                                     DefaultLoginPass;                                         // 0x0518(0x0010)
	int                                                DefaultMapID;                                             // 0x0528(0x0004)
	int                                                CurrentMapIndex;                                          // 0x052C(0x0004)
	TEnumAsByte<EZoneLevel>                            MapLevel;                                                 // 0x0530(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0531(0x0003) MISSED OFFSET
	struct FString                                     QuestBalloonTalkFxPath;                                   // 0x0534(0x0010)
	struct FString                                     FriendshipFxPath;                                         // 0x0544(0x0010)
	struct FString                                     QuestUnableStartFxPath;                                   // 0x0554(0x0010)
	struct FString                                     QuestReadyFxPath;                                         // 0x0564(0x0010)
	struct FString                                     QuestStartFxPath;                                         // 0x0574(0x0010)
	struct FString                                     QuestProgressFxPath;                                      // 0x0584(0x0010)
	struct FString                                     QuestCompleteFxPath;                                      // 0x0594(0x0010)
	struct FString                                     StartQuestPropFxPath;                                     // 0x05A4(0x0010)
	struct FString                                     QuestBasicInteractionFxPath;                              // 0x05B4(0x0010)
	struct FString                                     QuestEmptyMeshInteractionFxPath;                          // 0x05C4(0x0010)
	struct FString                                     QuestVolumeInteractionFxPath;                             // 0x05D4(0x0010)
	struct FString                                     QuestLifeProfessionInteractionFxPath;                     // 0x05E4(0x0010)
	struct FString                                     StaticIslandWithContinentQuestFxPath;                     // 0x05F4(0x0010)
	struct FString                                     LifeProfessionMonsterHuntingMarkFxPath;                   // 0x0604(0x0010)
	struct FString                                     QuestFxAttachBoneName;                                    // 0x0614(0x0010)
	struct FVector                                     QuestRelativeLoc;                                         // 0x0624(0x000C)
	struct FString                                     AnchorModeCamAnim;                                        // 0x0630(0x0010)
	float                                              AnchorModeCamDegree;                                      // 0x0640(0x0004)
	struct FString                                     InteractionCamAnim_Ship;                                  // 0x0644(0x0010)
	int                                                InteractionDistance_Ship;                                 // 0x0654(0x0004)
	struct FString                                     InteractionCamAnim_Low;                                   // 0x0658(0x0010)
	int                                                InteractionDistance_Low;                                  // 0x0668(0x0004)
	struct FString                                     InteractionCamAnim_Middle;                                // 0x066C(0x0010)
	int                                                InteractionDistance_Middle;                               // 0x067C(0x0004)
	struct FString                                     InteractionCamAnim_High;                                  // 0x0680(0x0010)
	int                                                InteractionDistance_High;                                 // 0x0690(0x0004)
	int                                                ApproachEvent_Distance;                                   // 0x0694(0x0004)
	struct FString                                     InteractionNextLinkSound;                                 // 0x0698(0x0010)
	TArray<class UMaterialInstanceConstant*>           EffectFenceMICs;                                          // 0x06A8(0x0010)
	TArray<class AEFSceneCapture2DActor*>              CaptureActors;                                            // 0x06B8(0x0010)
	TArray<class AEFSceneCaptureObjectLocation*>       CaptureObjectLocations;                                   // 0x06C8(0x0010)
	TArray<class AActor*>                              HeadStatusActors;                                         // 0x06D8(0x0010)
	TArray<int>                                        HeadStatusActorIndexPools;                                // 0x06E8(0x0010)
	TArray<class AActor*>                              PoolBindActors;                                           // 0x06F8(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGameInfo");
		return ptr;
	}


	void AllowCheats();
	void PostSeamlessTravel();
	void GameEnding();
	void NotifyMapLoaded();
	void NotfiyLoadingStep();
	void Tick();
	void PostLogin();
	void Login();
	void LoadLevel();
	void RestartPlayer();
	void InitGame();
	void GenericPlayerInitialization();
};


// Class EFGame.EFMotionSkeletalMeshActor
// 0x002C (0x033C - 0x0310)
class AEFMotionSkeletalMeshActor : public ASkeletalMeshActor
{
public:
	struct FVector                                     vOriginLocation;                                          // 0x0310(0x000C)
	struct FRotator                                    vOriginRotation;                                          // 0x031C(0x000C)
	unsigned long                                      bSaveSMCLocNRot : 1;                                      // 0x0328(0x0004)
	unsigned long                                      bMotionToggle : 1;                                        // 0x0328(0x0004) (RepNotify, RepRetry, ProtectedWrite, EditHide)
	TArray<class UEFActorMotionBase*>                  MotionArr;                                                // 0x032C(0x0010) (RepNotify, RepRetry, ProtectedWrite, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFMotionStaticMeshActor
// 0x002C (0x033C - 0x0310)
class AEFMotionStaticMeshActor : public AInterpActor
{
public:
	struct FVector                                     vOriginLocation;                                          // 0x0310(0x000C)
	struct FRotator                                    vOriginRotation;                                          // 0x031C(0x000C)
	unsigned long                                      bSaveSMCLocNRot : 1;                                      // 0x0328(0x0004)
	unsigned long                                      bMotionToggle : 1;                                        // 0x0328(0x0004) (RepNotify, RepRetry, ProtectedWrite, EditHide)
	TArray<class UEFActorMotionBase*>                  MotionArr;                                                // 0x032C(0x0010) (RepNotify, RepRetry, ProtectedWrite, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionStaticMeshActor");
		return ptr;
	}

};


// Class EFGame.EFParticleSkeletalMeshActor
// 0x0094 (0x0308 - 0x0274)
class AEFParticleSkeletalMeshActor : public AActor
{
public:
	TArray<struct FEFAnimDataItem>                     AnimDataList;                                             // 0x0274(0x0010)
	int                                                CurAnimDataIndex;                                         // 0x0284(0x0004)
	struct FName                                       CurAnimSeqName;                                           // 0x0288(0x0008)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0290(0x0008) (NonTransactional, EditorOnly, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	class UEFSkeletalMeshComponent*                    Mesh;                                                     // 0x0298(0x0008) (NonTransactional, EditorOnly, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	TArray<class UEFSkeletalMeshComponent*>            ManagedPartMeshs;                                         // 0x02A0(0x0010)
	TArray<struct FEFExtraSkelMeshInfo>                ExtraSkelMeshList;                                        // 0x02B0(0x0010)
	TArray<class UMaterialInterface*>                  Materials;                                                // 0x02C0(0x0010)
	class AActor*                                      OwnerActor;                                               // 0x02D0(0x0008)
	struct FString                                     OwnerLookInfoKey;                                         // 0x02D8(0x0010)
	float                                              NonAniGuaranteeDuration;                                  // 0x02E8(0x0004)
	unsigned long                                      bActionSpawned : 1;                                       // 0x02EC(0x0004)
	unsigned long                                      NeedStopAction : 1;                                       // 0x02EC(0x0004)
	TArray<struct FString>                             ActionNotifyTagList;                                      // 0x02F0(0x0010)
	float                                              PlayRate;                                                 // 0x0300(0x0004)
	int                                                AttachedPSIIndex;                                         // 0x0304(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFPawn
// 0x031C (0x08A4 - 0x0588)
class AEFPawn : public APawn
{
public:
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0588(0x0008) (Interp, NonTransactional, EditorOnly, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	class UEFActionObjectGroup*                        ActionObjectGroup;                                        // 0x0590(0x0008)
	unsigned long                                      bDefaultMeshHide : 1;                                     // 0x0598(0x0004)
	unsigned long                                      bRootMotionFallingCheck : 1;                              // 0x0598(0x0004)
	unsigned long                                      bCanDoFloorConform : 1;                                   // 0x0598(0x0004)
	unsigned long                                      bCanDoStepsSmoothing : 1;                                 // 0x0598(0x0004) (Interp, NonTransactional, EditorOnly, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      IsMatineePlay : 1;                                        // 0x0598(0x0004)
	unsigned long                                      PhysFallingByAction : 1;                                  // 0x0598(0x0004)
	unsigned long                                      bMergeAction : 1;                                         // 0x0598(0x0004)
	unsigned long                                      bIgnoreBlockActors : 1;                                   // 0x0598(0x0004)
	unsigned long                                      bEnableMaxRootMotionDistance : 1;                         // 0x0598(0x0004)
	unsigned long                                      RootMotionBeHitControlHeight : 1;                         // 0x0598(0x0004)
	unsigned long                                      bForceUniformVelocity : 1;                                // 0x0598(0x0004)
	unsigned long                                      bNeedMoveChangedBase : 1;                                 // 0x0598(0x0004)
	unsigned long                                      IsJustFinishedCinematicAnim : 1;                          // 0x0598(0x0004)
	unsigned long                                      bUseDynamicFoliage : 1;                                   // 0x0598(0x0004)
	unsigned long                                      bValidCurrentFloorTypeCheck : 1;                          // 0x0598(0x0004)
	unsigned long                                      bUseMeshMerge : 1;                                        // 0x0598(0x0004)
	unsigned long                                      bHideOnNextMeshMergeRequest : 1;                          // 0x0598(0x0004)
	unsigned long                                      bDisableJumpOffPawn : 1;                                  // 0x0598(0x0004)
	unsigned long                                      bGrabbed : 1;                                             // 0x0598(0x0004)
	unsigned long                                      bIgnoreStartFalling : 1;                                  // 0x0598(0x0004)
	unsigned long                                      bCinematicUnfixed : 1;                                    // 0x0598(0x0004)
	unsigned long                                      bCinematicChangeAngularSpring : 1;                        // 0x0598(0x0004)
	class UEFSkeletalMeshComponent*                    ExtendMesh;                                               // 0x059C(0x0008)
	TEnumAsByte<ERootBoneAxis>                         RootBoneOption[0x3];                                      // 0x05A4(0x0001)
	TEnumAsByte<EPhysics>                              ForceActionPhysics;                                       // 0x05A7(0x0001)
	TEnumAsByte<EBlockPCRootMotionSkillPenetrateType>  BlockPCRootMotionSkillPenetrate;                          // 0x05A8(0x0001)
	TEnumAsByte<EFMATERIAL_FOOTSTEP>                   CurrentFloorType;                                         // 0x05A9(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x05AA(0x0002) MISSED OFFSET
	struct FVector                                     LastFloorConformLocation;                                 // 0x05AC(0x000C)
	float                                              MTO_FloorConformZTranslation;                             // 0x05B8(0x0004)
	float                                              MTO_BlendedFloorConformZTranslation;                      // 0x05BC(0x0004)
	struct FVector                                     MRO_FloorConformRotationAxis;                             // 0x05C0(0x000C)
	float                                              MRO_FloorConformRotationAngle;                            // 0x05CC(0x0004)
	float                                              MRO_BlendedFloorConformRotationAngle;                     // 0x05D0(0x0004)
	float                                              MTO_MeshLocSmootherZOffset;                               // 0x05D4(0x0004)
	struct FVector                                     MeshOffset;                                               // 0x05D8(0x000C)
	struct FVector                                     LastLocation;                                             // 0x05E4(0x000C)
	float                                              DefaultGroundSpeed;                                       // 0x05F0(0x0004)
	float                                              GravityFactor;                                            // 0x05F4(0x0004)
	struct FVector                                     SkillStartPos;                                            // 0x05F8(0x000C)
	struct FVector                                     HitReactionPushLoc;                                       // 0x0604(0x000C)
	struct FVector                                     LastRootMotionAccumTranslation;                           // 0x0610(0x000C)
	struct FVector                                     RootMotionStartLoc;                                       // 0x061C(0x000C)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0628(0x0008) MISSED OFFSET
	struct FMatrix                                     RootMotionStartRot;                                       // 0x0630(0x0040)
	struct FVector                                     TargetRootMotionLoc;                                      // 0x0670(0x000C)
	float                                              MaxRootMotionDistance;                                    // 0x067C(0x0004)
	float                                              MaxRootMotionSquaredDistance;                             // 0x0680(0x0004)
	int                                                ChangeRootMotion;                                         // 0x0684(0x0004)
	int                                                PrevChangeRootMotion;                                     // 0x0688(0x0004)
	float                                              RootMotionBeHitControlSetTime;                            // 0x068C(0x0004)
	float                                              RootMotionBeHitControlDuration;                           // 0x0690(0x0004)
	float                                              RootMotionBeHitMaxHeight;                                 // 0x0694(0x0004)
	struct FRotator                                    MoveRotation;                                             // 0x0698(0x000C)
	class AEFPawn*                                     BlockedPawnWhenSkillStart;                                // 0x06A4(0x0008)
	class AActor*                                      CinematicActor;                                           // 0x06AC(0x0008)
	struct FBasedPosition                              CachedBasePositionBySelf;                                 // 0x06B4(0x0038)
	struct FBasedPosition                              CachedBasePositionByTarget;                               // 0x06EC(0x0038)
	struct FVector                                     SyncDeltaMove;                                            // 0x0724(0x000C)
	struct FVector                                     SaveLocation;                                             // 0x0730(0x000C)
	struct FRotator                                    SaveRotation;                                             // 0x073C(0x000C)
	struct FPlayerLocationInfo                         CinematicPlayerLocation;                                  // 0x0748(0x0008)
	struct FVector                                     UniformVelocity;                                          // 0x0750(0x000C)
	class AEFPawn*                                     DrivenEFVehicle;                                          // 0x075C(0x0008)
	struct FQWord                                      TryNextMoveTransitIndex;                                  // 0x0764(0x0008)
	TArray<class UMaterialInstanceConstant*>           AffectedFoliageMICs;                                      // 0x076C(0x0010)
	int                                                AttachedPSIIndex;                                         // 0x077C(0x0004)
	struct FEFBasedLocation                            PrevFloorCheckLocation;                                   // 0x0780(0x0010)
	struct FVector                                     LastRootMotionPosition;                                   // 0x0790(0x000C)
	float                                              LastRootMotionRecordedTime;                               // 0x079C(0x0004)
	class UEFMainSkelComponent*                        OriginMesh;                                               // 0x07A0(0x0008)
	struct FPointer                                    MeshMergeSourceLookInfoPointer;                           // 0x07A8(0x0008)
	TArray<struct FPointer>                            MeshMergeSourcePartsArray;                                // 0x07B0(0x0010)
	struct FVector                                     Momentum;                                                 // 0x07C0(0x000C)
	unsigned char                                      UnknownData02[0x48];                                      // 0x07CC(0x0048) UNKNOWN PROPERTY: MapProperty EFGame.EFPawn.TrailNotifyToParticleSystemMap
	class UAnimNodeAimOffset*                          AimOffsetAnimNode;                                        // 0x0814(0x0008)
	TArray<class AEFParticleSkeletalMeshActor*>        ActionParticleSkeletalMeshActors;                         // 0x081C(0x0010)
	struct FEFCharacterAfterImageEffectInfo            AfterImageInfo;                                           // 0x082C(0x0030)
	TArray<struct FEFAfterImageChildInfo>              AfterImageChildren;                                       // 0x085C(0x0010)
	class UEFActionObjectGroup*                        ActionGroup;                                              // 0x086C(0x0008)
	class UEFData_SkelControlGroup*                    SkelControlGroup;                                         // 0x0874(0x0008)
	struct FActorTickDropRate                          TickDropRate;                                             // 0x087C(0x0014)
	int                                                TickDropRatePriority;                                     // 0x0890(0x0004)
	TArray<int>                                        CinematicUnfixedBodyIndices;                              // 0x0894(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPawn");
		return ptr;
	}


	void StopAfterImageEffect();
	void StartAfterImageEffect();
	void GetAnimTrailParticleSystem();
	void ApplyFluidSurfaceContinuousForce();
	void ApplyFluidSurfaceImpact();
	void NotifyChangedBase();
	void BaseChange();
	void MAT_FinishAnimControl();
	void MAT_BeginAnimControl();
	void InterpolationFinished();
	void InterpolationStarted();
	void RigidBodyCollision();
	void DoKismetAttachment();
	void AttachmentCameraActor();
	void GetGravityZ();
	void OnForceFieldDestroy();
	void CreateForceField();
	void ExplodeActor();
	void FinishDyingDelay();
	void SetDefaultStateColor();
	void SetStateColor();
	void AttackFreezeAnim();
	void AttackContinueAnim();
	void SetPPOutlineWidth();
	void SetPPOutlineColor();
	void SetPPOutline();
	void SetCloakMode();
	void SetOccludedOutlineColor();
	void SetOccludedOutline();
	void OutsideWorldBounds();
	void FellOutOfWorld();
	void Landed();
	void Falling();
	void SetDesiredRotation();
	void OnParticleSystemFinished();
	void PostInitAll();
	void ClearAttachedPSIIndex();
	void Destroyed();
	void GetDefaultCameraMode();
	void GetObjectCameraStyle();
	void EncroachingOn();
	void EncroachedBy();
};


// Class EFGame.EFMonster
// 0x0000 (0x08A4 - 0x08A4)
class AEFMonster : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMonster");
		return ptr;
	}

};


// Class EFGame.EFNonPlayer
// 0x0000 (0x08A4 - 0x08A4)
class AEFNonPlayer : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFNonPlayer");
		return ptr;
	}

};


// Class EFGame.EFPet
// 0x0000 (0x08A4 - 0x08A4)
class AEFPet : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPet");
		return ptr;
	}

};


// Class EFGame.EFPlayer
// 0x0014 (0x08B8 - 0x08A4)
class AEFPlayer : public AEFPawn
{
public:
	class ULightEnvironmentComponent*                  PickupPropLightEnvironment;                               // 0x08A4(0x0008)
	int                                                PickupPropLightEnvironmentCount;                          // 0x08AC(0x0004)
	unsigned long                                      ControlledByTrackMove : 1;                                // 0x08B0(0x0004)
	unsigned long                                      ControlledByTrackMoveOnServer : 1;                        // 0x08B0(0x0004)
	float                                              TrackMoveStartPosition;                                   // 0x08B4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayer");
		return ptr;
	}


	void OnUpdatePropertyDrawScale();
	void OnUpdatePropertyDrawScale3D();
};


// Class EFGame.EFSummonNpc
// 0x0000 (0x08A4 - 0x08A4)
class AEFSummonNpc : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSummonNpc");
		return ptr;
	}

};


// Class EFGame.EFTransit
// 0x0010 (0x08B4 - 0x08A4)
class AEFTransit : public AEFPawn
{
public:
	int                                                TransitIndex;                                             // 0x08A4(0x0004)
	struct FVector                                     CollisionBoxExtent;                                       // 0x08A8(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTransit");
		return ptr;
	}


	void EncroachingOn();
};


// Class EFGame.EFTrap
// 0x0000 (0x08A4 - 0x08A4)
class AEFTrap : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTrap");
		return ptr;
	}

};


// Class EFGame.EFVehicle
// 0x0000 (0x08A4 - 0x08A4)
class AEFVehicle : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFVehicle");
		return ptr;
	}

};


// Class EFGame.EFPhysicalMaterialProperty
// 0x0001 (0x0059 - 0x0058)
class UEFPhysicalMaterialProperty : public UPhysicalMaterialPropertyBase
{
public:
	TEnumAsByte<EFMATERIAL_FOOTSTEP>                   MaterialFootstep;                                         // 0x0058(0x0001) (RepRetry, ProtectedWrite, ArchetypeProperty, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPhysicalMaterialProperty");
		return ptr;
	}

};


// Class EFGame.EFPlayerController
// 0x0298 (0x0A28 - 0x0790)
class AEFPlayerController : public AGamePlayerController
{
public:
	TArray<struct FEFInputState>                       m_InputStateFlow;                                         // 0x0790(0x0010)
	unsigned long                                      bGamePadInput : 1;                                        // 0x07A0(0x0004)
	unsigned long                                      bInteractionMode : 1;                                     // 0x07A0(0x0004)
	unsigned long                                      bCallFromTargetCastMode : 1;                              // 0x07A0(0x0004)
	unsigned long                                      bHideSwitch : 1;                                          // 0x07A0(0x0004)
	unsigned long                                      bPickMe : 1;                                              // 0x07A0(0x0004)
	unsigned long                                      bForceMoveReservation : 1;                                // 0x07A0(0x0004)
	unsigned long                                      bForceMoveRelease : 1;                                    // 0x07A0(0x0004)
	unsigned long                                      bCruiseMode : 1;                                          // 0x07A0(0x0004)
	unsigned long                                      bCruiseBoostMode : 1;                                     // 0x07A0(0x0004)
	unsigned long                                      bPrevCruiseMode : 1;                                      // 0x07A0(0x0004)
	struct FEFInputCommand                             m_CurInputCommand;                                        // 0x07A4(0x0040)
	TEnumAsByte<EFPlayerControlInputCondition>         m_CurInputCondition;                                      // 0x07E4(0x0001)
	TEnumAsByte<ETargetCastMode>                       TargetCastMode;                                           // 0x07E5(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x07E6(0x0002) MISSED OFFSET
	float                                              fCheckPathTime;                                           // 0x07E8(0x0004)
	float                                              fCheckPickEffectTime;                                     // 0x07EC(0x0004)
	float                                              fUpdateMaxPathTime;                                       // 0x07F0(0x0004)
	class AActor*                                      HitWorldActor;                                            // 0x07F4(0x0008)
	class AActor*                                      HitActor;                                                 // 0x07FC(0x0008)
	struct FVector                                     HitWorldLocation;                                         // 0x0804(0x000C)
	struct FVector                                     HitActorLocation;                                         // 0x0810(0x000C)
	class AEmitter*                                    PickingEffect;                                            // 0x081C(0x0008)
	TArray<class AEFPickingEmitter*>                   PickingEffectArr;                                         // 0x0824(0x0010)
	TArray<class AEFPickingEmitter*>                   PickingEffectUseArr;                                      // 0x0834(0x0010)
	int                                                PickingEffectCount;                                       // 0x0844(0x0004)
	class UEFPlayerInput*                              EFPlayerInput;                                            // 0x0848(0x0008)
	class AActor*                                      SelectedActor;                                            // 0x0850(0x0008)
	class AActor*                                      PreSelectedActor;                                         // 0x0858(0x0008)
	class AActor*                                      OverActor;                                                // 0x0860(0x0008)
	struct FVector                                     OverActorHitLocation;                                     // 0x0868(0x000C)
	float                                              SelectedMaxDistance;                                      // 0x0874(0x0004)
	struct FVector                                     ForceMoveReservationPos;                                  // 0x0878(0x000C)
	struct FQWord                                      DebugOverObjectId;                                        // 0x0884(0x0008)
	struct FEFBasedLocation                            LastMoveToPos;                                            // 0x088C(0x0010)
	struct FVector                                     CruiseModeDirection;                                      // 0x089C(0x000C)
	float                                              fPressedMoveIgnoreRadius;                                 // 0x08A8(0x0004)
	float                                              fPressedMoveIgnoreAngle;                                  // 0x08AC(0x0004)
	struct FPostProcessSettings                        WithOutDominantLightPPSettings;                           // 0x08B0(0x0174)
	float                                              WithOutDominantLightPPAlpha;                              // 0x0A24(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerController");
		return ptr;
	}


	void ConsoleCommand();
	void ProcessCinematic();
	void GetPlayerInitPosition();
	void GetPlayerViewPointQuat();
	void GetPlayerViewPoint();
	void DisplayDebug();
	void DrawHUD();
	void SpawnDefaultHUD();
	void IsStopMovieLoading();
	void PlayerTick();
	void UpdateRotation();
	void StopMovieLoading();
	void Destroyed();
	void PostBeginPlay();
	void InitInputSystem();
};


// Class EFGame.EFPlayerInput
// 0x0030 (0x02E8 - 0x02B8)
class UEFPlayerInput : public UPlayerInput
{
public:
	struct FVector2D                                   CurMouseDeltaPos;                                         // 0x02B8(0x0008)
	struct FVector2D                                   OldMouseDeltaPos;                                         // 0x02C0(0x0008)
	struct FIntPoint                                   CurMousePos;                                              // 0x02C8(0x0008)
	struct FIntPoint                                   OldMousePos;                                              // 0x02D0(0x0008)
	unsigned long                                      bCtrl : 1;                                                // 0x02D8(0x0004)
	unsigned long                                      bShift : 1;                                               // 0x02D8(0x0004)
	unsigned long                                      bAlt : 1;                                                 // 0x02D8(0x0004)
	unsigned long                                      bMouseLButton_Pressed : 1;                                // 0x02D8(0x0004)
	unsigned long                                      bMouseLButton_Released : 1;                               // 0x02D8(0x0004)
	unsigned long                                      bMouseLButton_Repeated : 1;                               // 0x02D8(0x0004)
	unsigned long                                      bMouseRButton_Pressed : 1;                                // 0x02D8(0x0004)
	unsigned long                                      bMouseRButton_Released : 1;                               // 0x02D8(0x0004)
	unsigned long                                      bMouseRButton_Repeated : 1;                               // 0x02D8(0x0004)
	unsigned long                                      bMouseButtonSwap : 1;                                     // 0x02D8(0x0004)
	unsigned long                                      bMoveKey_Pressed : 1;                                     // 0x02D8(0x0004)
	unsigned long                                      bMoveKey_Released : 1;                                    // 0x02D8(0x0004)
	unsigned long                                      bMoveKey_Repeated : 1;                                    // 0x02D8(0x0004)
	unsigned char                                      bRotateButton;                                            // 0x02DC(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02DD(0x0003) MISSED OFFSET
	float                                              MouseDeltaX;                                              // 0x02E0(0x0004)
	float                                              MouseDeltaY;                                              // 0x02E4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerInput");
		return ptr;
	}


	void DefaultPositionControlPanel();
	void FocusControlPanel();
	void ToggleControlPanel();
	void OnMouseScrollDown();
	void OnMouseScrollUp();
	void PlayerInput();
	void InputAxis();
};


// Class EFGame.EFProjectile
// 0x0208 (0x04D8 - 0x02D0)
class AEFProjectile : public AProjectile
{
public:
	struct FQWord                                      CasterId;                                                 // 0x02D0(0x0008)
	int                                                ProjectileId;                                             // 0x02D8(0x0004)
	struct FPointer                                    ProjectileData;                                           // 0x02DC(0x0008)
	struct FPointer                                    ProjectileBankData;                                       // 0x02E4(0x0008)
	float                                              InstigatorModelScaleRate;                                 // 0x02EC(0x0004)
	int                                                TrailEmitterPSGroupIndex;                                 // 0x02F0(0x0004)
	int                                                AttachedPSIIndex;                                         // 0x02F4(0x0004)
	struct FSet_Mirror                                 TouchedActorList;                                         // 0x02F8(0x0048)
	struct FEFBasedLocation                            StartLocation;                                            // 0x0340(0x0010)
	struct FEFBasedLocation                            TargetLocation;                                           // 0x0350(0x0010)
	float                                              Lifetime;                                                 // 0x0360(0x0004)
	float                                              CurTime;                                                  // 0x0364(0x0004)
	float                                              CurSpeed;                                                 // 0x0368(0x0004)
	float                                              MaxDistance;                                              // 0x036C(0x0004)
	float                                              CreateDelay;                                              // 0x0370(0x0004)
	unsigned long                                      PlayerControl : 1;                                        // 0x0374(0x0004)
	unsigned long                                      SendedRemovePacket : 1;                                   // 0x0374(0x0004)
	unsigned long                                      HitSkip : 1;                                              // 0x0374(0x0004)
	unsigned long                                      DestroyCalled : 1;                                        // 0x0374(0x0004)
	unsigned long                                      RemoveCalled : 1;                                         // 0x0374(0x0004)
	unsigned long                                      ArriveMaxDistance : 1;                                    // 0x0374(0x0004)
	unsigned long                                      TimerStopWhenBaseDestroy : 1;                             // 0x0374(0x0004)
	unsigned long                                      CycleHitFalg : 1;                                         // 0x0374(0x0004)
	unsigned long                                      AmITarget : 1;                                            // 0x0374(0x0004)
	TEnumAsByte<EUnpublishReason>                      DestroyReasonforPacket;                                   // 0x0378(0x0001)
	TEnumAsByte<ESkillEffectTarget>                    TargetType;                                               // 0x0379(0x0001)
