#pragma once

// Lost Ark (1.2.0.3) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_EFGame_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class EFGame.EFActionNotify_AnimEvent
// 0x001C (0x0074 - 0x0058)
class UEFActionNotify_AnimEvent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0058(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_CancelParticles
// 0x0000 (0x0074 - 0x0074)
class UEFActionNotify_AnimEvent_CancelParticles : public UEFActionNotify_AnimEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_CancelParticles");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor
// 0x0030 (0x00A4 - 0x0074)
class UEFActionNotify_AnimEvent_MaterialParamterLinearColor : public UEFActionNotify_AnimEvent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0074(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar
// 0x0018 (0x008C - 0x0074)
class UEFActionNotify_AnimEvent_MaterialParamterScalar : public UEFActionNotify_AnimEvent
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0074(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar");
		return ptr;
	}

};


// Class EFGame.EFActorMotionBase
// 0x0000 (0x0058 - 0x0058)
class UEFActorMotionBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionBase");
		return ptr;
	}

};


// Class EFGame.EFActorMotionLocationCycle
// 0x0019 (0x0071 - 0x0058)
class UEFActorMotionLocationCycle : public UEFActorMotionBase
{
public:
	unsigned char                                      UnknownData00[0x19];                                      // 0x0058(0x0019) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionLocationCycle");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationAcyclic
// 0x0005 (0x005D - 0x0058)
class UEFActorMotionRotationAcyclic : public UEFActorMotionBase
{
public:
	unsigned char                                      UnknownData00[0x5];                                       // 0x0058(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationAcyclic");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationCyclic
// 0x0019 (0x0071 - 0x0058)
class UEFActorMotionRotationCyclic : public UEFActorMotionBase
{
public:
	unsigned char                                      UnknownData00[0x19];                                      // 0x0058(0x0019) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationCyclic");
		return ptr;
	}

};


// Class EFGame.EFAfterImageSkeletalMeshComponent
// 0x0000 (0x08E8 - 0x08E8)
class UEFAfterImageSkeletalMeshComponent : public USkeletalMeshComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAfterImageSkeletalMeshComponent");
		return ptr;
	}

};


// Class EFGame.EFAkAudioDevice
// 0x0240 (0x0300 - 0x00C0)
class UEFAkAudioDevice : public UAkAudioDevice
{
public:
	unsigned char                                      UnknownData00[0x240];                                     // 0x00C0(0x0240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAkAudioDevice");
		return ptr;
	}

};


// Class EFGame.EFAN_Params
// 0x001C (0x0074 - 0x0058)
class UEFAN_Params : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0058(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Params");
		return ptr;
	}

};


// Class EFGame.EFAN_Particle
// 0x017C (0x01F0 - 0x0074)
class UEFAN_Particle : public UEFAN_Params
{
public:
	unsigned char                                      UnknownData00[0x17C];                                     // 0x0074(0x017C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Particle");
		return ptr;
	}

};


// Class EFGame.EFAN_Trail
// 0x001C (0x0090 - 0x0074)
class UEFAN_Trail : public UEFAN_Params
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0074(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Trail");
		return ptr;
	}

};


// Class EFGame.EFBarrier
// 0x0008 (0x027C - 0x0274)
class AEFBarrier : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0274(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBarrier");
		return ptr;
	}

};


// Class EFGame.EFCharacterParts
// 0x002C (0x05B4 - 0x0588)
class AEFCharacterParts : public APawn
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0588(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCharacterParts");
		return ptr;
	}


	void OnParticleSystemFinished();
	void STATIC_ClearAttachedPSIIndex();
	void NotifyChangedBase();
	void BaseChange();
	void EncroachingOn();
	void EncroachedBy();
	void Destroyed();
};


// Class EFGame.EFCheatManager
// 0x0000 (0x0098 - 0x0098)
class UEFCheatManager : public UGameCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCheatManager");
		return ptr;
	}


	void InternalDebugLookAt();
	void InternalVisualizePhysicsCompartmentUsage();
	void InternalSetPhysicsCompartmentCount();
	void InternalTogglePhysicsCompartmentForEFPawns();
	void InternalSetCamTargetBlendTime();
	void InternalClearCamTarget();
	void InternalSetCamTarget();
	void InternalCamPrevTarget();
	void InternalCamNextTarget();
	void InternalGetPlayerCamera();
	void InternalToggleCullDistanceVolume();
	void InternalToggleCPUSkinning();
	void InternalToggleOneFrameThreadLag();
	void InternalToggleUpdateDLEOptimize();
	void InternalToggleMeshObjectUpdateOptimize();
	void InternalToggleUpdateBoundsOptimize();
	void InternalToggleDynamicFoliageOptimize();
	void InternalToggleCameraODAOptimize();
	void InternalToggleParticleOptimizeILG();
};


// Class EFGame.EFClient
// 0x0030 (0x0268 - 0x0238)
class UEFClient : public UWindowsClient
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0238(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFClient");
		return ptr;
	}

};


// Class EFGame.EFConsole
// 0x0014 (0x027C - 0x0268)
class UEFConsole : public UConsole
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0268(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFConsole");
		return ptr;
	}


	void IsValidEFCommand();
	void InputAxis();
	void InputKey();
};


// Class EFGame.EFDecalCollisionComponent
// 0x000C (0x0290 - 0x0284)
class UEFDecalCollisionComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0284(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalCollisionComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalComponent
// 0x0010 (0x0420 - 0x0410)
class UEFDecalComponent : public UDecalComponent
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0410(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalFloorActor
// 0x000C (0x0290 - 0x0284)
class AEFDecalFloorActor : public ADecalActor
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0284(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalFloorActor");
		return ptr;
	}


	void STATIC_GetBoundingCylinder();
};


// Class EFGame.EFDecalManager
// 0x0000 (0x02B8 - 0x02B8)
class AEFDecalManager : public ADecalManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalManager");
		return ptr;
	}


	void SpawnDecalMinimal();
};


// Class EFGame.EFFracturedStaticMeshActor
// 0x0004 (0x0314 - 0x0310)
class AEFFracturedStaticMeshActor : public AFracturedStaticMeshActor
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0310(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFFracturedStaticMeshActor");
		return ptr;
	}

};


// Class EFGame.EFGameInfo
// 0x0248 (0x0708 - 0x04C0)
class AEFGameInfo : public AGameInfo
{
public:
	unsigned char                                      UnknownData00[0x248];                                     // 0x04C0(0x0248) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGameInfo");
		return ptr;
	}


	void AllowCheats();
	void PostSeamlessTravel();
	void GameEnding();
	void NotifyMapLoaded();
	void NotfiyLoadingStep();
	void Tick();
	void PostLogin();
	void Login();
	void LoadLevel();
	void STATIC_RestartPlayer();
	void InitGame();
	void STATIC_GenericPlayerInitialization();
};


// Class EFGame.EFMotionSkeletalMeshActor
// 0x002C (0x033C - 0x0310)
class AEFMotionSkeletalMeshActor : public ASkeletalMeshActor
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0310(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFMotionStaticMeshActor
// 0x002C (0x033C - 0x0310)
class AEFMotionStaticMeshActor : public AInterpActor
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0310(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionStaticMeshActor");
		return ptr;
	}

};


// Class EFGame.EFParticleSkeletalMeshActor
// 0x0094 (0x0308 - 0x0274)
class AEFParticleSkeletalMeshActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x94];                                      // 0x0274(0x0094) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFPawn
// 0x031C (0x08A4 - 0x0588)
class AEFPawn : public APawn
{
public:
	unsigned char                                      UnknownData00[0x31C];                                     // 0x0588(0x031C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPawn");
		return ptr;
	}


	void StopAfterImageEffect();
	void StartAfterImageEffect();
	void STATIC_GetAnimTrailParticleSystem();
	void ApplyFluidSurfaceContinuousForce();
	void ApplyFluidSurfaceImpact();
	void NotifyChangedBase();
	void BaseChange();
	void STATIC_MAT_FinishAnimControl();
	void STATIC_MAT_BeginAnimControl();
	void InterpolationFinished();
	void InterpolationStarted();
	void RigidBodyCollision();
	void DoKismetAttachment();
	void STATIC_AttachmentCameraActor();
	void STATIC_GetGravityZ();
	void OnForceFieldDestroy();
	void CreateForceField();
	void STATIC_ExplodeActor();
	void STATIC_FinishDyingDelay();
	void SetDefaultStateColor();
	void SetStateColor();
	void STATIC_AttackFreezeAnim();
	void STATIC_AttackContinueAnim();
	void STATIC_SetPPOutlineWidth();
	void STATIC_SetPPOutlineColor();
	void STATIC_SetPPOutline();
	void SetCloakMode();
	void STATIC_SetOccludedOutlineColor();
	void STATIC_SetOccludedOutline();
	void OutsideWorldBounds();
	void FellOutOfWorld();
	void Landed();
	void Falling();
	void STATIC_SetDesiredRotation();
	void OnParticleSystemFinished();
	void PostInitAll();
	void STATIC_ClearAttachedPSIIndex();
	void Destroyed();
	void STATIC_GetDefaultCameraMode();
	void GetObjectCameraStyle();
	void EncroachingOn();
	void EncroachedBy();
};


// Class EFGame.EFMonster
// 0x0000 (0x08A4 - 0x08A4)
class AEFMonster : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMonster");
		return ptr;
	}

};


// Class EFGame.EFNonPlayer
// 0x0000 (0x08A4 - 0x08A4)
class AEFNonPlayer : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFNonPlayer");
		return ptr;
	}

};


// Class EFGame.EFPet
// 0x0000 (0x08A4 - 0x08A4)
class AEFPet : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPet");
		return ptr;
	}

};


// Class EFGame.EFPlayer
// 0x0014 (0x08B8 - 0x08A4)
class AEFPlayer : public AEFPawn
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x08A4(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayer");
		return ptr;
	}


	void OnUpdatePropertyDrawScale();
	void OnUpdatePropertyDrawScale3D();
};


// Class EFGame.EFSummonNpc
// 0x0000 (0x08A4 - 0x08A4)
class AEFSummonNpc : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSummonNpc");
		return ptr;
	}

};


// Class EFGame.EFTransit
// 0x0010 (0x08B4 - 0x08A4)
class AEFTransit : public AEFPawn
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x08A4(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTransit");
		return ptr;
	}


	void EncroachingOn();
};


// Class EFGame.EFTrap
// 0x0000 (0x08A4 - 0x08A4)
class AEFTrap : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTrap");
		return ptr;
	}

};


// Class EFGame.EFVehicle
// 0x0000 (0x08A4 - 0x08A4)
class AEFVehicle : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFVehicle");
		return ptr;
	}

};


// Class EFGame.EFPhysicalMaterialProperty
// 0x0001 (0x0059 - 0x0058)
class UEFPhysicalMaterialProperty : public UPhysicalMaterialPropertyBase
{
public:
	unsigned char                                      UnknownData00[0x1];                                       // 0x0058(0x0001) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPhysicalMaterialProperty");
		return ptr;
	}

};


// Class EFGame.EFPlayerController
// 0x0298 (0x0A28 - 0x0790)
class AEFPlayerController : public AGamePlayerController
{
public:
	unsigned char                                      UnknownData00[0x298];                                     // 0x0790(0x0298) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerController");
		return ptr;
	}


	void ConsoleCommand();
	void STATIC_ProcessCinematic();
	void GetPlayerInitPosition();
	void GetPlayerViewPointQuat();
	void GetPlayerViewPoint();
	void DisplayDebug();
	void DrawHUD();
	void STATIC_SpawnDefaultHUD();
	void IsStopMovieLoading();
	void PlayerTick();
	void UpdateRotation();
	void StopMovieLoading();
	void Destroyed();
	void PostBeginPlay();
	void InitInputSystem();
};


// Class EFGame.EFPlayerInput
// 0x0030 (0x02E8 - 0x02B8)
class UEFPlayerInput : public UPlayerInput
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x02B8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerInput");
		return ptr;
	}


	void STATIC_DefaultPositionControlPanel();
	void STATIC_FocusControlPanel();
	void STATIC_ToggleControlPanel();
	void OnMouseScrollDown();
	void OnMouseScrollUp();
	void PlayerInput();
	void InputAxis();
};


// Class EFGame.EFProjectile
// 0x0208 (0x04D8 - 0x02D0)
class AEFProjectile : public AProjectile
{
public:
	unsigned char                                      UnknownData00[0x208];                                     // 0x02D0(0x0208) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFProjectile");
		return ptr;
	}


	void STATIC_ClearAttachedPSIIndex();
	void Destroyed();
	void BaseChange();
	void NotifyBaseChange();
	void STATIC_ProcessTouch();
};


// Class EFGame.EFProjectileFixArea
// 0x0048 (0x0520 - 0x04D8)
class AEFProjectileFixArea : public AEFProjectile
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x04D8(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFProjectileFixArea");
		return ptr;
	}

};


// Class EFGame.EFProjectileGrenade
// 0x0008 (0x04E0 - 0x04D8)
class AEFProjectileGrenade : public AEFProjectile
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x04D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFProjectileGrenade");
		return ptr;
	}

};


// Class EFGame.EFProjectileMissile
// 0x0000 (0x04D8 - 0x04D8)
class AEFProjectileMissile : public AEFProjectile
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFProjectileMissile");
		return ptr;
	}

};


// Class EFGame.EFProjectileTrace
// 0x0024 (0x04FC - 0x04D8)
class AEFProjectileTrace : public AEFProjectile
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x04D8(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFProjectileTrace");
		return ptr;
	}

};


// Class EFGame.EFSkeletalMeshActor
// 0x0008 (0x0318 - 0x0310)
class AEFSkeletalMeshActor : public ASkeletalMeshActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0310(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkeletalMeshActor");
		return ptr;
	}


	void STATIC_ClearAttachedPSIIndex();
	void NotifyChangedBase();
	void BaseChange();
	void Destroyed();
};


// Class EFGame.EFSkeletalMeshActorLookInfoMAT
// 0x00A0 (0x03C0 - 0x0320)
class AEFSkeletalMeshActorLookInfoMAT : public ASkeletalMeshActorMAT
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0320(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkeletalMeshActorLookInfoMAT");
		return ptr;
	}

};


// Class EFGame.EFSkeletalMeshActorPCLookInfoMAT
// 0x0015 (0x03D5 - 0x03C0)
class AEFSkeletalMeshActorPCLookInfoMAT : public AEFSkeletalMeshActorLookInfoMAT
{
public:
	unsigned char                                      UnknownData00[0x15];                                      // 0x03C0(0x0015) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkeletalMeshActorPCLookInfoMAT");
		return ptr;
	}

};


// Class EFGame.EFSkeletalMeshComponent
// 0x008C (0x0974 - 0x08E8)
class UEFSkeletalMeshComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x8C];                                      // 0x08E8(0x008C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkeletalMeshComponent");
		return ptr;
	}

};


// Class EFGame.EFMainSkelComponent
// 0x0048 (0x09BC - 0x0974)
class UEFMainSkelComponent : public UEFSkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0974(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMainSkelComponent");
		return ptr;
	}

};


// Class EFGame.EFPartsSkelComponent
// 0x00E4 (0x0A58 - 0x0974)
class UEFPartsSkelComponent : public UEFSkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0xE4];                                      // 0x0974(0x00E4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPartsSkelComponent");
		return ptr;
	}

};


// Class EFGame.EFTexture2DComposite
// 0x0003 (0x0143 - 0x0140)
class UEFTexture2DComposite : public UTexture2DComposite
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x0140(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTexture2DComposite");
		return ptr;
	}

};


// Class EFGame.EFVolume
// 0x0008 (0x02B8 - 0x02B0)
class AEFVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFVolume");
		return ptr;
	}


	void UnTouch();
	void Touch();
};


// Class EFGame.EFVolumeProp
// 0x002D (0x02E5 - 0x02B8)
class AEFVolumeProp : public AEFVolume
{
public:
	unsigned char                                      UnknownData00[0x2D];                                      // 0x02B8(0x002D) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFVolumeProp");
		return ptr;
	}

};


// Class EFGame.EFGameEngine
// 0x00D4 (0x0BA8 - 0x0AD4)
class UEFGameEngine : public UGameEngine
{
public:
	unsigned char                                      UnknownData00[0xD4];                                      // 0x0AD4(0x00D4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGameEngine");
		return ptr;
	}


	void TranslateGFxUIMessage();
	void ShowLineChecks();
};


// Class EFGame.EFMapInfo
// 0x0080 (0x00D8 - 0x0058)
class UEFMapInfo : public UMapInfo
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0058(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMapInfo");
		return ptr;
	}


	void SaveCameraValue();
	void LoadCameraValue();
};


// Class EFGame.EFAnimNodeAim
// 0x0008 (0x01B5 - 0x01AD)
class UEFAnimNodeAim : public UAnimNodeBlendBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01AD(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNodeAim");
		return ptr;
	}

};


// Class EFGame.EFAnimNodeBlendDirectional
// 0x000C (0x01D8 - 0x01CC)
class UEFAnimNodeBlendDirectional : public UAnimNodeBlendDirectional
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01CC(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNodeBlendDirectional");
		return ptr;
	}

};


// Class EFGame.EFAnimNodeBlendPerBone
// 0x000C (0x0200 - 0x01F4)
class UEFAnimNodeBlendPerBone : public UAnimNodeBlendPerBone
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x01F4(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNodeBlendPerBone");
		return ptr;
	}

};


// Class EFGame.EFAnimNodeLookAt
// 0x0010 (0x0218 - 0x0208)
class UEFAnimNodeLookAt : public UAnimNodeAimOffset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0208(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNodeLookAt");
		return ptr;
	}

};


// Class EFGame.EFAnimNotify_AkEvent
// 0x0014 (0x0074 - 0x0060)
class UEFAnimNotify_AkEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x0060(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNotify_AkEvent");
		return ptr;
	}

};


// Class EFGame.EFAnimNotify_AkEventSwitchFloorMaterial
// 0x0018 (0x0078 - 0x0060)
class UEFAnimNotify_AkEventSwitchFloorMaterial : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNotify_AkEventSwitchFloorMaterial");
		return ptr;
	}

};


// Class EFGame.EFAnimNotify_DropItemEvent
// 0x0009 (0x0069 - 0x0060)
class UEFAnimNotify_DropItemEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x9];                                       // 0x0060(0x0009) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNotify_DropItemEvent");
		return ptr;
	}

};


// Class EFGame.EFAnimNotify_Trails
// 0x0000 (0x00D8 - 0x00D8)
class UEFAnimNotify_Trails : public UAnimNotify_Trails
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNotify_Trails");
		return ptr;
	}

};


// Class EFGame.EFAnimNotify_ViewShake
// 0x0000 (0x00B4 - 0x00B4)
class UEFAnimNotify_ViewShake : public UAnimNotify_ViewShake
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAnimNotify_ViewShake");
		return ptr;
	}

};


// Class EFGame.EFSkelControl_Spring
// 0x0030 (0x011C - 0x00EC)
class UEFSkelControl_Spring : public USkelControlBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x00EC(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkelControl_Spring");
		return ptr;
	}

};


// Class EFGame.EFSkelControlSingleBoneOnlyScale
// 0x0004 (0x00F0 - 0x00EC)
class UEFSkelControlSingleBoneOnlyScale : public USkelControlBase
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSkelControlSingleBoneOnlyScale");
		return ptr;
	}

};


// Class EFGame.EFTable
// 0x004C (0x00A4 - 0x0058)
class UEFTable : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4C];                                      // 0x0058(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTable");
		return ptr;
	}

};


// Class EFGame.EFCameraBase
// 0x0050 (0x00A8 - 0x0058)
class UEFCameraBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0058(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCameraBase");
		return ptr;
	}


	void GetCurrentFOV();
	void GetDefaultFOV();
	void SetDefaultFOV();
	void DisplayDebug();
	void UpdateRotation();
	void SetCurrentCameraCut();
	void SetContentsSettingTable();
	void SetSettingTable();
	void InActivateSkeletalMeshForceLOD();
	void STATIC_ActivateSkeletalMeshForceLOD();
	void STATIC_ChangeZoomStep();
	void STATIC_CheckZoom();
	void ZoomOut();
	void ZoomIn();
	void BecomeViewTarget();
	void UpdateCamera();
	void STATIC_ResetInterpolation();
	void OnBecomeInActive();
	void OnBecomeActive();
	void Init();
};


// Class EFGame.EFBackViewCamera
// 0x0010 (0x00B8 - 0x00A8)
class UEFBackViewCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x00A8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBackViewCamera");
		return ptr;
	}


	void UpdateCamera();
};


// Class EFGame.EFCustomizingCamera
// 0x001C (0x00C4 - 0x00A8)
class UEFCustomizingCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x00A8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCustomizingCamera");
		return ptr;
	}


	void UpdateCamera();
	void ZoomOut();
	void ZoomIn();
	void Init();
};


// Class EFGame.EFEditorViewCamera
// 0x0044 (0x00EC - 0x00A8)
class UEFEditorViewCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x00A8(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEditorViewCamera");
		return ptr;
	}


	void OnBecomeInActive();
	void OnBecomeActive();
	void ZoomOut();
	void ZoomIn();
	void UpdateCamera();
};


// Class EFGame.EFFreeCamera
// 0x004C (0x00F4 - 0x00A8)
class UEFFreeCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x4C];                                      // 0x00A8(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFFreeCamera");
		return ptr;
	}


	void OnBecomeInActive();
	void OnBecomeActive();
	void HideOwnerPlayer();
	void ShowOwnerPlayer();
	void ZoomOut();
	void ZoomIn();
	void UpdateCamera();
};


// Class EFGame.EFInteractionCamera
// 0x0000 (0x00A8 - 0x00A8)
class UEFInteractionCamera : public UEFCameraBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFInteractionCamera");
		return ptr;
	}


	void UpdateCamera();
	void GetCurrentFOV();
};


// Class EFGame.EFIsometricCamera
// 0x00A4 (0x014C - 0x00A8)
class UEFIsometricCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0xA4];                                      // 0x00A8(0x00A4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFIsometricCamera");
		return ptr;
	}


	void SetOverrideIsometricZoomStep();
	void SetFixedCameraInterpSpeed();
	void IsFixedCameraMode();
	void ResetFixedCamera();
	void SetFixedLookAtPos();
	void SetCurIsometricZoomStep();
	void UpdateCamera();
	void OnBecomeActive();
	void SetContentsSettingTable();
	void SetSettingTable();
	void RefineFOV();
	void InActivateSkeletalMeshForceLOD();
	void STATIC_ActivateSkeletalMeshForceLOD();
	void STATIC_ChangeZoomStep();
	void STATIC_CheckZoom();
	void ZoomOut();
	void ZoomIn();
	void STATIC_ResetInterpolation();
};


// Class EFGame.EFMacroCamera
// 0x0080 (0x0128 - 0x00A8)
class UEFMacroCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x00A8(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMacroCamera");
		return ptr;
	}


	void UpdateRotation();
	void ZoomOut();
	void ZoomIn();
	void UpdateCamera();
};


// Class EFGame.EFPanningCamera
// 0x005C (0x0104 - 0x00A8)
class UEFPanningCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x5C];                                      // 0x00A8(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPanningCamera");
		return ptr;
	}


	void OnBecomeInActive();
	void OnBecomeActive();
	void STATIC_EndPanningCamera();
	void StartPanningCamera();
	void ZoomOut();
	void ZoomIn();
	void UpdateCamera();
};


// Class EFGame.EFThirdPersonCamera
// 0x0008 (0x00B0 - 0x00A8)
class UEFThirdPersonCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFThirdPersonCamera");
		return ptr;
	}


	void UpdateRotation();
	void ZoomOut();
	void ZoomIn();
	void UpdateCamera();
	void GetCurrentFOV();
};


// Class EFGame.EFTopViewCamera
// 0x0024 (0x00CC - 0x00A8)
class UEFTopViewCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x00A8(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTopViewCamera");
		return ptr;
	}


	void UpdateCamera();
	void OnBecomeInActive();
	void OnBecomeActive();
	void ProcessInActivateCameraType();
	void ProcessActivateCameraType();
	void SetContentsSettingTable();
	void SetSettingTable();
	void InActivateSkeletalMeshForceLOD();
	void STATIC_ActivateSkeletalMeshForceLOD();
	void STATIC_ChangeZoomStep();
	void STATIC_CheckZoom();
	void ZoomOut();
	void ZoomIn();
	void STATIC_ResetInterpolation();
};


// Class EFGame.EFTPSCamera
// 0x0080 (0x0128 - 0x00A8)
class UEFTPSCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x00A8(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTPSCamera");
		return ptr;
	}


	void SetFixedCameraInterpSpeed();
	void IsFixedCameraMode();
	void ResetFixedCamera();
	void SetFixedLookAtPos();
	void UpdateCamera();
	void OnBecomeActive();
	void SetContentsSettingTable();
	void SetSettingTable();
	void InActivateSkeletalMeshForceLOD();
	void STATIC_ActivateSkeletalMeshForceLOD();
	void STATIC_ChangeZoomStep();
	void STATIC_CheckZoom();
	void ZoomOut();
	void ZoomIn();
	void STATIC_ResetInterpolation();
};


// Class EFGame.EFWatchCamera
// 0x0030 (0x00D8 - 0x00A8)
class UEFWatchCamera : public UEFCameraBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x00A8(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFWatchCamera");
		return ptr;
	}


	void SetFixedLookAtPos();
	void SetWatchCameraType();
	void UpdateCamera();
	void OnBecomeActive();
	void ZoomOut();
	void ZoomIn();
};


// Class EFGame.EFCameraModifier_CameraShake
// 0x000C (0x0098 - 0x008C)
class UEFCameraModifier_CameraShake : public UCameraModifier_CameraShake
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x008C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCameraModifier_CameraShake");
		return ptr;
	}


	void STATIC_AddCameraShakeGame();
	void RemoveGameCameraShake();
	void OnRemoveGameCameraShake();
	void OnAddGameCameraShake();
	void STATIC_ModifyCamera();
	void RemoveAllEFViewShakes();
	void RemoveEFViewShake();
	void STATIC_AddEFCameraViewShake();
	void STATIC_RemoveAllCameraShakes();
};


// Class EFGame.EFCameraShakePlayGroup
// 0x0018 (0x0070 - 0x0058)
class UEFCameraShakePlayGroup : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0058(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCameraShakePlayGroup");
		return ptr;
	}


	void STATIC_UpdateViewShake();
	void PreUpdateViewShake();
	void RemoveAllViewShake();
	void RemoveViewShake();
	void STATIC_AddViewShakeInstance();
	void STATIC_AddViewShake();
};


// Class EFGame.EFCameraViewShake
// 0x006C (0x00C4 - 0x0058)
class UEFCameraViewShake : public UObject
{
public:
	unsigned char                                      UnknownData00[0x6C];                                      // 0x0058(0x006C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCameraViewShake");
		return ptr;
	}


	void GetAmplitudeSize();
};


// Class EFGame.EFCameraViewShakeAnim
// 0x0020 (0x0078 - 0x0058)
class UEFCameraViewShakeAnim : public UObject
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0058(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCameraViewShakeAnim");
		return ptr;
	}

};


// Class EFGame.EFInputRotCameraActor
// 0x003C (0x048C - 0x0450)
class AEFInputRotCameraActor : public ACameraActor
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0450(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFInputRotCameraActor");
		return ptr;
	}


	void STATIC_GetCameraView();
	void EndViewTarget();
	void BecomeViewTarget();
	void STATIC_ActivateInputRotMode();
};


// Class EFGame.EFInterpGroupMacroCamera
// 0x0000 (0x00A0 - 0x00A0)
class UEFInterpGroupMacroCamera : public UInterpGroupDirector
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFInterpGroupMacroCamera");
		return ptr;
	}

};


// Class EFGame.EFInterpTrackMacroCamera
// 0x0018 (0x00D0 - 0x00B8)
class UEFInterpTrackMacroCamera : public UInterpTrack
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x00B8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFInterpTrackMacroCamera");
		return ptr;
	}

};


// Class EFGame.EFMacroCameraActor
// 0x001C (0x046C - 0x0450)
class AEFMacroCameraActor : public ACameraActor
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0450(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMacroCameraActor");
		return ptr;
	}

};


// Class EFGame.EFMacroCameraSplineActor
// 0x008C (0x04F8 - 0x046C)
class AEFMacroCameraSplineActor : public AEFMacroCameraActor
{
public:
	unsigned char                                      UnknownData00[0x8C];                                      // 0x046C(0x008C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMacroCameraSplineActor");
		return ptr;
	}


	void BreakAllConnections();
	void BreakConnectionTo();
	void STATIC_IsConnectedTo();
	void AddConnectionTo();
	void UpdateConnectedSplineComponents();
	void UpdateSplineComponents();
};


// Class EFGame.EFMacroCameraComponent
// 0x0000 (0x0284 - 0x0284)
class UEFMacroCameraComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMacroCameraComponent");
		return ptr;
	}

};


// Class EFGame.EFPlayerCamera
// 0x0170 (0x0744 - 0x05D4)
class AEFPlayerCamera : public ACamera
{
public:
	unsigned char                                      UnknownData00[0x170];                                     // 0x05D4(0x0170) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerCamera");
		return ptr;
	}


	void LoadOutlineData();
	void STATIC_UpdateTranslucentActorBlend();
	void STATIC_UpdateOccludedActorBlend();
	void DisplayDebug();
	void FOV();
	void AdjustViewportFOV();
	void SaveCameraValue();
	void SetCameraType();
	void UpdateRotation();
	void ZoomOut();
	void ZoomIn();
	void UpdateViewTarget();
	void DoUpdateCamera();
	void ProcessTestInputCameraActor();
	void RestoreCameraMode();
	void STATIC_ChangeCameraMode();
	void STATIC_ChangeCameraContentsSetting();
	void STATIC_ChangeCameraZoomStep();
	void STATIC_ChangeCameraSetting();
	void STATIC_ApplyVehicleFOVAngle();
	void SetVehicleFOVAngle();
	void STATIC_ApplyCamOverrideFogSetting();
	void ProcessTargetCameraActorBlend();
	void ResetAttachCameraActor();
	void STATIC_FindBestCameraType();
	void GetCurrentCameraMode();
	void STATIC_CreateCamera();
	void PostBeginPlay();
	void GetFOV();
	void GetCameraDistance();
	void Destroyed();
	void STATIC_CalcVerticalFOV();
};


// Class EFGame.EFSimpleCameraShake
// 0x0000 (0x00D8 - 0x00D8)
class UEFSimpleCameraShake : public UCameraShake
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSimpleCameraShake");
		return ptr;
	}

};


// Class EFGame.EFActionParticleData
// 0x0024 (0x007C - 0x0058)
class UEFActionParticleData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x0058(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionParticleData");
		return ptr;
	}

};


// Class EFGame.EFBeamActionBase
// 0x0000 (0x0058 - 0x0058)
class UEFBeamActionBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBeamActionBase");
		return ptr;
	}

};


// Class EFGame.EFBeamActionDirection
// 0x02CC (0x0324 - 0x0058)
class UEFBeamActionDirection : public UEFBeamActionBase
{
public:
	unsigned char                                      UnknownData00[0x2CC];                                     // 0x0058(0x02CC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBeamActionDirection");
		return ptr;
	}

};


// Class EFGame.EFBeamActionSelf
// 0x003C (0x0094 - 0x0058)
class UEFBeamActionSelf : public UEFBeamActionBase
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0058(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBeamActionSelf");
		return ptr;
	}

};


// Class EFGame.EFBeamActionTargetPos
// 0x02C4 (0x031C - 0x0058)
class UEFBeamActionTargetPos : public UEFBeamActionBase
{
public:
	unsigned char                                      UnknownData00[0x2C4];                                     // 0x0058(0x02C4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBeamActionTargetPos");
		return ptr;
	}

};


// Class EFGame.EFDistributionFloatMultiplyParticleParameter
// 0x0003 (0x0094 - 0x0091)
class UEFDistributionFloatMultiplyParticleParameter : public UDistributionFloatParameterBase
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x0091(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDistributionFloatMultiplyParticleParameter");
		return ptr;
	}

};


// Class EFGame.EFDistributionVectorMultiplyParticleParameter
// 0x0001 (0x00C4 - 0x00C3)
class UEFDistributionVectorMultiplyParticleParameter : public UDistributionVectorParameterBase
{
public:
	unsigned char                                      UnknownData00[0x1];                                       // 0x00C3(0x0001) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDistributionVectorMultiplyParticleParameter");
		return ptr;
	}

};


// Class EFGame.EFEffectSpawn
// 0x0010 (0x0068 - 0x0058)
class UEFEffectSpawn : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0058(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEffectSpawn");
		return ptr;
	}

};


// Class EFGame.EFEmitter
// 0x0010 (0x02B8 - 0x02A8)
class AEFEmitter : public AEmitter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x02A8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEmitter");
		return ptr;
	}


	void STATIC_HideSelf();
	void PostBeginPlay();
};


// Class EFGame.EFEnvironmentActionEmitter
// 0x0010 (0x02C8 - 0x02B8)
class AEFEnvironmentActionEmitter : public AEFEmitter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x02B8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEnvironmentActionEmitter");
		return ptr;
	}


	void STATIC_ClearExtendPool();
	void OnParticleSystemFinished();
};


// Class EFGame.EFSpawnedEmitter
// 0x0000 (0x02B8 - 0x02B8)
class AEFSpawnedEmitter : public AEFEmitter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSpawnedEmitter");
		return ptr;
	}


	void HideBecauseFinished();
	void STATIC_ClearExtendPool();
	void OnParticleSystemFinished();
};


// Class EFGame.EFEmitterPool
// 0x00B8 (0x039C - 0x02E4)
class AEFEmitterPool : public AEmitterPool
{
public:
	unsigned char                                      UnknownData00[0xB8];                                      // 0x02E4(0x00B8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEmitterPool");
		return ptr;
	}


	void STATIC_ClearPoolPSInfoComponents();
	void OnPSInfoFinished();
	void STATIC_ClearExtendPool();
};


// Class EFGame.EFEnvironmentEmitter
// 0x000C (0x02B4 - 0x02A8)
class AEFEnvironmentEmitter : public AEmitter
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x02A8(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFEnvironmentEmitter");
		return ptr;
	}

};


// Class EFGame.EFGroundEffect
// 0x0030 (0x0088 - 0x0058)
class UEFGroundEffect : public UObject
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0058(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGroundEffect");
		return ptr;
	}

};


// Class EFGame.EFGroundEffectContainer
// 0x0058 (0x00B0 - 0x0058)
class UEFGroundEffectContainer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0058(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGroundEffectContainer");
		return ptr;
	}

};


// Class EFGame.EFLoopingEmitter
// 0x0004 (0x02AC - 0x02A8)
class AEFLoopingEmitter : public AEmitter
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x02A8(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFLoopingEmitter");
		return ptr;
	}

};


// Class EFGame.EFMarkEffect
// 0x0010 (0x0284 - 0x0274)
class AEFMarkEffect : public AActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0274(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMarkEffect");
		return ptr;
	}

};


// Class EFGame.EFParticleDataBase
// 0x0020 (0x0078 - 0x0058)
class UEFParticleDataBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0058(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataBase");
		return ptr;
	}

};


// Class EFGame.EFParticleData
// 0x00A0 (0x0118 - 0x0078)
class UEFParticleData : public UEFParticleDataBase
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0078(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleData");
		return ptr;
	}

};


// Class EFGame.EFParticleDataIdentity
// 0x0058 (0x00D0 - 0x0078)
class UEFParticleDataIdentity : public UEFParticleDataBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0078(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataIdentity");
		return ptr;
	}

};


// Class EFGame.EFParticleDataSimple
// 0x0018 (0x0090 - 0x0078)
class UEFParticleDataSimple : public UEFParticleDataBase
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0078(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataSimple");
		return ptr;
	}

};


// Class EFGame.EFParticleDataModifier
// 0x002C (0x0084 - 0x0058)
class UEFParticleDataModifier : public UObject
{
public:
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0058(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataModifier");
		return ptr;
	}

};


// Class EFGame.EFParticleDataModulePawnMaterialParam
// 0x004C (0x00A4 - 0x0058)
class UEFParticleDataModulePawnMaterialParam : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4C];                                      // 0x0058(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataModulePawnMaterialParam");
		return ptr;
	}

};


// Class EFGame.EFParticleDataModuleSoundBase
// 0x001C (0x0074 - 0x0058)
class UEFParticleDataModuleSoundBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0058(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataModuleSoundBase");
		return ptr;
	}

};


// Class EFGame.EFParticleDataModuleSingleAKEvent
// 0x000C (0x0080 - 0x0074)
class UEFParticleDataModuleSingleAKEvent : public UEFParticleDataModuleSoundBase
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0074(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleDataModuleSingleAKEvent");
		return ptr;
	}

};


// Class EFGame.EFParticleGroundData
// 0x0058 (0x00B0 - 0x0058)
class UEFParticleGroundData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0058(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleGroundData");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleAkEventBase
// 0x0000 (0x0064 - 0x0064)
class UEFParticleModuleAkEventBase : public UParticleModule
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleAkEventBase");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleAkEvent
// 0x0010 (0x0074 - 0x0064)
class UEFParticleModuleAkEvent : public UEFParticleModuleAkEventBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0064(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleAkEvent");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleKillLength
// 0x0028 (0x008C - 0x0064)
class UEFParticleModuleKillLength : public UParticleModuleKillBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0064(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleKillLength");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationCircleSurface
// 0x0078 (0x00DC - 0x0064)
class UEFParticleModuleLocationCircleSurface : public UParticleModuleLocationBase
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0064(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationCircleSurface");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationEmitter
// 0x0000 (0x007C - 0x007C)
class UEFParticleModuleLocationEmitter : public UParticleModuleLocationEmitter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationEmitter");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationEmitterDirect
// 0x000C (0x0078 - 0x006C)
class UEFParticleModuleLocationEmitterDirect : public UParticleModuleLocationEmitterDirect
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x006C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationEmitterDirect");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationOnGround
// 0x0058 (0x00BC - 0x0064)
class UEFParticleModuleLocationOnGround : public UParticleModuleLocationBase
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0064(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationOnGround");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationPath
// 0x0020 (0x0084 - 0x0064)
class UEFParticleModuleLocationPath : public UParticleModuleLocationBase
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0064(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationPath");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationPrimitiveCylinderSpin
// 0x0098 (0x0148 - 0x00B0)
class UEFParticleModuleLocationPrimitiveCylinderSpin : public UParticleModuleLocationPrimitiveBase
{
public:
	unsigned char                                      UnknownData00[0x98];                                      // 0x00B0(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationPrimitiveCylinderSpin");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationPrimitiveCylinderSpin_Seeded
// 0x001C (0x0164 - 0x0148)
class UEFParticleModuleLocationPrimitiveCylinderSpin_Seeded : public UEFParticleModuleLocationPrimitiveCylinderSpin
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0148(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationPrimitiveCylinderSpin_Seeded");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationPrimitiveMesh
// 0x0008 (0x00B8 - 0x00B0)
class UEFParticleModuleLocationPrimitiveMesh : public UParticleModuleLocationPrimitiveBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00B0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationPrimitiveMesh");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationPrimitiveSphere
// 0x0024 (0x00D4 - 0x00B0)
class UEFParticleModuleLocationPrimitiveSphere : public UParticleModuleLocationPrimitiveBase
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x00B0(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationPrimitiveSphere");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationSkelVertSurface
// 0x0028 (0x00E4 - 0x00BC)
class UEFParticleModuleLocationSkelVertSurface : public UParticleModuleLocationSkelVertSurface
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x00BC(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationSkelVertSurface");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleLocationStaticVertSurface
// 0x0028 (0x00D4 - 0x00AC)
class UEFParticleModuleLocationStaticVertSurface : public UParticleModuleLocationStaticVertSurface
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x00AC(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleLocationStaticVertSurface");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleTypeDataDecal
// 0x0028 (0x008C - 0x0064)
class UEFParticleModuleTypeDataDecal : public UParticleModuleTypeDataBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0064(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleModuleTypeDataDecal");
		return ptr;
	}

};


// Class EFGame.EFParticleModuleTypeDataLight
