#pragma once

// Lost Ark (1.12.11.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_GameFramework_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GameFramework.DynamicSpriteComponent
// 0x004C (0x02F8 - 0x02AC)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                            // 0x02AC(0x0014) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FInterpCurveLinearColor                     AnimatedColor;                                            // 0x02C0(0x0014) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FInterpCurveVector2D                        AnimatedPosition;                                         // 0x02D4(0x0014) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FVector                                     LocationOffset;                                           // 0x02E8(0x000C) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	int                                                LoopCount;                                                // 0x02F4(0x0004) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		return ptr;
	}

};


// Class GameFramework.FrameworkGame
// 0x0010 (0x04D0 - 0x04C0)
class AFrameworkGame : public AGameInfo
{
public:
	TArray<struct FRequiredMobileInputConfig>          RequiredMobileInputConfigs;                               // 0x04C0(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.FrameworkGame");
		return ptr;
	}

};


// Class GameFramework.GameAIController
// 0x004C (0x04D0 - 0x0484)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                              // 0x0484(0x0008) (RepNotify, Interp, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bHasRunawayCommandList : 1;                               // 0x048C(0x0004)
	unsigned long                                      bAILogging : 1;                                           // 0x048C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bAILogToWindow : 1;                                       // 0x048C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x048C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bMapBasedLogName : 1;                                     // 0x048C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bAIDrawDebug : 1;                                         // 0x048C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bAIBroken : 1;                                            // 0x048C(0x0004)
	class AFileLog*                                    AILogFile;                                                // 0x0490(0x0008)
	float                                              DebugTextMaxLen;                                          // 0x0498(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	TArray<struct FAICmdHistoryItem>                   CommandHistory;                                           // 0x049C(0x0010) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	int                                                CommandHistoryNum;                                        // 0x04AC(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	TArray<struct FName>                               AILogFilter;                                              // 0x04B0(0x0010) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	struct FString                                     DemoActionString;                                         // 0x04C0(0x0010) (EditConst, GlobalConfig, AlwaysInit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAIController");
		return ptr;
	}


	void GetActionString();
	void SetDesiredRotation();
	void AILog_Internal();
	void RecordDemoAILog();
	void Destroyed();
	void ReachedIntermediateMoveGoal();
	void ReachedMoveGoal();
	void GetDestinationOffset();
	void GetAICommandInStack();
	void FindCommandOfClass();
	void DumpCommandStack();
	void CheckCommandCount();
	void GetActiveCommand();
	void AbortCommand();
	void PopCommand();
	void PushCommand();
	void AllCommands();
};


// Class GameFramework.GameAICommand
// 0x0024 (0x007C - 0x0058)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                             // 0x0058(0x0008) (RepNotify, NonTransactional, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FName                                       ChildStatus;                                              // 0x0060(0x0008) (RepNotify, NonTransactional, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AGameAIController*                           GameAIOwner;                                              // 0x0068(0x0008) (RepNotify, NonTransactional, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	struct FName                                       Status;                                                   // 0x0070(0x0008) (RepNotify, NonTransactional, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bAllowNewSameClassInstance : 1;                           // 0x0078(0x0004)
	unsigned long                                      bReplaceActiveSameClassInstance : 1;                      // 0x0078(0x0004)
	unsigned long                                      bAborted : 1;                                             // 0x0078(0x0004)
	unsigned long                                      bIgnoreNotifies : 1;                                      // 0x0078(0x0004)
	unsigned long                                      bIgnoreStepAside : 1;                                     // 0x0078(0x0004)
	unsigned long                                      bPendingPop : 1;                                          // 0x0078(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICommand");
		return ptr;
	}


	void HandlePathObstruction();
	void MoveUnreachable();
	void NotifyNeedRepath();
	void GetDebugVerboseText();
	void GetDebugOverheadText();
	void DrawDebug();
	void GetDumpString();
	void Resumed();
	void Paused();
	void Popped();
	void Pushed();
	void PostPopped();
	void PrePushed();
	void AllowStateTransitionTo();
	void AllowTransitionTo();
	void Tick();
	void ShouldIgnoreNotifies();
	void InternalTick();
	void InternalResumed();
	void InternalPaused();
	void InternalPopped();
	void InternalPushed();
	void InternalPrePushed();
	void STATIC_InitCommand();
	void STATIC_InitCommandUserActor();
};


// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x02B4 - 0x02B4)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		return ptr;
	}

};


// Class GameFramework.GamePlayerController
// 0x0010 (0x0790 - 0x0780)
class AGamePlayerController : public APlayerController
{
public:
	unsigned long                                      bWarnCrowdMembers : 1;                                    // 0x0780(0x0004)
	unsigned long                                      bDebugCrowdAwareness : 1;                                 // 0x0780(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bIsWarmupPaused : 1;                                      // 0x0780(0x0004)
	float                                              AgentAwareRadius;                                         // 0x0784(0x0004)
	struct FName                                       CurrentSoundMode;                                         // 0x0788(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePlayerController");
		return ptr;
	}


	void ClientColorFade();
	void WarmupPause();
	void CanUnpauseWarmup();
	void GetCurrentMovie();
	void ClientStopMovie();
	void ClientPlayMovie();
	void STATIC_KeepPlayingLoadingMovie();
	void STATIC_ShowLoadingMovie();
	void SetSoundMode();
	void DoForceFeedbackForScreenShake();
	void NotifyCrowdAgentInRadius();
	void NotifyCrowdAgentRefresh();
	void CrowdDebug();
	void GetUIPlayerIndex();
	void OnToggleMouseCursor();
};


// Class GameFramework.GameCheatManager
// 0x0020 (0x0098 - 0x0078)
class UGameCheatManager : public UCheatManager
{
public:
	class ADebugCameraController*                      DebugCameraControllerRef;                                 // 0x0078(0x0008)
	class UClass*                                      DebugCameraControllerClass;                               // 0x0080(0x0008)
	struct FString                                     DebugCameraControllerClassName;                           // 0x0088(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCheatManager");
		return ptr;
	}


	void EnableDebugCamera();
	void TeleportPawnToCamera();
	void ToggleDebugCamera();
	void PatchDebugCameraController();
};


// Class GameFramework.GameCrowdAgent
// 0x0278 (0x04F4 - 0x027C)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	struct FPointer                                    VfTable_IInterface_RVO;                                   // 0x027C(0x0008)
	class UGameCrowdGroup*                             MyGroup;                                                  // 0x0284(0x0008)
	struct FVector                                     PreferredVelocity;                                        // 0x028C(0x000C)
	struct FVector                                     PendingVelocity;                                          // 0x0298(0x000C)
	class AGameCrowdDestination*                       CurrentDestination;                                       // 0x02A4(0x0008)
	class AGameCrowdDestination*                       BehaviorDestination;                                      // 0x02AC(0x0008)
	class AGameCrowdDestination*                       PreviousDestination;                                      // 0x02B4(0x0008)
	float                                              InterpZTranslation;                                       // 0x02BC(0x0004)
	int                                                Health;                                                   // 0x02C0(0x0004) (RepNotify, NonTransactional, EditorOnly, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              DeadBodyDuration;                                         // 0x02C4(0x0004) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x02C8(0x0008)
	int                                                ConformTraceFrameCount;                                   // 0x02D0(0x0004)
	TArray<struct FNearbyDynamicItem>                  NearbyDynamics;                                           // 0x02D4(0x0010)
	unsigned long                                      bUniformScale : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bCheckForObstacles : 1;                                   // 0x02E4(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	unsigned long                                      bUseNavMeshPathing : 1;                                   // 0x02E4(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	unsigned long                                      bWantsSeePlayerNotification : 1;                          // 0x02E4(0x0004)
	unsigned long                                      bAllowPitching : 1;                                       // 0x02E4(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bHitObstacle : 1;                                         // 0x02E4(0x0004)
	unsigned long                                      bBadHitNormal : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bSimulateThisTick : 1;                                    // 0x02E4(0x0004)
	unsigned long                                      bPotentialEncounter : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsPanicked : 1;                                          // 0x02E4(0x0004)
	unsigned long                                      bWantsGroupIdle : 1;                                      // 0x02E4(0x0004)
	unsigned long                                      bPreferVisibleDestination : 1;                            // 0x02E4(0x0004) (RepNotify, NonTransactional, EditorOnly, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bPreferVisibleDestinationOnSpawn : 1;                     // 0x02E4(0x0004) (RepNotify, NonTransactional, EditorOnly, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bHasNotifiedSpawner : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsInSpawnPool : 1;                                       // 0x02E4(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x02E4(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	TEnumAsByte<EConformType>                          ConformType;                                              // 0x02E8(0x0001) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02E9(0x0003) MISSED OFFSET
	float                                              ConformTraceDist;                                         // 0x02EC(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	int                                                ConformTraceInterval;                                     // 0x02F0(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	int                                                CurrentConformTraceInterval;                              // 0x02F4(0x0004)
	float                                              LastGroundZ;                                              // 0x02F8(0x0004)
	float                                              AwareRadius;                                              // 0x02FC(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              AvoidOtherRadius;                                         // 0x0300(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	TArray<struct FAvoidOtherSampleItem>               AvoidOtherSampleList;                                     // 0x0304(0x0010) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              PENALTY_COEFF_ANGLETOGOAL;                                // 0x0314(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              PENALTY_COEFF_ANGLETOVEL;                                 // 0x0318(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              PENALTY_COEFF_MAG;                                        // 0x031C(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              MIN_PENALTY_THRESHOLD;                                    // 0x0320(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              LastProgressTime;                                         // 0x0324(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              LastFallbackActiveTime;                                   // 0x0328(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              MaxPathLaneValue;                                         // 0x032C(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              CurrentPathLaneValue;                                     // 0x0330(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	int                                                ExtraPathCost;                                            // 0x0334(0x0004) (RepNotify, EditorOnly, NotForConsole, PrivateWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              RotateToTargetSpeed;                                      // 0x0338(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	float                                              MaxYawRate;                                               // 0x033C(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	struct FVector                                     MeshMinScale3D;                                           // 0x0340(0x000C) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	struct FVector                                     MeshMaxScale3D;                                           // 0x034C(0x000C) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	float                                              EyeZOffset;                                               // 0x0358(0x0004)
	float                                              ProximityLODDist;                                         // 0x035C(0x0004) (Interp, EditorOnly, ArchetypeProperty, EditHide, CrossLevelActive)
	float                                              VisibleProximityLODDist;                                  // 0x0360(0x0004) (Interp, EditorOnly, ArchetypeProperty, EditHide, CrossLevelActive)
	struct FVector                                     LastKnownGoodPosition;                                    // 0x0364(0x000C)
	float                                              GroundOffset;                                             // 0x0370(0x0004) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	struct FVector                                     IntermediatePoint;                                        // 0x0374(0x000C)
	struct FVector                                     SearchExtent;                                             // 0x0380(0x000C)
	class UClass*                                      NavigationHandleClass;                                    // 0x038C(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0394(0x0008)
	int                                                ObstacleCheckCount;                                       // 0x039C(0x0004)
	float                                              WalkableFloorZ;                                           // 0x03A0(0x0004)
	float                                              LastPathingAttempt;                                       // 0x03A4(0x0004)
	float                                              LastUpdateTime;                                           // 0x03A8(0x0004)
	float                                              NotVisibleLifeSpan;                                       // 0x03AC(0x0004) (Interp, EditorOnly, ArchetypeProperty, EditHide, CrossLevelActive)
	class AGameCrowdAgent*                             MyArchetype;                                              // 0x03B0(0x0008)
	float                                              MaxWalkingSpeed;                                          // 0x03B8(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	float                                              MaxRunningSpeed;                                          // 0x03BC(0x0004) (RepNotify, NonTransactional, EditorOnly, EditHide, EditTextBox, CrossLevelActive)
	float                                              MaxSpeed;                                                 // 0x03C0(0x0004)
	TArray<struct FRecentInteraction>                  RecentInteractions;                                       // 0x03C4(0x0010)
	float                                              BeaconMaxDist;                                            // 0x03D4(0x0004)
	struct FVector                                     BeaconOffset;                                             // 0x03D8(0x000C)
	class UTexture2D*                                  BeaconTexture;                                            // 0x03E4(0x0008)
	struct FLinearColor                                BeaconColor;                                              // 0x03EC(0x0010)
	class USoundCue*                                   AmbientSoundCue;                                          // 0x03FC(0x0008) (RepNotify, NonTransactional, EditorOnly, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class UAudioComponent*                             AmbientSoundComponent;                                    // 0x0404(0x0008)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                                          // 0x040C(0x0008)
	float                                              CurrentBehaviorActivationTime;                            // 0x0414(0x0004)
	TArray<struct FBehaviorEntry>                      EncounterAgentBehaviors;                                  // 0x0418(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      SeePlayerBehaviors;                                       // 0x0428(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              MaxSeePlayerDistSq;                                       // 0x0438(0x0004)
	float                                              SeePlayerInterval;                                        // 0x043C(0x0004) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      SpawnBehaviors;                                           // 0x0440(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      UneasyBehaviors;                                          // 0x0450(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      AlertBehaviors;                                           // 0x0460(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      PanicBehaviors;                                           // 0x0470(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      RandomBehaviors;                                          // 0x0480(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      TakeDamageBehaviors;                                      // 0x0490(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              RandomBehaviorInterval;                                   // 0x04A0(0x0004) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              ForceUpdateTime;                                          // 0x04A4(0x0004)
	float                                              ReachThreshold;                                           // 0x04A8(0x0004)
	TArray<struct FBehaviorEntry>                      GroupWaitingBehaviors;                                    // 0x04AC(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              DesiredGroupRadius;                                       // 0x04BC(0x0004) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              DesiredGroupRadiusSq;                                     // 0x04C0(0x0004)
	float                                              MaxLOSLifeDistanceSq;                                     // 0x04C4(0x0004)
	TScriptInterface<class UGameCrowdSpawnerInterface> MySpawner;                                                // 0x04C8(0x0010)
	struct FVector                                     SpawnOffset;                                              // 0x04D8(0x000C)
	float                                              InitialLastRenderTime;                                    // 0x04E4(0x0004)
	struct FColor                                      DebugAgentColor;                                          // 0x04E8(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	class AGameCrowdDestination*                       DebugSpawnDest;                                           // 0x04EC(0x0008) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		return ptr;
	}


	void InitDebugColor();
	void GetBehaviorString();
	void GetDestString();
	void PostRenderFor();
	void NativePostRenderFor();
	void GeneratePathToActor();
	void InitNavigationHandle();
	void OverlappedActorEvent();
	void TakeDamage();
	void FireDeathEvent();
	void PlayDeath();
	void UpdateIntermediatePoint();
	void CalcCamera();
	void IsIdle();
	void SetCurrentBehavior();
	void StopBehavior();
	void HandleBehaviorEvent();
	void ActivateInstancedBehavior();
	void ActivateBehavior();
	void ResetSeePlayer();
	void TryRandomBehavior();
	void NotifySeePlayer();
	void PlaySpawnBehavior();
	void HandlePotentialAgentEncounter();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void OnPlayAgentAnimation();
	void InitializeAgent();
	void GetAttemptedSpawnLocation();
	void SetLighting();
	void DisplayDebug();
	void Destroyed();
	void ResetPooledAgent();
	void KillAgent();
	void PostBeginPlay();
	void SetMaxSpeed();
	void SetCurrentDestination();
	void WaitForGroupMembers();
	void PickBehaviorFrom();
	void IsPanicked();
	void FellOutOfWorld();
	void GetCollisionExtent();
};


// Class GameFramework.GameCrowdAgentSkeletal
// 0x00B4 (0x05A8 - 0x04F4)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x04F4(0x0008) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	class UAnimNodeBlend*                              SpeedBlendNode;                                           // 0x04FC(0x0008)
	class UAnimNodeSlot*                               FullBodySlot;                                             // 0x0504(0x0008)
	class UAnimNodeSequence*                           ActionSeqNode;                                            // 0x050C(0x0008)
	class UAnimNodeSequence*                           WalkSeqNode;                                              // 0x0514(0x0008)
	class UAnimNodeSequence*                           RunSeqNode;                                               // 0x051C(0x0008)
	class UAnimTree*                                   AgentTree;                                                // 0x0524(0x0008)
	TArray<struct FName>                               WalkAnimNames;                                            // 0x052C(0x0010) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	TArray<struct FName>                               RunAnimNames;                                             // 0x053C(0x0010) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	TArray<struct FName>                               IdleAnimNames;                                            // 0x054C(0x0010) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	TArray<struct FName>                               DeathAnimNames;                                           // 0x055C(0x0010) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	float                                              SpeedBlendStart;                                          // 0x056C(0x0004) (RepNotify, Interp, RepRetry, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	float                                              SpeedBlendEnd;                                            // 0x0570(0x0004) (RepNotify, Interp, RepRetry, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	float                                              AnimVelRate;                                              // 0x0574(0x0004) (RepNotify, Interp, RepRetry, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	float                                              MaxSpeedBlendChangeSpeed;                                 // 0x0578(0x0004) (RepNotify, Interp, RepRetry, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	struct FName                                       MoveSyncGroupName;                                        // 0x057C(0x0008) (RepNotify, Interp, RepRetry, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	TArray<struct FGameCrowdAttachmentList>            Attachments;                                              // 0x0584(0x0010) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	float                                              MaxTargetAcquireTime;                                     // 0x0594(0x0004) (RepNotify, Interp, EditorOnly, PrivateWrite, ArchetypeProperty, CrossLevelActive)
	unsigned long                                      bUseRootMotionVelocity : 1;                               // 0x0598(0x0004) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bAllowSkeletonUpdateChangeBasedOnTickResult : 1;          // 0x0598(0x0004) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bTickWhenNotVisible : 1;                                  // 0x0598(0x0004) (RepNotify, NonTransactional, EditorOnly, NotForConsole, RepRetry, ArchetypeProperty)
	unsigned long                                      bIsPlayingIdleAnimation : 1;                              // 0x0598(0x0004)
	unsigned long                                      bIsPlayingDeathAnimation : 1;                             // 0x0598(0x0004)
	unsigned long                                      bIsPlayingImportantAnimation : 1;                         // 0x0598(0x0004)
	unsigned long                                      bAnimateThisTick : 1;                                     // 0x0598(0x0004)
	float                                              NotVisibleDisableTickTime;                                // 0x059C(0x0004) (RepNotify, NonTransactional, EditorOnly, NotForConsole, RepRetry, ArchetypeProperty)
	float                                              MaxAnimationDistance;                                     // 0x05A0(0x0004) (Interp, EditorOnly, ArchetypeProperty, EditHide, CrossLevelActive)
	float                                              MaxAnimationDistanceSq;                                   // 0x05A4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		return ptr;
	}


	void CreateAttachments();
	void OnAnimEnd();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void ClearLatentAnimation();
	void OnPlayAgentAnimation();
	void SetRootMotion();
	void PlayDeath();
	void SetLighting();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentSM
// 0x0010 (0x0504 - 0x04F4)
class AGameCrowdAgentSM : public AGameCrowdAgent
{
public:
	class UStaticMeshComponent*                        Mesh;                                                     // 0x04F4(0x0008) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)
	class UMaterialInstanceConstant*                   MeshColor;                                                // 0x04FC(0x0008) (Interp, NonTransactional, PrivateWrite, ArchetypeProperty, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSM");
		return ptr;
	}


	void StopBehavior();
	void ActivateBehavior();
	void ChangeDebugColor();
	void InitDebugColor();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentBehavior
// 0x003C (0x0094 - 0x0058)
class UGameCrowdAgentBehavior : public UObject
{
public:
	TEnumAsByte<ECrowdBehaviorEvent>                   MyEventType;                                              // 0x0058(0x0001)
	TEnumAsByte<ECrowdBehaviorEvent>                   ViralBehaviorEvent;                                       // 0x0059(0x0001) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned char                                      UnknownData00[0x2];                                       // 0x005A(0x0002) MISSED OFFSET
	float                                              DurationOfBehavior;                                       // 0x005C(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              TimeUntilStopBehavior;                                    // 0x0060(0x0004)
	unsigned long                                      bIdleBehavior : 1;                                        // 0x0064(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bFaceActionTargetFirst : 1;                               // 0x0064(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bIsViralBehavior : 1;                                     // 0x0064(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bPassOnIsViralBehaviorFlag : 1;                           // 0x0064(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AActor*                                      ActionTarget;                                             // 0x0068(0x0008)
	float                                              MaxPlayerDistance;                                        // 0x0070(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              ViralRadius;                                              // 0x0074(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              DurationBeforeBecomesViral;                               // 0x0078(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              TimeToBecomeViral;                                        // 0x007C(0x0004)
	float                                              DurationOfViralBehaviorPropagation;                       // 0x0080(0x0004) (RepNotify, Interp, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              TimeToStopPropagatingViralBehavior;                       // 0x0084(0x0004)
	class AGameCrowdAgent*                             MyAgent;                                                  // 0x0088(0x0008)
	struct FColor                                      DebugBehaviorColor;                                       // 0x0090(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		return ptr;
	}


	void AllowBehaviorAt();
	void AllowThisDestination();
	void PropagateViralBehaviorTo();
	void GetBehaviorInstigator();
	void ActivatedBy();
	void GetDestinationActor();
	void ChangingDestination();
	void GetBehaviorString();
	void OnAnimEnd();
	void StopBehavior();
	void InitBehavior();
	void HandleMovement();
	void FinishedTargetRotation();
	void CanBeUsedBy();
	void Tick();
	void ShouldEndIdle();
	void STATIC_TriggerCrowdBehavior();
};


// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x0038 (0x00CC - 0x0094)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray<struct FName>                               AnimationList;                                            // 0x0094(0x0010) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              BlendInTime;                                              // 0x00A4(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              BlendOutTime;                                             // 0x00A8(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bUseRootMotion : 1;                                       // 0x00AC(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bLookAtPlayer : 1;                                        // 0x00AC(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bLooping : 1;                                             // 0x00AC(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bBlendBetweenAnims : 1;                                   // 0x00AC(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AActor*                                      CustomActionTarget;                                       // 0x00B0(0x0008)
	int                                                LoopIndex;                                                // 0x00B8(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              LoopTime;                                                 // 0x00BC(0x0004) (RepNotify, NonTransactional, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                             // 0x00C0(0x0008)
	int                                                AnimationIndex;                                           // 0x00C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		return ptr;
	}


	void GetBehaviorString();
	void StopBehavior();
	void PlayAgentAnimationNow();
	void OnAnimEnd();
	void SetSequenceOutput();
	void FinishedTargetRotation();
	void InitBehavior();
};


// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0008 (0x009C - 0x0094)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                               // 0x0094(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		return ptr;
	}


	void GetBehaviorString();
	void AllowBehaviorAt();
	void AllowThisDestination();
	void GetBehaviorInstigator();
	void StopBehavior();
	void InitBehavior();
	void ActivatedBy();
};


// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x0094 - 0x0094)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		return ptr;
	}


	void StopBehavior();
	void ShouldEndIdle();
	void GetBehaviorString();
	void InitBehavior();
};


// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x000C (0x00A0 - 0x0094)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	unsigned long                                      bStoppingBehavior : 1;                                    // 0x0094(0x0004)
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                            // 0x0098(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		return ptr;
	}


	void StopBehavior();
	void ShouldEndIdle();
	void GetBehaviorString();
	void GetDestinationActor();
	void ChangingDestination();
	void HandleMovement();
};


// Class GameFramework.GameCrowdGroup
// 0x0010 (0x0068 - 0x0058)
class UGameCrowdGroup : public UObject
{
public:
	TArray<class AGameCrowdAgent*>                     Members;                                                  // 0x0058(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		return ptr;
	}


	void UpdateDestinations();
	void RemoveMember();
	void AddMember();
};


// Class GameFramework.GameCrowdInfoVolume
// 0x0010 (0x02C0 - 0x02B0)
class AGameCrowdInfoVolume : public AVolume
{
public:
	TArray<class AGameCrowdDestination*>               PotentialSpawnPoints;                                     // 0x02B0(0x0010) (RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInfoVolume");
		return ptr;
	}


	void UnTouch();
	void Touch();
};


// Class GameFramework.GameCrowdInteractionPoint
// 0x000C (0x0280 - 0x0274)
class AGameCrowdInteractionPoint : public AActor
{
public:
	unsigned long                                      bIsEnabled : 1;                                           // 0x0274(0x0004) (GlobalConfig, AlwaysInit, RepNotify, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class UCylinderComponent*                          CylinderComponent;                                        // 0x0278(0x0008) (RepNotify, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		return ptr;
	}


	void OnToggle();
};


// Class GameFramework.GameCrowdBehaviorPoint
// 0x0018 (0x0298 - 0x0280)
class AGameCrowdBehaviorPoint : public AGameCrowdInteractionPoint
{
public:
	float                                              RadiusOfBehaviorEvent;                                    // 0x0280(0x0004)
	float                                              DurationOfBehaviorEvent;                                  // 0x0284(0x0004)
	TEnumAsByte<ECrowdBehaviorEvent>                   EventType;                                                // 0x0288(0x0001) (RepNotify, Interp, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	unsigned long                                      bRequireLOS : 1;                                          // 0x028C(0x0004) (RepNotify, Interp, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AActor*                                      Initiator;                                                // 0x0290(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehaviorPoint");
		return ptr;
	}


	void Touch();
	void DestroySelf();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdDestination
// 0x00A8 (0x0328 - 0x0280)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x0280(0x0008)
	unsigned long                                      bKillWhenReached : 1;                                     // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bAllowAsPreviousDestination : 1;                          // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bAvoidWhenPanicked : 1;                                   // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bSkipBehaviorIfPanicked : 1;                              // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bFleeDestination : 1;                                     // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bMustReachExactly : 1;                                    // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bHasRestrictions : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bAllowsSpawning : 1;                                      // 0x0288(0x0004) (Interp, NotForConsole, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bAllowCloudSpawning : 1;                                  // 0x0288(0x0004) (Interp, NotForConsole, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bAllowVisibleSpawning : 1;                                // 0x0288(0x0004) (Interp, NotForConsole, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bLineSpawner : 1;                                         // 0x0288(0x0004) (Interp, NotForConsole, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bSpawnAtEdge : 1;                                         // 0x0288(0x0004) (Interp, NotForConsole, PrivateWrite, EditHide, EditTextBox, CrossLevelActive)
	unsigned long                                      bSoftPerimeter : 1;                                       // 0x0288(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	unsigned long                                      bIsVisible : 1;                                           // 0x0288(0x0004)
	unsigned long                                      bWillBeVisible : 1;                                       // 0x0288(0x0004)
	unsigned long                                      bCanSpawnHereNow : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bIsBeyondSpawnDistance : 1;                               // 0x0288(0x0004)
	unsigned long                                      bAdjacentToVisibleNode : 1;                               // 0x0288(0x0004)
	unsigned long                                      bHasNavigationMesh : 1;                                   // 0x0288(0x0004)
	TArray<class AGameCrowdDestination*>               NextDestinations;                                         // 0x028C(0x0010) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                                // 0x029C(0x0008) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	int                                                Capacity;                                                 // 0x02A4(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              Frequency;                                                // 0x02A8(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	int                                                CustomerCount;                                            // 0x02AC(0x0004)
	TArray<class UClass*>                              SupportedAgentClasses;                                    // 0x02B0(0x0010) (EditorOnly, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	TArray<class UObject*>                             SupportedArchetypes;                                      // 0x02C0(0x0010) (EditorOnly, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	TArray<class UClass*>                              RestrictedAgentClasses;                                   // 0x02D0(0x0010) (EditorOnly, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	TArray<class UObject*>                             RestrictedArchetypes;                                     // 0x02E0(0x0010) (EditorOnly, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditTextBox, CrossLevelActive)
	float                                              ExactReachTolerance;                                      // 0x02F0(0x0004)
	struct FName                                       InteractionTag;                                           // 0x02F4(0x0008) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	float                                              InteractionDelay;                                         // 0x02FC(0x0004) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	TArray<struct FBehaviorEntry>                      ReachedBehaviors;                                         // 0x0300(0x0010) (Interp, NonTransactional, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AGameCrowdAgent*                             AgentEnRoute;                                             // 0x0310(0x0008)
	float                                              Priority;                                                 // 0x0318(0x0004)
	float                                              LastSpawnTime;                                            // 0x031C(0x0004)
	class AGameCrowdPopulationManager*                 MyPopMgr;                                                 // 0x0320(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		return ptr;
	}


	void DrawDebug();
	void GetDestinationRadius();
	void PrioritizeSpawnPoint();
	void AnalyzeSpawnPoint();
	void GetSpawnPosition();
	void GetSpawnRadius();
	void AllowableDestinationFor();
	void AtCapacity();
	void IncrementCustomerCount();
	void DecrementCustomerCount();
	void PickNewDestinationFor();
	void ReachedDestination();
	void Destroyed();
	void PostBeginPlay();
	void ReachedByAgent();
};


// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x0030 (0x02B0 - 0x0280)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                                        // 0x0280(0x0008) (EditorOnly, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                                    // 0x0288(0x0008)
	class AGameCrowdAgent*                             QueuedAgent;                                              // 0x0290(0x0008)
	class AGameCrowdDestination*                       QueueDestination;                                         // 0x0298(0x0008)
	unsigned long                                      bClearingQueue : 1;                                       // 0x02A0(0x0004)
	unsigned long                                      bPendingAdvance : 1;                                      // 0x02A0(0x0004)
	float                                              AverageReactionTime;                                      // 0x02A4(0x0004) (EditorOnly, RepRetry, ProtectedWrite, EditHide, CrossLevelPassive, CrossLevelActive)
	class UClass*                                      QueueBehaviorClass;                                       // 0x02A8(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		return ptr;
	}


	void HasCustomer();
	void ClearQueue();
	void AddCustomer();
	void ActuallyAdvance();
	void AdvanceCustomerTo();
	void ReachedDestination();
	void HasSpace();
	void QueueReachedBy();
};


// Class GameFramework.GameCrowdPopulationManager
// 0x00FC (0x0370 - 0x0274)
class AGameCrowdPopulationManager : public ACrowdPopulationManagerBase
{
public:
	struct FPointer                                    VfTable_IInterface_NavigationHandle;                      // 0x0274(0x0008)
	struct FCrowdSpawnInfoItem                         CloudSpawnInfo;                                           // 0x027C(0x0090)
	TArray<struct FCrowdSpawnInfoItem>                 ScriptedSpawnInfo;                                        // 0x030C(0x0010)
	class AGameCrowdInfoVolume*                        ActiveCrowdInfoVolume;                                    // 0x031C(0x0008)
	TArray<class AGameCrowdDestination*>               GlobalPotentialSpawnPoints;                               // 0x0324(0x0010)
	float                                              SplitScreenNumReduction;                                  // 0x0334(0x0004)
	float                                              PlayerPositionPredictionTime;                             // 0x0338(0x0004)
	float                                              HeadVisibilityOffset;                                     // 0x033C(0x0004)
	class UClass*                                      NavigationHandleClass;                                    // 0x0340(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0348(0x0008)
	class AGameCrowdAgent*                             QueryingAgent;                                            // 0x0350(0x0008)
	TArray<struct FCrowdSpawnerPlayerInfo>             PlayerInfo;                                               // 0x0358(0x0010)
	float                                              LastPlayerInfoUpdateTime;                                 // 0x0368(0x0004)
	unsigned long                                      bDebugSpawns : 1;                                         // 0x036C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)
	unsigned long                                      bPauseCrowd : 1;                                          // 0x036C(0x0004) (NonTransactional, EditorOnly, RepRetry, PrivateWrite, ArchetypeProperty, EditHide)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		return ptr;
	}


	void CreateNewAgent();
	void Warmup();
	void SpawnAgent();
	void SpawnAgentByIdx();
	void ValidateSpawnAt();
	void AddPrioritizedSpawnPoint();
	void AnalyzeSpawnPoints();
	void PrioritizeSpawnPoints();
	void STATIC_StaticGetPlayerInfo();
	void GetPlayerInfo();
	void PickSpawnPoint();
	void UpdateSpawner();
	void UpdateAllSpawners();
	void Tick();
	void ShouldDebugDestinations();
	void IsSpawningActive();
	void DisplayDebug();
	void AgentDestroyed();
	void FlushAllAgents();
	void FlushAgents();
	void CreateSpawner();
	void SetCrowdInfoVolume();
	void RemoveSpawnPoint();
	void AddSpawnPoint();
	void NotifyPathChanged();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdReplicationActor
// 0x0010 (0x0284 - 0x0274)
