#pragma once

// Lost Ark (1.2.0.3) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_GameFramework_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GameFramework.DynamicSpriteComponent
// 0x004C (0x02F8 - 0x02AC)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                            // 0x02AC(0x0014)
	struct FInterpCurveLinearColor                     AnimatedColor;                                            // 0x02C0(0x0014)
	struct FInterpCurveVector2D                        AnimatedPosition;                                         // 0x02D4(0x0014)
	struct FVector                                     LocationOffset;                                           // 0x02E8(0x000C)
	int                                                LoopCount;                                                // 0x02F4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		return ptr;
	}

};


// Class GameFramework.FrameworkGame
// 0x0010 (0x04D0 - 0x04C0)
class AFrameworkGame : public AGameInfo
{
public:
	TArray<struct FRequiredMobileInputConfig>          RequiredMobileInputConfigs;                               // 0x04C0(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.FrameworkGame");
		return ptr;
	}

};


// Class GameFramework.GameAIController
// 0x004C (0x04D0 - 0x0484)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                              // 0x0484(0x0008)
	unsigned long                                      bHasRunawayCommandList : 1;                               // 0x048C(0x0004)
	unsigned long                                      bAILogging : 1;                                           // 0x048C(0x0004)
	unsigned long                                      bAILogToWindow : 1;                                       // 0x048C(0x0004)
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x048C(0x0004)
	unsigned long                                      bMapBasedLogName : 1;                                     // 0x048C(0x0004)
	unsigned long                                      bAIDrawDebug : 1;                                         // 0x048C(0x0004)
	unsigned long                                      bAIBroken : 1;                                            // 0x048C(0x0004)
	class AFileLog*                                    AILogFile;                                                // 0x0490(0x0008)
	float                                              DebugTextMaxLen;                                          // 0x0498(0x0004)
	TArray<struct FAICmdHistoryItem>                   CommandHistory;                                           // 0x049C(0x0010)
	int                                                CommandHistoryNum;                                        // 0x04AC(0x0004)
	TArray<struct FName>                               AILogFilter;                                              // 0x04B0(0x0010)
	struct FString                                     DemoActionString;                                         // 0x04C0(0x0010) (EditConst, GlobalConfig, AlwaysInit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAIController");
		return ptr;
	}


	void GetActionString();
	void STATIC_SetDesiredRotation();
	void AILog_Internal();
	void STATIC_RecordDemoAILog();
	void Destroyed();
	void STATIC_ReachedIntermediateMoveGoal();
	void STATIC_ReachedMoveGoal();
	void STATIC_GetDestinationOffset();
	void STATIC_GetAICommandInStack();
	void STATIC_FindCommandOfClass();
	void STATIC_DumpCommandStack();
	void STATIC_CheckCommandCount();
	void STATIC_GetActiveCommand();
	void STATIC_AbortCommand();
	void STATIC_PopCommand();
	void STATIC_PushCommand();
	void STATIC_AllCommands();
};


// Class GameFramework.GameAICommand
// 0x0024 (0x007C - 0x0058)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                             // 0x0058(0x0008)
	struct FName                                       ChildStatus;                                              // 0x0060(0x0008)
	class AGameAIController*                           GameAIOwner;                                              // 0x0068(0x0008)
	struct FName                                       Status;                                                   // 0x0070(0x0008)
	unsigned long                                      bAllowNewSameClassInstance : 1;                           // 0x0078(0x0004)
	unsigned long                                      bReplaceActiveSameClassInstance : 1;                      // 0x0078(0x0004)
	unsigned long                                      bAborted : 1;                                             // 0x0078(0x0004)
	unsigned long                                      bIgnoreNotifies : 1;                                      // 0x0078(0x0004)
	unsigned long                                      bIgnoreStepAside : 1;                                     // 0x0078(0x0004)
	unsigned long                                      bPendingPop : 1;                                          // 0x0078(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICommand");
		return ptr;
	}


	void HandlePathObstruction();
	void MoveUnreachable();
	void STATIC_NotifyNeedRepath();
	void GetDebugVerboseText();
	void STATIC_GetDebugOverheadText();
	void DrawDebug();
	void GetDumpString();
	void STATIC_Resumed();
	void Paused();
	void STATIC_Popped();
	void STATIC_Pushed();
	void STATIC_PostPopped();
	void STATIC_PrePushed();
	void STATIC_AllowStateTransitionTo();
	void STATIC_AllowTransitionTo();
	void Tick();
	void STATIC_ShouldIgnoreNotifies();
	void InternalTick();
	void InternalResumed();
	void InternalPaused();
	void InternalPopped();
	void InternalPushed();
	void InternalPrePushed();
	void STATIC_InitCommand();
	void STATIC_InitCommandUserActor();
};


// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x02B4 - 0x02B4)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		return ptr;
	}

};


// Class GameFramework.GamePlayerController
// 0x0010 (0x0790 - 0x0780)
class AGamePlayerController : public APlayerController
{
public:
	unsigned long                                      bWarnCrowdMembers : 1;                                    // 0x0780(0x0004)
	unsigned long                                      bDebugCrowdAwareness : 1;                                 // 0x0780(0x0004)
	unsigned long                                      bIsWarmupPaused : 1;                                      // 0x0780(0x0004)
	float                                              AgentAwareRadius;                                         // 0x0784(0x0004)
	struct FName                                       CurrentSoundMode;                                         // 0x0788(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePlayerController");
		return ptr;
	}


	void STATIC_ClientColorFade();
	void WarmupPause();
	void STATIC_CanUnpauseWarmup();
	void STATIC_GetCurrentMovie();
	void ClientStopMovie();
	void ClientPlayMovie();
	void STATIC_KeepPlayingLoadingMovie();
	void STATIC_ShowLoadingMovie();
	void STATIC_SetSoundMode();
	void DoForceFeedbackForScreenShake();
	void NotifyCrowdAgentInRadius();
	void NotifyCrowdAgentRefresh();
	void STATIC_CrowdDebug();
	void STATIC_GetUIPlayerIndex();
	void STATIC_OnToggleMouseCursor();
};


// Class GameFramework.GameCheatManager
// 0x0020 (0x0098 - 0x0078)
class UGameCheatManager : public UCheatManager
{
public:
	class ADebugCameraController*                      DebugCameraControllerRef;                                 // 0x0078(0x0008)
	class UClass*                                      DebugCameraControllerClass;                               // 0x0080(0x0008)
	struct FString                                     DebugCameraControllerClassName;                           // 0x0088(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCheatManager");
		return ptr;
	}


	void STATIC_EnableDebugCamera();
	void STATIC_TeleportPawnToCamera();
	void STATIC_ToggleDebugCamera();
	void STATIC_PatchDebugCameraController();
};


// Class GameFramework.GameCrowdAgent
// 0x0278 (0x04F4 - 0x027C)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	struct FPointer                                    VfTable_IInterface_RVO;                                   // 0x027C(0x0008)
	class UGameCrowdGroup*                             MyGroup;                                                  // 0x0284(0x0008)
	struct FVector                                     PreferredVelocity;                                        // 0x028C(0x000C)
	struct FVector                                     PendingVelocity;                                          // 0x0298(0x000C)
	class AGameCrowdDestination*                       CurrentDestination;                                       // 0x02A4(0x0008)
	class AGameCrowdDestination*                       BehaviorDestination;                                      // 0x02AC(0x0008)
	class AGameCrowdDestination*                       PreviousDestination;                                      // 0x02B4(0x0008)
	float                                              InterpZTranslation;                                       // 0x02BC(0x0004)
	int                                                Health;                                                   // 0x02C0(0x0004)
	float                                              DeadBodyDuration;                                         // 0x02C4(0x0004)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x02C8(0x0008)
	int                                                ConformTraceFrameCount;                                   // 0x02D0(0x0004)
	TArray<struct FNearbyDynamicItem>                  NearbyDynamics;                                           // 0x02D4(0x0010)
	unsigned long                                      bUniformScale : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bCheckForObstacles : 1;                                   // 0x02E4(0x0004)
	unsigned long                                      bUseNavMeshPathing : 1;                                   // 0x02E4(0x0004)
	unsigned long                                      bWantsSeePlayerNotification : 1;                          // 0x02E4(0x0004)
	unsigned long                                      bAllowPitching : 1;                                       // 0x02E4(0x0004)
	unsigned long                                      bHitObstacle : 1;                                         // 0x02E4(0x0004)
	unsigned long                                      bBadHitNormal : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bSimulateThisTick : 1;                                    // 0x02E4(0x0004)
	unsigned long                                      bPotentialEncounter : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsPanicked : 1;                                          // 0x02E4(0x0004)
	unsigned long                                      bWantsGroupIdle : 1;                                      // 0x02E4(0x0004)
	unsigned long                                      bPreferVisibleDestination : 1;                            // 0x02E4(0x0004)
	unsigned long                                      bPreferVisibleDestinationOnSpawn : 1;                     // 0x02E4(0x0004)
	unsigned long                                      bHasNotifiedSpawner : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsInSpawnPool : 1;                                       // 0x02E4(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x02E4(0x0004)
	TEnumAsByte<EConformType>                          ConformType;                                              // 0x02E8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02E9(0x0003) MISSED OFFSET
	float                                              ConformTraceDist;                                         // 0x02EC(0x0004)
	int                                                ConformTraceInterval;                                     // 0x02F0(0x0004)
	int                                                CurrentConformTraceInterval;                              // 0x02F4(0x0004)
	float                                              LastGroundZ;                                              // 0x02F8(0x0004)
	float                                              AwareRadius;                                              // 0x02FC(0x0004)
	float                                              AvoidOtherRadius;                                         // 0x0300(0x0004)
	TArray<struct FAvoidOtherSampleItem>               AvoidOtherSampleList;                                     // 0x0304(0x0010)
	float                                              PENALTY_COEFF_ANGLETOGOAL;                                // 0x0314(0x0004)
	float                                              PENALTY_COEFF_ANGLETOVEL;                                 // 0x0318(0x0004)
	float                                              PENALTY_COEFF_MAG;                                        // 0x031C(0x0004)
	float                                              MIN_PENALTY_THRESHOLD;                                    // 0x0320(0x0004)
	float                                              LastProgressTime;                                         // 0x0324(0x0004)
	float                                              LastFallbackActiveTime;                                   // 0x0328(0x0004)
	float                                              MaxPathLaneValue;                                         // 0x032C(0x0004)
	float                                              CurrentPathLaneValue;                                     // 0x0330(0x0004)
	int                                                ExtraPathCost;                                            // 0x0334(0x0004)
	float                                              RotateToTargetSpeed;                                      // 0x0338(0x0004)
	float                                              MaxYawRate;                                               // 0x033C(0x0004)
	struct FVector                                     MeshMinScale3D;                                           // 0x0340(0x000C)
	struct FVector                                     MeshMaxScale3D;                                           // 0x034C(0x000C)
	float                                              EyeZOffset;                                               // 0x0358(0x0004)
	float                                              ProximityLODDist;                                         // 0x035C(0x0004)
	float                                              VisibleProximityLODDist;                                  // 0x0360(0x0004)
	struct FVector                                     LastKnownGoodPosition;                                    // 0x0364(0x000C)
	float                                              GroundOffset;                                             // 0x0370(0x0004)
	struct FVector                                     IntermediatePoint;                                        // 0x0374(0x000C)
	struct FVector                                     SearchExtent;                                             // 0x0380(0x000C)
	class UClass*                                      NavigationHandleClass;                                    // 0x038C(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0394(0x0008)
	int                                                ObstacleCheckCount;                                       // 0x039C(0x0004)
	float                                              WalkableFloorZ;                                           // 0x03A0(0x0004)
	float                                              LastPathingAttempt;                                       // 0x03A4(0x0004)
	float                                              LastUpdateTime;                                           // 0x03A8(0x0004)
	float                                              NotVisibleLifeSpan;                                       // 0x03AC(0x0004)
	class AGameCrowdAgent*                             MyArchetype;                                              // 0x03B0(0x0008)
	float                                              MaxWalkingSpeed;                                          // 0x03B8(0x0004)
	float                                              MaxRunningSpeed;                                          // 0x03BC(0x0004)
	float                                              MaxSpeed;                                                 // 0x03C0(0x0004)
	TArray<struct FRecentInteraction>                  RecentInteractions;                                       // 0x03C4(0x0010)
	float                                              BeaconMaxDist;                                            // 0x03D4(0x0004)
	struct FVector                                     BeaconOffset;                                             // 0x03D8(0x000C)
	class UTexture2D*                                  BeaconTexture;                                            // 0x03E4(0x0008)
	struct FLinearColor                                BeaconColor;                                              // 0x03EC(0x0010)
	class USoundCue*                                   AmbientSoundCue;                                          // 0x03FC(0x0008)
	class UAudioComponent*                             AmbientSoundComponent;                                    // 0x0404(0x0008)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                                          // 0x040C(0x0008)
	float                                              CurrentBehaviorActivationTime;                            // 0x0414(0x0004)
	TArray<struct FBehaviorEntry>                      EncounterAgentBehaviors;                                  // 0x0418(0x0010)
	TArray<struct FBehaviorEntry>                      SeePlayerBehaviors;                                       // 0x0428(0x0010)
	float                                              MaxSeePlayerDistSq;                                       // 0x0438(0x0004)
	float                                              SeePlayerInterval;                                        // 0x043C(0x0004)
	TArray<struct FBehaviorEntry>                      SpawnBehaviors;                                           // 0x0440(0x0010)
	TArray<struct FBehaviorEntry>                      UneasyBehaviors;                                          // 0x0450(0x0010)
	TArray<struct FBehaviorEntry>                      AlertBehaviors;                                           // 0x0460(0x0010)
	TArray<struct FBehaviorEntry>                      PanicBehaviors;                                           // 0x0470(0x0010)
	TArray<struct FBehaviorEntry>                      RandomBehaviors;                                          // 0x0480(0x0010)
	TArray<struct FBehaviorEntry>                      TakeDamageBehaviors;                                      // 0x0490(0x0010)
	float                                              RandomBehaviorInterval;                                   // 0x04A0(0x0004)
	float                                              ForceUpdateTime;                                          // 0x04A4(0x0004)
	float                                              ReachThreshold;                                           // 0x04A8(0x0004)
	TArray<struct FBehaviorEntry>                      GroupWaitingBehaviors;                                    // 0x04AC(0x0010)
	float                                              DesiredGroupRadius;                                       // 0x04BC(0x0004)
	float                                              DesiredGroupRadiusSq;                                     // 0x04C0(0x0004)
	float                                              MaxLOSLifeDistanceSq;                                     // 0x04C4(0x0004)
	TScriptInterface<class UGameCrowdSpawnerInterface> MySpawner;                                                // 0x04C8(0x0010)
	struct FVector                                     SpawnOffset;                                              // 0x04D8(0x000C)
	float                                              InitialLastRenderTime;                                    // 0x04E4(0x0004)
	struct FColor                                      DebugAgentColor;                                          // 0x04E8(0x0004)
	class AGameCrowdDestination*                       DebugSpawnDest;                                           // 0x04EC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		return ptr;
	}


	void STATIC_InitDebugColor();
	void STATIC_GetBehaviorString();
	void STATIC_GetDestString();
	void PostRenderFor();
	void STATIC_NativePostRenderFor();
	void GeneratePathToActor();
	void InitNavigationHandle();
	void OverlappedActorEvent();
	void TakeDamage();
	void FireDeathEvent();
	void STATIC_PlayDeath();
	void UpdateIntermediatePoint();
	void CalcCamera();
	void STATIC_IsIdle();
	void STATIC_SetCurrentBehavior();
	void StopBehavior();
	void HandleBehaviorEvent();
	void STATIC_ActivateInstancedBehavior();
	void ActivateBehavior();
	void STATIC_ResetSeePlayer();
	void STATIC_TryRandomBehavior();
	void NotifySeePlayer();
	void STATIC_PlaySpawnBehavior();
	void HandlePotentialAgentEncounter();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void STATIC_OnPlayAgentAnimation();
	void STATIC_InitializeAgent();
	void STATIC_GetAttemptedSpawnLocation();
	void STATIC_SetLighting();
	void DisplayDebug();
	void Destroyed();
	void STATIC_ResetPooledAgent();
	void KillAgent();
	void PostBeginPlay();
	void STATIC_SetMaxSpeed();
	void SetCurrentDestination();
	void WaitForGroupMembers();
	void STATIC_PickBehaviorFrom();
	void STATIC_IsPanicked();
	void FellOutOfWorld();
	void STATIC_GetCollisionExtent();
};


// Class GameFramework.GameCrowdAgentSkeletal
// 0x00B4 (0x05A8 - 0x04F4)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x04F4(0x0008)
	class UAnimNodeBlend*                              SpeedBlendNode;                                           // 0x04FC(0x0008)
	class UAnimNodeSlot*                               FullBodySlot;                                             // 0x0504(0x0008)
	class UAnimNodeSequence*                           ActionSeqNode;                                            // 0x050C(0x0008)
	class UAnimNodeSequence*                           WalkSeqNode;                                              // 0x0514(0x0008)
	class UAnimNodeSequence*                           RunSeqNode;                                               // 0x051C(0x0008)
	class UAnimTree*                                   AgentTree;                                                // 0x0524(0x0008)
	TArray<struct FName>                               WalkAnimNames;                                            // 0x052C(0x0010)
	TArray<struct FName>                               RunAnimNames;                                             // 0x053C(0x0010)
	TArray<struct FName>                               IdleAnimNames;                                            // 0x054C(0x0010)
	TArray<struct FName>                               DeathAnimNames;                                           // 0x055C(0x0010)
	float                                              SpeedBlendStart;                                          // 0x056C(0x0004)
	float                                              SpeedBlendEnd;                                            // 0x0570(0x0004)
	float                                              AnimVelRate;                                              // 0x0574(0x0004)
	float                                              MaxSpeedBlendChangeSpeed;                                 // 0x0578(0x0004)
	struct FName                                       MoveSyncGroupName;                                        // 0x057C(0x0008)
	TArray<struct FGameCrowdAttachmentList>            Attachments;                                              // 0x0584(0x0010)
	float                                              MaxTargetAcquireTime;                                     // 0x0594(0x0004)
	unsigned long                                      bUseRootMotionVelocity : 1;                               // 0x0598(0x0004)
	unsigned long                                      bAllowSkeletonUpdateChangeBasedOnTickResult : 1;          // 0x0598(0x0004)
	unsigned long                                      bTickWhenNotVisible : 1;                                  // 0x0598(0x0004)
	unsigned long                                      bIsPlayingIdleAnimation : 1;                              // 0x0598(0x0004)
	unsigned long                                      bIsPlayingDeathAnimation : 1;                             // 0x0598(0x0004)
	unsigned long                                      bIsPlayingImportantAnimation : 1;                         // 0x0598(0x0004)
	unsigned long                                      bAnimateThisTick : 1;                                     // 0x0598(0x0004)
	float                                              NotVisibleDisableTickTime;                                // 0x059C(0x0004)
	float                                              MaxAnimationDistance;                                     // 0x05A0(0x0004)
	float                                              MaxAnimationDistanceSq;                                   // 0x05A4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		return ptr;
	}


	void STATIC_CreateAttachments();
	void OnAnimEnd();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void ClearLatentAnimation();
	void STATIC_OnPlayAgentAnimation();
	void STATIC_SetRootMotion();
	void STATIC_PlayDeath();
	void STATIC_SetLighting();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentSM
// 0x0010 (0x0504 - 0x04F4)
class AGameCrowdAgentSM : public AGameCrowdAgent
{
public:
	class UStaticMeshComponent*                        Mesh;                                                     // 0x04F4(0x0008)
	class UMaterialInstanceConstant*                   MeshColor;                                                // 0x04FC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSM");
		return ptr;
	}


	void StopBehavior();
	void ActivateBehavior();
	void STATIC_ChangeDebugColor();
	void STATIC_InitDebugColor();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentBehavior
// 0x003C (0x0094 - 0x0058)
class UGameCrowdAgentBehavior : public UObject
{
public:
	TEnumAsByte<ECrowdBehaviorEvent>                   MyEventType;                                              // 0x0058(0x0001)
	TEnumAsByte<ECrowdBehaviorEvent>                   ViralBehaviorEvent;                                       // 0x0059(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x005A(0x0002) MISSED OFFSET
	float                                              DurationOfBehavior;                                       // 0x005C(0x0004)
	float                                              TimeUntilStopBehavior;                                    // 0x0060(0x0004)
	unsigned long                                      bIdleBehavior : 1;                                        // 0x0064(0x0004)
	unsigned long                                      bFaceActionTargetFirst : 1;                               // 0x0064(0x0004)
	unsigned long                                      bIsViralBehavior : 1;                                     // 0x0064(0x0004)
	unsigned long                                      bPassOnIsViralBehaviorFlag : 1;                           // 0x0064(0x0004)
	class AActor*                                      ActionTarget;                                             // 0x0068(0x0008)
	float                                              MaxPlayerDistance;                                        // 0x0070(0x0004)
	float                                              ViralRadius;                                              // 0x0074(0x0004)
	float                                              DurationBeforeBecomesViral;                               // 0x0078(0x0004)
	float                                              TimeToBecomeViral;                                        // 0x007C(0x0004)
	float                                              DurationOfViralBehaviorPropagation;                       // 0x0080(0x0004)
	float                                              TimeToStopPropagatingViralBehavior;                       // 0x0084(0x0004)
	class AGameCrowdAgent*                             MyAgent;                                                  // 0x0088(0x0008)
	struct FColor                                      DebugBehaviorColor;                                       // 0x0090(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		return ptr;
	}


	void STATIC_AllowBehaviorAt();
	void STATIC_AllowThisDestination();
	void PropagateViralBehaviorTo();
	void STATIC_GetBehaviorInstigator();
	void STATIC_ActivatedBy();
	void STATIC_GetDestinationActor();
	void STATIC_ChangingDestination();
	void STATIC_GetBehaviorString();
	void OnAnimEnd();
	void StopBehavior();
	void STATIC_InitBehavior();
	void STATIC_HandleMovement();
	void FinishedTargetRotation();
	void STATIC_CanBeUsedBy();
	void Tick();
	void STATIC_ShouldEndIdle();
	void STATIC_TriggerCrowdBehavior();
};


// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x0038 (0x00CC - 0x0094)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray<struct FName>                               AnimationList;                                            // 0x0094(0x0010)
	float                                              BlendInTime;                                              // 0x00A4(0x0004)
	float                                              BlendOutTime;                                             // 0x00A8(0x0004)
	unsigned long                                      bUseRootMotion : 1;                                       // 0x00AC(0x0004)
	unsigned long                                      bLookAtPlayer : 1;                                        // 0x00AC(0x0004)
	unsigned long                                      bLooping : 1;                                             // 0x00AC(0x0004)
	unsigned long                                      bBlendBetweenAnims : 1;                                   // 0x00AC(0x0004)
	class AActor*                                      CustomActionTarget;                                       // 0x00B0(0x0008)
	int                                                LoopIndex;                                                // 0x00B8(0x0004)
	float                                              LoopTime;                                                 // 0x00BC(0x0004)
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                             // 0x00C0(0x0008)
	int                                                AnimationIndex;                                           // 0x00C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		return ptr;
	}


	void STATIC_GetBehaviorString();
	void StopBehavior();
	void STATIC_PlayAgentAnimationNow();
	void OnAnimEnd();
	void STATIC_SetSequenceOutput();
	void FinishedTargetRotation();
	void STATIC_InitBehavior();
};


// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0008 (0x009C - 0x0094)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                               // 0x0094(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		return ptr;
	}


	void STATIC_GetBehaviorString();
	void STATIC_AllowBehaviorAt();
	void STATIC_AllowThisDestination();
	void STATIC_GetBehaviorInstigator();
	void StopBehavior();
	void STATIC_InitBehavior();
	void STATIC_ActivatedBy();
};


// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x0094 - 0x0094)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		return ptr;
	}


	void StopBehavior();
	void STATIC_ShouldEndIdle();
	void STATIC_GetBehaviorString();
	void STATIC_InitBehavior();
};


// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x000C (0x00A0 - 0x0094)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	unsigned long                                      bStoppingBehavior : 1;                                    // 0x0094(0x0004)
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                            // 0x0098(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		return ptr;
	}


	void StopBehavior();
	void STATIC_ShouldEndIdle();
	void STATIC_GetBehaviorString();
	void STATIC_GetDestinationActor();
	void STATIC_ChangingDestination();
	void STATIC_HandleMovement();
};


// Class GameFramework.GameCrowdGroup
// 0x0010 (0x0068 - 0x0058)
class UGameCrowdGroup : public UObject
{
public:
	TArray<class AGameCrowdAgent*>                     Members;                                                  // 0x0058(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		return ptr;
	}


	void STATIC_UpdateDestinations();
	void STATIC_RemoveMember();
	void STATIC_AddMember();
};


// Class GameFramework.GameCrowdInfoVolume
// 0x0010 (0x02C0 - 0x02B0)
class AGameCrowdInfoVolume : public AVolume
{
public:
	TArray<class AGameCrowdDestination*>               PotentialSpawnPoints;                                     // 0x02B0(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInfoVolume");
		return ptr;
	}


	void UnTouch();
	void Touch();
};


// Class GameFramework.GameCrowdInteractionPoint
// 0x000C (0x0280 - 0x0274)
class AGameCrowdInteractionPoint : public AActor
{
public:
	unsigned long                                      bIsEnabled : 1;                                           // 0x0274(0x0004) (GlobalConfig, AlwaysInit)
	class UCylinderComponent*                          CylinderComponent;                                        // 0x0278(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		return ptr;
	}


	void STATIC_OnToggle();
};


// Class GameFramework.GameCrowdBehaviorPoint
// 0x0018 (0x0298 - 0x0280)
class AGameCrowdBehaviorPoint : public AGameCrowdInteractionPoint
{
public:
	float                                              RadiusOfBehaviorEvent;                                    // 0x0280(0x0004)
	float                                              DurationOfBehaviorEvent;                                  // 0x0284(0x0004)
	TEnumAsByte<ECrowdBehaviorEvent>                   EventType;                                                // 0x0288(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	unsigned long                                      bRequireLOS : 1;                                          // 0x028C(0x0004)
	class AActor*                                      Initiator;                                                // 0x0290(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehaviorPoint");
		return ptr;
	}


	void Touch();
	void STATIC_DestroySelf();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdDestination
// 0x00A8 (0x0328 - 0x0280)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x0280(0x0008)
	unsigned long                                      bKillWhenReached : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bAllowAsPreviousDestination : 1;                          // 0x0288(0x0004)
	unsigned long                                      bAvoidWhenPanicked : 1;                                   // 0x0288(0x0004)
	unsigned long                                      bSkipBehaviorIfPanicked : 1;                              // 0x0288(0x0004)
	unsigned long                                      bFleeDestination : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bMustReachExactly : 1;                                    // 0x0288(0x0004)
	unsigned long                                      bHasRestrictions : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bAllowsSpawning : 1;                                      // 0x0288(0x0004)
	unsigned long                                      bAllowCloudSpawning : 1;                                  // 0x0288(0x0004)
	unsigned long                                      bAllowVisibleSpawning : 1;                                // 0x0288(0x0004)
	unsigned long                                      bLineSpawner : 1;                                         // 0x0288(0x0004)
	unsigned long                                      bSpawnAtEdge : 1;                                         // 0x0288(0x0004)
	unsigned long                                      bSoftPerimeter : 1;                                       // 0x0288(0x0004)
	unsigned long                                      bIsVisible : 1;                                           // 0x0288(0x0004)
	unsigned long                                      bWillBeVisible : 1;                                       // 0x0288(0x0004)
	unsigned long                                      bCanSpawnHereNow : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bIsBeyondSpawnDistance : 1;                               // 0x0288(0x0004)
	unsigned long                                      bAdjacentToVisibleNode : 1;                               // 0x0288(0x0004)
	unsigned long                                      bHasNavigationMesh : 1;                                   // 0x0288(0x0004)
	TArray<class AGameCrowdDestination*>               NextDestinations;                                         // 0x028C(0x0010)
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                                // 0x029C(0x0008)
	int                                                Capacity;                                                 // 0x02A4(0x0004)
	float                                              Frequency;                                                // 0x02A8(0x0004)
	int                                                CustomerCount;                                            // 0x02AC(0x0004)
	TArray<class UClass*>                              SupportedAgentClasses;                                    // 0x02B0(0x0010)
	TArray<class UObject*>                             SupportedArchetypes;                                      // 0x02C0(0x0010)
	TArray<class UClass*>                              RestrictedAgentClasses;                                   // 0x02D0(0x0010)
	TArray<class UObject*>                             RestrictedArchetypes;                                     // 0x02E0(0x0010)
	float                                              ExactReachTolerance;                                      // 0x02F0(0x0004)
	struct FName                                       InteractionTag;                                           // 0x02F4(0x0008)
	float                                              InteractionDelay;                                         // 0x02FC(0x0004)
	TArray<struct FBehaviorEntry>                      ReachedBehaviors;                                         // 0x0300(0x0010)
	class AGameCrowdAgent*                             AgentEnRoute;                                             // 0x0310(0x0008)
	float                                              Priority;                                                 // 0x0318(0x0004)
	float                                              LastSpawnTime;                                            // 0x031C(0x0004)
	class AGameCrowdPopulationManager*                 MyPopMgr;                                                 // 0x0320(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		return ptr;
	}


	void DrawDebug();
	void STATIC_GetDestinationRadius();
	void STATIC_PrioritizeSpawnPoint();
	void STATIC_AnalyzeSpawnPoint();
	void STATIC_GetSpawnPosition();
	void STATIC_GetSpawnRadius();
	void AllowableDestinationFor();
	void AtCapacity();
	void IncrementCustomerCount();
	void DecrementCustomerCount();
	void STATIC_PickNewDestinationFor();
	void ReachedDestination();
	void Destroyed();
	void PostBeginPlay();
	void STATIC_ReachedByAgent();
};


// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x0030 (0x02B0 - 0x0280)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                                        // 0x0280(0x0008)
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                                    // 0x0288(0x0008)
	class AGameCrowdAgent*                             QueuedAgent;                                              // 0x0290(0x0008)
	class AGameCrowdDestination*                       QueueDestination;                                         // 0x0298(0x0008)
	unsigned long                                      bClearingQueue : 1;                                       // 0x02A0(0x0004)
	unsigned long                                      bPendingAdvance : 1;                                      // 0x02A0(0x0004)
	float                                              AverageReactionTime;                                      // 0x02A4(0x0004)
	class UClass*                                      QueueBehaviorClass;                                       // 0x02A8(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		return ptr;
	}


	void STATIC_HasCustomer();
	void STATIC_ClearQueue();
	void STATIC_AddCustomer();
	void STATIC_ActuallyAdvance();
	void STATIC_AdvanceCustomerTo();
	void ReachedDestination();
	void STATIC_HasSpace();
	void STATIC_QueueReachedBy();
};


// Class GameFramework.GameCrowdPopulationManager
// 0x00FC (0x0370 - 0x0274)
class AGameCrowdPopulationManager : public ACrowdPopulationManagerBase
{
public:
	struct FPointer                                    VfTable_IInterface_NavigationHandle;                      // 0x0274(0x0008)
	struct FCrowdSpawnInfoItem                         CloudSpawnInfo;                                           // 0x027C(0x0090)
	TArray<struct FCrowdSpawnInfoItem>                 ScriptedSpawnInfo;                                        // 0x030C(0x0010)
	class AGameCrowdInfoVolume*                        ActiveCrowdInfoVolume;                                    // 0x031C(0x0008)
	TArray<class AGameCrowdDestination*>               GlobalPotentialSpawnPoints;                               // 0x0324(0x0010)
	float                                              SplitScreenNumReduction;                                  // 0x0334(0x0004)
	float                                              PlayerPositionPredictionTime;                             // 0x0338(0x0004)
	float                                              HeadVisibilityOffset;                                     // 0x033C(0x0004)
	class UClass*                                      NavigationHandleClass;                                    // 0x0340(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0348(0x0008)
	class AGameCrowdAgent*                             QueryingAgent;                                            // 0x0350(0x0008)
	TArray<struct FCrowdSpawnerPlayerInfo>             PlayerInfo;                                               // 0x0358(0x0010)
	float                                              LastPlayerInfoUpdateTime;                                 // 0x0368(0x0004)
	unsigned long                                      bDebugSpawns : 1;                                         // 0x036C(0x0004)
	unsigned long                                      bPauseCrowd : 1;                                          // 0x036C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		return ptr;
	}


	void CreateNewAgent();
	void STATIC_Warmup();
	void STATIC_SpawnAgent();
	void STATIC_SpawnAgentByIdx();
	void STATIC_ValidateSpawnAt();
	void STATIC_AddPrioritizedSpawnPoint();
	void STATIC_AnalyzeSpawnPoints();
	void PrioritizeSpawnPoints();
	void STATIC_StaticGetPlayerInfo();
	void STATIC_GetPlayerInfo();
	void PickSpawnPoint();
	void UpdateSpawner();
	void STATIC_UpdateAllSpawners();
	void Tick();
	void STATIC_ShouldDebugDestinations();
	void STATIC_IsSpawningActive();
	void DisplayDebug();
	void STATIC_AgentDestroyed();
	void FlushAllAgents();
	void FlushAgents();
	void CreateSpawner();
	void STATIC_SetCrowdInfoVolume();
	void STATIC_RemoveSpawnPoint();
	void STATIC_AddSpawnPoint();
	void NotifyPathChanged();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdReplicationActor
// 0x0010 (0x0284 - 0x0274)
class AGameCrowdReplicationActor : public AActor
{
public:
	class USeqAct_GameCrowdSpawner*                    Spawner;                                                  // 0x0274(0x0008) (GlobalConfig, AlwaysInit)
	unsigned long                                      bSpawningActive : 1;                                      // 0x027C(0x0004) (EditConst, GlobalConfig, AlwaysInit)
	int                                                DestroyAllCount;                                          // 0x0280(0x0004) (EditConst, GlobalConfig, AlwaysInit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdReplicationActor");
		return ptr;
	}


	void ReplicatedEvent();
};


// Class GameFramework.GameCrowdSpawnRelativeActor
// 0x0000 (0x0274 - 0x0274)
class AGameCrowdSpawnRelativeActor : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdSpawnRelativeActor");
		return ptr;
	}

};


// Class GameFramework.GameDestinationConnRenderingComponent
// 0x0000 (0x0284 - 0x0284)
class UGameDestinationConnRenderingComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameDestinationConnRenderingComponent");
		return ptr;
	}

};


// Class GameFramework.GameExplosion
// 0x00E8 (0x0140 - 0x0058)
class UGameExplosion : public UObject
{
public:
	unsigned long                                      bDirectionalExplosion : 1;                                // 0x0058(0x0004)
	unsigned long                                      bIgnoreInstigator : 1;                                    // 0x0058(0x0004)
	unsigned long                                      bAllowTeammateCringes : 1;                                // 0x0058(0x0004)
	unsigned long                                      bFullDamageToAttachee : 1;                                // 0x0058(0x0004)
	unsigned long                                      bAttachExplosionEmitterToAttachee : 1;                    // 0x0058(0x0004)
	unsigned long                                      bPerformRadialBlurRelevanceCheck : 1;                     // 0x0058(0x0004)
	unsigned long                                      bCausesFracture : 1;                                      // 0x0058(0x0004)
	unsigned long                                      bAllowPerMaterialFX : 1;                                  // 0x0058(0x0004)
	unsigned long                                      bParticleSystemIsBeingOverriddenDontUsePhysMatVersion : 1;// 0x0058(0x0004)
	unsigned long                                      bSkipDefaultPhysMatParticleSystem : 1;                    // 0x0058(0x0004)
	unsigned long                                      bUseMapSpecificValues : 1;                                // 0x0058(0x0004)
	unsigned long                                      bUseOverlapCheck : 1;                                     // 0x0058(0x0004)
	unsigned long                                      bOrientCameraShakeTowardsEpicenter : 1;                   // 0x0058(0x0004)
	unsigned long                                      bAutoControllerVibration : 1;                             // 0x0058(0x0004)
	float                                              DirectionalExplosionAngleDeg;                             // 0x005C(0x0004)
	float                                              DamageDelay;                                              // 0x0060(0x0004)
	float                                              Damage;                                                   // 0x0064(0x0004)
	float                                              DamageRadius;                                             // 0x0068(0x0004)
	float                                              DamageFalloffExponent;                                    // 0x006C(0x0004)
	class AActor*                                      ActorToIgnoreForDamage;                                   // 0x0070(0x0008)
	class UClass*                                      ActorClassToIgnoreForDamage;                              // 0x0078(0x0008)
	class UClass*                                      ActorClassToIgnoreForKnockdownsAndCringes;                // 0x0080(0x0008)
	class UClass*                                      MyDamageType;                                             // 0x0088(0x0008)
	float                                              KnockDownRadius;                                          // 0x0090(0x0004)
	float                                              KnockDownStrength;                                        // 0x0094(0x0004)
	float                                              CringeRadius;                                             // 0x0098(0x0004)
	struct FVector2D                                   CringeDuration;                                           // 0x009C(0x0008)
	float                                              MomentumTransferScale;                                    // 0x00A4(0x0004)
	class UParticleSystem*                             ParticleEmitterTemplate;                                  // 0x00A8(0x0008)
	float                                              ExplosionEmitterScale;                                    // 0x00B0(0x0004)
	class AActor*                                      HitActor;                                                 // 0x00B4(0x0008)
	struct FVector                                     HitLocation;                                              // 0x00BC(0x000C)
	struct FVector                                     HitNormal;                                                // 0x00C8(0x000C)
	class USoundCue*                                   ExplosionSound;                                           // 0x00D4(0x0008)
	class USoundCue*                                   ExplosionSoundHurtSomeone;                                // 0x00DC(0x0008)
	class UPointLightComponent*                        ExploLight;                                               // 0x00E4(0x0008)
	float                                              ExploLightFadeOutTime;                                    // 0x00EC(0x0004)
	class URadialBlurComponent*                        ExploRadialBlur;                                          // 0x00F0(0x0008)
	float                                              ExploRadialBlurFadeOutTime;                               // 0x00F8(0x0004)
	float                                              ExploRadialBlurMaxBlur;                                   // 0x00FC(0x0004)
	float                                              FractureMeshRadius;                                       // 0x0100(0x0004)
	float                                              FracturePartVel;                                          // 0x0104(0x0004)
	class UCameraShake*                                CamShake;                                                 // 0x0108(0x0008)
	class UCameraShake*                                CamShake_Left;                                            // 0x0110(0x0008)
	class UCameraShake*                                CamShake_Right;                                           // 0x0118(0x0008)
	class UCameraShake*                                CamShake_Rear;                                            // 0x0120(0x0008)
	float                                              CamShakeInnerRadius;                                      // 0x0128(0x0004)
	float                                              CamShakeOuterRadius;                                      // 0x012C(0x0004)
	float                                              CamShakeFalloff;                                          // 0x0130(0x0004)
	class UClass*                                      CameraLensEffect;                                         // 0x0134(0x0008)
	float                                              CameraLensEffectRadius;                                   // 0x013C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameExplosion");
		return ptr;
	}

};


// Class GameFramework.GameExplosionActor
// 0x0078 (0x02EC - 0x0274)
class AGameExplosionActor : public AActor
{
public:
	unsigned long                                      bHasExploded : 1;                                         // 0x0274(0x0004)
	unsigned long                                      bExplodeMoreThanOnce : 1;                                 // 0x0274(0x0004)
	unsigned long                                      bTrackExplosionParticleSystemLifespan : 1;                // 0x0274(0x0004)
	unsigned long                                      bDrawDebug : 1;                                           // 0x0274(0x0004)
	class UPointLightComponent*                        ExplosionLight;                                           // 0x0278(0x0008)
	class URadialBlurComponent*                        ExplosionRadialBlur;                                      // 0x0280(0x0008)
	float                                              LightFadeTime;                                            // 0x0288(0x0004)
	float                                              LightFadeTimeRemaining;                                   // 0x028C(0x0004)
	float                                              LightInitialBrightness;                                   // 0x0290(0x0004)
	float                                              RadialBlurFadeTime;                                       // 0x0294(0x0004)
	float                                              RadialBlurFadeTimeRemaining;                              // 0x0298(0x0004)
	float                                              RadialBlurMaxBlurAmount;                                  // 0x029C(0x0004)
	class UGameExplosion*                              ExplosionTemplate;                                        // 0x02A0(0x0008)
	class URB_RadialImpulseComponent*                  RadialImpulseComponent;                                   // 0x02A8(0x0008)
	class AController*                                 InstigatorController;                                     // 0x02B0(0x0008)
	class AActor*                                      HitActorFromPhysMaterialTrace;                            // 0x02B8(0x0008)
	struct FVector                                     HitLocationFromPhysMaterialTrace;                         // 0x02C0(0x000C)
	class AActor*                                      Attachee;                                                 // 0x02CC(0x0008)
	class AController*                                 AttacheeController;                                       // 0x02D4(0x0008)
	float                                              DirectionalExplosionMinDot;                               // 0x02DC(0x0004)
	struct FVector                                     ExplosionDirection;                                       // 0x02E0(0x000C) (GlobalConfig, AlwaysInit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameExplosionActor");
		return ptr;
	}


	void STATIC_ChooseCameraShake();
	void STATIC_SpawnCameraLensEffects();
	void STATIC_DoExplosionCameraEffects();
	void DrawDebug();
	void STATIC_DelayedExplosionDamage();
	void Explode();
	void STATIC_SpawnExplosionFogVolume();
	void STATIC_SpawnExplosionDecal();
	void STATIC_SpawnExplosionParticleSystem();
	void STATIC_UpdateExplosionTemplateWithPerMaterialFX();
	void STATIC_SpecialCringeEffectsFor();
	void STATIC_SpecialPawnEffectsFor();
	void STATIC_GetEffectCheckRadius();
	void STATIC_DoExplosionDamage();
	void STATIC_BoxDistanceToPoint();
	void STATIC_IsBehindExplosion();
	void STATIC_DoFullDamageToActor();
	void STATIC_GetPhysicalMaterial();
	void PreBeginPlay();
};


// Class GameFramework.GamePawn
// 0x0004 (0x058C - 0x0588)
class AGamePawn : public APawn
{
public:
	unsigned long                                      bLastHitWasHeadShot : 1;                                  // 0x0588(0x0004) (EditConst, AlwaysInit, DuplicateTransient)
	unsigned long                                      bRespondToExplosions : 1;                                 // 0x0588(0x0004)

	static UClass* StaticClass()
	{
