#pragma once

// Lost Ark (1.12.11.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "LA_GameFramework_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GameFramework.DynamicSpriteComponent
// 0x004C (0x02F8 - 0x02AC)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                            // 0x02AC(0x0014) (Edit, NeedCtorLink)
	struct FInterpCurveLinearColor                     AnimatedColor;                                            // 0x02C0(0x0014) (Edit, NeedCtorLink)
	struct FInterpCurveVector2D                        AnimatedPosition;                                         // 0x02D4(0x0014) (Edit, NeedCtorLink)
	struct FVector                                     LocationOffset;                                           // 0x02E8(0x000C) (Edit)
	int                                                LoopCount;                                                // 0x02F4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		return ptr;
	}

};


// Class GameFramework.FrameworkGame
// 0x0010 (0x04D0 - 0x04C0)
class AFrameworkGame : public AGameInfo
{
public:
	TArray<struct FRequiredMobileInputConfig>          RequiredMobileInputConfigs;                               // 0x04C0(0x0010) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.FrameworkGame");
		return ptr;
	}

};


// Class GameFramework.GameAIController
// 0x004C (0x04D0 - 0x0484)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                              // 0x0484(0x0008) (Edit, Const, Transient, EditInline)
	unsigned long                                      bHasRunawayCommandList : 1;                               // 0x048C(0x0004) (Transient)
	unsigned long                                      bAILogging : 1;                                           // 0x048C(0x0004) (Edit, Config)
	unsigned long                                      bAILogToWindow : 1;                                       // 0x048C(0x0004) (Edit, Config)
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x048C(0x0004) (Edit, Config)
	unsigned long                                      bMapBasedLogName : 1;                                     // 0x048C(0x0004) (Edit, Config)
	unsigned long                                      bAIDrawDebug : 1;                                         // 0x048C(0x0004) (Edit, Config)
	unsigned long                                      bAIBroken : 1;                                            // 0x048C(0x0004) (Transient)
	class AFileLog*                                    AILogFile;                                                // 0x0490(0x0008) (Transient)
	float                                              DebugTextMaxLen;                                          // 0x0498(0x0004) (Edit)
	TArray<struct FAICmdHistoryItem>                   CommandHistory;                                           // 0x049C(0x0010) (Edit, Const, Transient, NeedCtorLink)
	int                                                CommandHistoryNum;                                        // 0x04AC(0x0004) (Edit, Config)
	TArray<struct FName>                               AILogFilter;                                              // 0x04B0(0x0010) (Edit, Config, NeedCtorLink)
	struct FString                                     DemoActionString;                                         // 0x04C0(0x0010) (Net, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAIController");
		return ptr;
	}


	struct FString GetActionString();
	void SetDesiredRotation(const struct FRotator& TargetDesiredRotation, bool InLockDesiredRotation, bool InUnlockWhenReached, float InterpolationTime);
	void AILog_Internal(const struct FString& LogText, const struct FName& LogCategory, bool bForce);
	void RecordDemoAILog(const struct FString& LogText);
	void Destroyed();
	void ReachedIntermediateMoveGoal();
	void ReachedMoveGoal();
	float GetDestinationOffset();
	class UGameAICommand* GetAICommandInStack(class UClass* InClass);
	class UGameAICommand* FindCommandOfClass(class UClass* SearchClass);
	void DumpCommandStack();
	void CheckCommandCount();
	class UGameAICommand* GetActiveCommand();
	bool AbortCommand(class UGameAICommand* AbortCmd, class UClass* AbortClass);
	void PopCommand(class UGameAICommand* ToBePoppedCommand);
	void PushCommand(class UGameAICommand* NewCommand);
	void AllCommands(class UClass* BaseClass, class UGameAICommand** Cmd);
};


// Class GameFramework.GameAICommand
// 0x0024 (0x007C - 0x0058)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                             // 0x0058(0x0008) (Edit, Const, Transient, EditInline)
	struct FName                                       ChildStatus;                                              // 0x0060(0x0008) (Edit, Const, Transient)
	class AGameAIController*                           GameAIOwner;                                              // 0x0068(0x0008) (Edit, Transient)
	struct FName                                       Status;                                                   // 0x0070(0x0008) (Edit, Transient)
	unsigned long                                      bAllowNewSameClassInstance : 1;                           // 0x0078(0x0004)
	unsigned long                                      bReplaceActiveSameClassInstance : 1;                      // 0x0078(0x0004)
	unsigned long                                      bAborted : 1;                                             // 0x0078(0x0004) (Transient)
	unsigned long                                      bIgnoreNotifies : 1;                                      // 0x0078(0x0004)
	unsigned long                                      bIgnoreStepAside : 1;                                     // 0x0078(0x0004)
	unsigned long                                      bPendingPop : 1;                                          // 0x0078(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICommand");
		return ptr;
	}


	bool HandlePathObstruction(class AActor* BlockedBy);
	bool MoveUnreachable(const struct FVector& AttemptedDest, class AActor* AttemptedTarget);
	void NotifyNeedRepath();
	struct FString GetDebugVerboseText();
	void GetDebugOverheadText(class APlayerController* PC, TArray<struct FString>* OutText);
	void DrawDebug(class AHUD* H, const struct FName& Category);
	struct FString GetDumpString();
	void Resumed(const struct FName& OldCommandName);
	void Paused(class UGameAICommand* NewCommand);
	void Popped();
	void Pushed();
	void PostPopped();
	void PrePushed(class AGameAIController* AI);
	bool AllowStateTransitionTo(const struct FName& StateName);
	bool AllowTransitionTo(class UClass* AttemptCommand);
	void Tick(float DeltaTime);
	bool ShouldIgnoreNotifies();
	void InternalTick(float DeltaTime);
	void InternalResumed(const struct FName& OldCommandName);
	void InternalPaused(class UGameAICommand* NewCommand);
	void InternalPopped();
	void InternalPushed();
	void InternalPrePushed(class AGameAIController* AI);
	bool STATIC_InitCommand(class AGameAIController* AI);
	bool STATIC_InitCommandUserActor(class AGameAIController* AI, class AActor* UserActor);
};


// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x02B4 - 0x02B4)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		return ptr;
	}

};


// Class GameFramework.GamePlayerController
// 0x0010 (0x0790 - 0x0780)
class AGamePlayerController : public APlayerController
{
public:
	unsigned long                                      bWarnCrowdMembers : 1;                                    // 0x0780(0x0004)
	unsigned long                                      bDebugCrowdAwareness : 1;                                 // 0x0780(0x0004) (Edit)
	unsigned long                                      bIsWarmupPaused : 1;                                      // 0x0780(0x0004) (Transient)
	float                                              AgentAwareRadius;                                         // 0x0784(0x0004)
	struct FName                                       CurrentSoundMode;                                         // 0x0788(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GamePlayerController");
		return ptr;
	}


	void ClientColorFade(const struct FColor& FadeColor, unsigned char FromAlpha, unsigned char ToAlpha, float FadeTime);
	void WarmupPause(bool bDesiredPauseState);
	bool CanUnpauseWarmup();
	void GetCurrentMovie(struct FString* MovieName);
	void ClientStopMovie(float DelayInSeconds, bool bAllowMovieToFinish, bool bForceStopNonSkippable, bool bForceStopLoadingMovie);
	void ClientPlayMovie(const struct FString& MovieName, int InStartOfRenderingMovieFrame, int InEndOfRenderingMovieFrame, bool bRestrictPausing, bool bPlayOnceFromStream, bool bOnlyBackButtonSkipsMovie);
	void STATIC_KeepPlayingLoadingMovie();
	void STATIC_ShowLoadingMovie(bool bShowMovie, bool bPauseAfterHide, float PauseDuration, float KeepPlayingDuration, bool bOverridePreviousDelays);
	void SetSoundMode(const struct FName& InSoundModeName);
	void DoForceFeedbackForScreenShake(class UCameraShake* ShakeData, float Scale);
	void NotifyCrowdAgentInRadius(class AGameCrowdAgent* Agent);
	void NotifyCrowdAgentRefresh();
	void CrowdDebug(bool bEnabled);
	int GetUIPlayerIndex();
	void OnToggleMouseCursor(class USeqAct_ToggleMouseCursor* inAction);
};


// Class GameFramework.GameCheatManager
// 0x0020 (0x0098 - 0x0078)
class UGameCheatManager : public UCheatManager
{
public:
	class ADebugCameraController*                      DebugCameraControllerRef;                                 // 0x0078(0x0008)
	class UClass*                                      DebugCameraControllerClass;                               // 0x0080(0x0008)
	struct FString                                     DebugCameraControllerClassName;                           // 0x0088(0x0010) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCheatManager");
		return ptr;
	}


	void EnableDebugCamera(bool bEnableDebugText);
	void TeleportPawnToCamera(bool bToggleDebugCameraOff);
	void ToggleDebugCamera(bool bDrawDebugText);
	void PatchDebugCameraController();
};


// Class GameFramework.GameCrowdAgent
// 0x0278 (0x04F4 - 0x027C)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	struct FPointer                                    VfTable_IInterface_RVO;                                   // 0x027C(0x0008) (Const, Native, NoExport)
	class UGameCrowdGroup*                             MyGroup;                                                  // 0x0284(0x0008)
	struct FVector                                     PreferredVelocity;                                        // 0x028C(0x000C)
	struct FVector                                     PendingVelocity;                                          // 0x0298(0x000C)
	class AGameCrowdDestination*                       CurrentDestination;                                       // 0x02A4(0x0008)
	class AGameCrowdDestination*                       BehaviorDestination;                                      // 0x02AC(0x0008)
	class AGameCrowdDestination*                       PreviousDestination;                                      // 0x02B4(0x0008)
	float                                              InterpZTranslation;                                       // 0x02BC(0x0004)
	int                                                Health;                                                   // 0x02C0(0x0004) (Edit)
	float                                              DeadBodyDuration;                                         // 0x02C4(0x0004) (Edit)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x02C8(0x0008) (Const, ExportObject, EditConst, Component, EditInline)
	int                                                ConformTraceFrameCount;                                   // 0x02D0(0x0004) (Transient)
	TArray<struct FNearbyDynamicItem>                  NearbyDynamics;                                           // 0x02D4(0x0010) (Transient, NeedCtorLink)
	unsigned long                                      bUniformScale : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bCheckForObstacles : 1;                                   // 0x02E4(0x0004) (Edit)
	unsigned long                                      bUseNavMeshPathing : 1;                                   // 0x02E4(0x0004) (Edit)
	unsigned long                                      bWantsSeePlayerNotification : 1;                          // 0x02E4(0x0004)
	unsigned long                                      bAllowPitching : 1;                                       // 0x02E4(0x0004) (Edit)
	unsigned long                                      bHitObstacle : 1;                                         // 0x02E4(0x0004)
	unsigned long                                      bBadHitNormal : 1;                                        // 0x02E4(0x0004)
	unsigned long                                      bSimulateThisTick : 1;                                    // 0x02E4(0x0004)
	unsigned long                                      bPotentialEncounter : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsPanicked : 1;                                          // 0x02E4(0x0004)
	unsigned long                                      bWantsGroupIdle : 1;                                      // 0x02E4(0x0004)
	unsigned long                                      bPreferVisibleDestination : 1;                            // 0x02E4(0x0004) (Edit)
	unsigned long                                      bPreferVisibleDestinationOnSpawn : 1;                     // 0x02E4(0x0004) (Edit)
	unsigned long                                      bHasNotifiedSpawner : 1;                                  // 0x02E4(0x0004)
	unsigned long                                      bIsInSpawnPool : 1;                                       // 0x02E4(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x02E4(0x0004) (Edit)
	TEnumAsByte<EConformType>                          ConformType;                                              // 0x02E8(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02E9(0x0003) MISSED OFFSET
	float                                              ConformTraceDist;                                         // 0x02EC(0x0004) (Edit)
	int                                                ConformTraceInterval;                                     // 0x02F0(0x0004) (Edit)
	int                                                CurrentConformTraceInterval;                              // 0x02F4(0x0004)
	float                                              LastGroundZ;                                              // 0x02F8(0x0004)
	float                                              AwareRadius;                                              // 0x02FC(0x0004) (Edit)
	float                                              AvoidOtherRadius;                                         // 0x0300(0x0004) (Edit)
	TArray<struct FAvoidOtherSampleItem>               AvoidOtherSampleList;                                     // 0x0304(0x0010) (Edit, NeedCtorLink)
	float                                              PENALTY_COEFF_ANGLETOGOAL;                                // 0x0314(0x0004) (Edit)
	float                                              PENALTY_COEFF_ANGLETOVEL;                                 // 0x0318(0x0004) (Edit)
	float                                              PENALTY_COEFF_MAG;                                        // 0x031C(0x0004) (Edit)
	float                                              MIN_PENALTY_THRESHOLD;                                    // 0x0320(0x0004) (Edit)
	float                                              LastProgressTime;                                         // 0x0324(0x0004) (Edit)
	float                                              LastFallbackActiveTime;                                   // 0x0328(0x0004) (Edit)
	float                                              MaxPathLaneValue;                                         // 0x032C(0x0004) (Edit)
	float                                              CurrentPathLaneValue;                                     // 0x0330(0x0004) (Edit)
	int                                                ExtraPathCost;                                            // 0x0334(0x0004) (Edit)
	float                                              RotateToTargetSpeed;                                      // 0x0338(0x0004) (Edit)
	float                                              MaxYawRate;                                               // 0x033C(0x0004) (Edit)
	struct FVector                                     MeshMinScale3D;                                           // 0x0340(0x000C) (Edit)
	struct FVector                                     MeshMaxScale3D;                                           // 0x034C(0x000C) (Edit)
	float                                              EyeZOffset;                                               // 0x0358(0x0004)
	float                                              ProximityLODDist;                                         // 0x035C(0x0004) (Edit)
	float                                              VisibleProximityLODDist;                                  // 0x0360(0x0004) (Edit)
	struct FVector                                     LastKnownGoodPosition;                                    // 0x0364(0x000C)
	float                                              GroundOffset;                                             // 0x0370(0x0004) (Edit)
	struct FVector                                     IntermediatePoint;                                        // 0x0374(0x000C)
	struct FVector                                     SearchExtent;                                             // 0x0380(0x000C)
	class UClass*                                      NavigationHandleClass;                                    // 0x038C(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0394(0x0008)
	int                                                ObstacleCheckCount;                                       // 0x039C(0x0004)
	float                                              WalkableFloorZ;                                           // 0x03A0(0x0004)
	float                                              LastPathingAttempt;                                       // 0x03A4(0x0004)
	float                                              LastUpdateTime;                                           // 0x03A8(0x0004)
	float                                              NotVisibleLifeSpan;                                       // 0x03AC(0x0004) (Edit)
	class AGameCrowdAgent*                             MyArchetype;                                              // 0x03B0(0x0008)
	float                                              MaxWalkingSpeed;                                          // 0x03B8(0x0004) (Edit)
	float                                              MaxRunningSpeed;                                          // 0x03BC(0x0004) (Edit)
	float                                              MaxSpeed;                                                 // 0x03C0(0x0004)
	TArray<struct FRecentInteraction>                  RecentInteractions;                                       // 0x03C4(0x0010) (NeedCtorLink)
	float                                              BeaconMaxDist;                                            // 0x03D4(0x0004)
	struct FVector                                     BeaconOffset;                                             // 0x03D8(0x000C)
	class UTexture2D*                                  BeaconTexture;                                            // 0x03E4(0x0008) (Const)
	struct FLinearColor                                BeaconColor;                                              // 0x03EC(0x0010) (Const)
	class USoundCue*                                   AmbientSoundCue;                                          // 0x03FC(0x0008) (Edit)
	class UAudioComponent*                             AmbientSoundComponent;                                    // 0x0404(0x0008) (ExportObject, Component, EditInline)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                                          // 0x040C(0x0008)
	float                                              CurrentBehaviorActivationTime;                            // 0x0414(0x0004)
	TArray<struct FBehaviorEntry>                      EncounterAgentBehaviors;                                  // 0x0418(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      SeePlayerBehaviors;                                       // 0x0428(0x0010) (Edit, NeedCtorLink)
	float                                              MaxSeePlayerDistSq;                                       // 0x0438(0x0004)
	float                                              SeePlayerInterval;                                        // 0x043C(0x0004) (Edit)
	TArray<struct FBehaviorEntry>                      SpawnBehaviors;                                           // 0x0440(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      UneasyBehaviors;                                          // 0x0450(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      AlertBehaviors;                                           // 0x0460(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      PanicBehaviors;                                           // 0x0470(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      RandomBehaviors;                                          // 0x0480(0x0010) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      TakeDamageBehaviors;                                      // 0x0490(0x0010) (Edit, NeedCtorLink)
	float                                              RandomBehaviorInterval;                                   // 0x04A0(0x0004) (Edit)
	float                                              ForceUpdateTime;                                          // 0x04A4(0x0004)
	float                                              ReachThreshold;                                           // 0x04A8(0x0004)
	TArray<struct FBehaviorEntry>                      GroupWaitingBehaviors;                                    // 0x04AC(0x0010) (Edit, NeedCtorLink)
	float                                              DesiredGroupRadius;                                       // 0x04BC(0x0004) (Edit)
	float                                              DesiredGroupRadiusSq;                                     // 0x04C0(0x0004)
	float                                              MaxLOSLifeDistanceSq;                                     // 0x04C4(0x0004)
	TScriptInterface<class UGameCrowdSpawnerInterface> MySpawner;                                                // 0x04C8(0x0010)
	struct FVector                                     SpawnOffset;                                              // 0x04D8(0x000C)
	float                                              InitialLastRenderTime;                                    // 0x04E4(0x0004)
	struct FColor                                      DebugAgentColor;                                          // 0x04E8(0x0004) (Edit)
	class AGameCrowdDestination*                       DebugSpawnDest;                                           // 0x04EC(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		return ptr;
	}


	void InitDebugColor();
	struct FString GetBehaviorString();
	struct FString GetDestString();
	void PostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	struct FVector GeneratePathToActor(class AActor* Goal, float WithinDistance, bool bAllowPartialPath);
	void InitNavigationHandle();
	void OverlappedActorEvent(class AActor* A);
	void TakeDamage(int DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void FireDeathEvent();
	void PlayDeath(const struct FVector& KillMomentum);
	void UpdateIntermediatePoint(class AActor* DestinationActor);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	bool IsIdle();
	void SetCurrentBehavior(class UGameCrowdAgentBehavior* BehaviorArchetype);
	void StopBehavior();
	void HandleBehaviorEvent(TEnumAsByte<ECrowdBehaviorEvent> EventType, class AActor* InInstigator, bool bViralCause, bool bPropagateViralFlag);
	void ActivateInstancedBehavior(class UGameCrowdAgentBehavior* NewBehaviorObject);
	void ActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* LookAtActor);
	void ResetSeePlayer();
	void TryRandomBehavior();
	void NotifySeePlayer(class APlayerController* PC);
	void PlaySpawnBehavior();
	void HandlePotentialAgentEncounter();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void InitializeAgent(class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, float AgentWarmupTime, bool bWarmupPosition, bool bCheckWarmupVisibility, TArray<struct FCrowdSpawnerPlayerInfo>* PlayerInfo);
	struct FVector GetAttemptedSpawnLocation(float Pct, const struct FVector& CurPos, float CurRadius, const struct FVector& DestPos, float DestRadius);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void Destroyed();
	void ResetPooledAgent();
	void KillAgent();
	void PostBeginPlay();
	void SetMaxSpeed();
	void SetCurrentDestination(class AGameCrowdDestination* NewDest);
	void WaitForGroupMembers();
	bool PickBehaviorFrom(TArray<struct FBehaviorEntry> BehaviorList, const struct FVector& BestCameraLoc);
	bool IsPanicked();
	void FellOutOfWorld(class UClass* dmgType);
	struct FVector GetCollisionExtent();
};


// Class GameFramework.GameCrowdAgentSkeletal
// 0x00B4 (0x05A8 - 0x04F4)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x04F4(0x0008) (Edit, ExportObject, Component, EditInline)
	class UAnimNodeBlend*                              SpeedBlendNode;                                           // 0x04FC(0x0008)
	class UAnimNodeSlot*                               FullBodySlot;                                             // 0x0504(0x0008)
	class UAnimNodeSequence*                           ActionSeqNode;                                            // 0x050C(0x0008)
	class UAnimNodeSequence*                           WalkSeqNode;                                              // 0x0514(0x0008)
	class UAnimNodeSequence*                           RunSeqNode;                                               // 0x051C(0x0008)
	class UAnimTree*                                   AgentTree;                                                // 0x0524(0x0008)
	TArray<struct FName>                               WalkAnimNames;                                            // 0x052C(0x0010) (Edit, NeedCtorLink)
	TArray<struct FName>                               RunAnimNames;                                             // 0x053C(0x0010) (Edit, NeedCtorLink)
	TArray<struct FName>                               IdleAnimNames;                                            // 0x054C(0x0010) (Edit, NeedCtorLink)
	TArray<struct FName>                               DeathAnimNames;                                           // 0x055C(0x0010) (Edit, NeedCtorLink)
	float                                              SpeedBlendStart;                                          // 0x056C(0x0004) (Edit)
	float                                              SpeedBlendEnd;                                            // 0x0570(0x0004) (Edit)
	float                                              AnimVelRate;                                              // 0x0574(0x0004) (Edit)
	float                                              MaxSpeedBlendChangeSpeed;                                 // 0x0578(0x0004) (Edit)
	struct FName                                       MoveSyncGroupName;                                        // 0x057C(0x0008) (Edit)
	TArray<struct FGameCrowdAttachmentList>            Attachments;                                              // 0x0584(0x0010) (Edit, NeedCtorLink)
	float                                              MaxTargetAcquireTime;                                     // 0x0594(0x0004) (Edit)
	unsigned long                                      bUseRootMotionVelocity : 1;                               // 0x0598(0x0004) (Edit)
	unsigned long                                      bAllowSkeletonUpdateChangeBasedOnTickResult : 1;          // 0x0598(0x0004) (Edit)
	unsigned long                                      bTickWhenNotVisible : 1;                                  // 0x0598(0x0004) (Edit)
	unsigned long                                      bIsPlayingIdleAnimation : 1;                              // 0x0598(0x0004)
	unsigned long                                      bIsPlayingDeathAnimation : 1;                             // 0x0598(0x0004)
	unsigned long                                      bIsPlayingImportantAnimation : 1;                         // 0x0598(0x0004)
	unsigned long                                      bAnimateThisTick : 1;                                     // 0x0598(0x0004)
	float                                              NotVisibleDisableTickTime;                                // 0x059C(0x0004) (Edit)
	float                                              MaxAnimationDistance;                                     // 0x05A0(0x0004) (Edit)
	float                                              MaxAnimationDistanceSq;                                   // 0x05A4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		return ptr;
	}


	void CreateAttachments();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void ClearLatentAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void SetRootMotion(bool bRootMotionEnabled);
	void PlayDeath(const struct FVector& KillMomentum);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentSM
// 0x0010 (0x0504 - 0x04F4)
class AGameCrowdAgentSM : public AGameCrowdAgent
{
public:
	class UStaticMeshComponent*                        Mesh;                                                     // 0x04F4(0x0008) (Edit, ExportObject, Component, EditInline)
	class UMaterialInstanceConstant*                   MeshColor;                                                // 0x04FC(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSM");
		return ptr;
	}


	void StopBehavior();
	void ActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* LookAtActor);
	void ChangeDebugColor(const struct FColor& InC);
	void InitDebugColor();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentBehavior
// 0x003C (0x0094 - 0x0058)
class UGameCrowdAgentBehavior : public UObject
{
public:
	TEnumAsByte<ECrowdBehaviorEvent>                   MyEventType;                                              // 0x0058(0x0001)
	TEnumAsByte<ECrowdBehaviorEvent>                   ViralBehaviorEvent;                                       // 0x0059(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x005A(0x0002) MISSED OFFSET
	float                                              DurationOfBehavior;                                       // 0x005C(0x0004) (Edit)
	float                                              TimeUntilStopBehavior;                                    // 0x0060(0x0004)
	unsigned long                                      bIdleBehavior : 1;                                        // 0x0064(0x0004) (Edit)
	unsigned long                                      bFaceActionTargetFirst : 1;                               // 0x0064(0x0004) (Edit)
	unsigned long                                      bIsViralBehavior : 1;                                     // 0x0064(0x0004) (Edit)
	unsigned long                                      bPassOnIsViralBehaviorFlag : 1;                           // 0x0064(0x0004) (Edit)
	class AActor*                                      ActionTarget;                                             // 0x0068(0x0008)
	float                                              MaxPlayerDistance;                                        // 0x0070(0x0004) (Edit)
	float                                              ViralRadius;                                              // 0x0074(0x0004) (Edit)
	float                                              DurationBeforeBecomesViral;                               // 0x0078(0x0004) (Edit)
	float                                              TimeToBecomeViral;                                        // 0x007C(0x0004) (Transient)
	float                                              DurationOfViralBehaviorPropagation;                       // 0x0080(0x0004) (Edit)
	float                                              TimeToStopPropagatingViralBehavior;                       // 0x0084(0x0004) (Transient)
	class AGameCrowdAgent*                             MyAgent;                                                  // 0x0088(0x0008)
	struct FColor                                      DebugBehaviorColor;                                       // 0x0090(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		return ptr;
	}


	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void PropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	class AActor* GetBehaviorInstigator();
	void ActivatedBy(class AActor* NewActionTarget);
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	struct FString GetBehaviorString();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	bool HandleMovement();
	void FinishedTargetRotation();
	bool CanBeUsedBy(class AGameCrowdAgent* Agent, const struct FVector& CameraLoc);
	void Tick(float DeltaTime);
	bool ShouldEndIdle();
	class AGameCrowdBehaviorPoint* STATIC_TriggerCrowdBehavior(TEnumAsByte<ECrowdBehaviorEvent> EventType, class AActor* Instigator, const struct FVector& AtLocation, float InRange, float InDuration, class AActor* BaseActor, bool bRequireLOS);
};


// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x0038 (0x00CC - 0x0094)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray<struct FName>                               AnimationList;                                            // 0x0094(0x0010) (Edit, NeedCtorLink)
	float                                              BlendInTime;                                              // 0x00A4(0x0004) (Edit)
	float                                              BlendOutTime;                                             // 0x00A8(0x0004) (Edit)
	unsigned long                                      bUseRootMotion : 1;                                       // 0x00AC(0x0004) (Edit)
	unsigned long                                      bLookAtPlayer : 1;                                        // 0x00AC(0x0004) (Edit)
	unsigned long                                      bLooping : 1;                                             // 0x00AC(0x0004) (Edit)
	unsigned long                                      bBlendBetweenAnims : 1;                                   // 0x00AC(0x0004) (Edit)
	class AActor*                                      CustomActionTarget;                                       // 0x00B0(0x0008)
	int                                                LoopIndex;                                                // 0x00B8(0x0004) (Edit)
	float                                              LoopTime;                                                 // 0x00BC(0x0004) (Edit)
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                             // 0x00C0(0x0008)
	int                                                AnimationIndex;                                           // 0x00C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		return ptr;
	}


	struct FString GetBehaviorString();
	void StopBehavior();
	void PlayAgentAnimationNow();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void SetSequenceOutput();
	void FinishedTargetRotation();
	void InitBehavior(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0008 (0x009C - 0x0094)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                               // 0x0094(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		return ptr;
	}


	struct FString GetBehaviorString();
	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	class AActor* GetBehaviorInstigator();
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	void ActivatedBy(class AActor* NewActionTarget);
};


// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x0094 - 0x0094)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		return ptr;
	}


	void StopBehavior();
	bool ShouldEndIdle();
	struct FString GetBehaviorString();
	void InitBehavior(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x000C (0x00A0 - 0x0094)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	unsigned long                                      bStoppingBehavior : 1;                                    // 0x0094(0x0004)
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                            // 0x0098(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		return ptr;
	}


	void StopBehavior();
	bool ShouldEndIdle();
	struct FString GetBehaviorString();
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	bool HandleMovement();
};


// Class GameFramework.GameCrowdGroup
// 0x0010 (0x0068 - 0x0058)
class UGameCrowdGroup : public UObject
{
public:
	TArray<class AGameCrowdAgent*>                     Members;                                                  // 0x0058(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		return ptr;
	}


	void UpdateDestinations(class AGameCrowdDestination* NewDestination);
	void RemoveMember(class AGameCrowdAgent* Agent);
	void AddMember(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdInfoVolume
// 0x0010 (0x02C0 - 0x02B0)
class AGameCrowdInfoVolume : public AVolume
{
public:
	TArray<class AGameCrowdDestination*>               PotentialSpawnPoints;                                     // 0x02B0(0x0010) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInfoVolume");
		return ptr;
	}


	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};


// Class GameFramework.GameCrowdInteractionPoint
// 0x000C (0x0280 - 0x0274)
class AGameCrowdInteractionPoint : public AActor
{
public:
	unsigned long                                      bIsEnabled : 1;                                           // 0x0274(0x0004) (Edit, Net)
	class UCylinderComponent*                          CylinderComponent;                                        // 0x0278(0x0008) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class GameFramework.GameCrowdBehaviorPoint
// 0x0018 (0x0298 - 0x0280)
class AGameCrowdBehaviorPoint : public AGameCrowdInteractionPoint
{
public:
	float                                              RadiusOfBehaviorEvent;                                    // 0x0280(0x0004) (Config)
	float                                              DurationOfBehaviorEvent;                                  // 0x0284(0x0004) (Config)
	TEnumAsByte<ECrowdBehaviorEvent>                   EventType;                                                // 0x0288(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	unsigned long                                      bRequireLOS : 1;                                          // 0x028C(0x0004) (Edit)
	class AActor*                                      Initiator;                                                // 0x0290(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehaviorPoint");
		return ptr;
	}


	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void DestroySelf();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdDestination
// 0x00A8 (0x0328 - 0x0280)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x0280(0x0008) (Const, Native, NoExport)
	unsigned long                                      bKillWhenReached : 1;                                     // 0x0288(0x0004) (Edit)
	unsigned long                                      bAllowAsPreviousDestination : 1;                          // 0x0288(0x0004) (Edit)
	unsigned long                                      bAvoidWhenPanicked : 1;                                   // 0x0288(0x0004) (Edit)
	unsigned long                                      bSkipBehaviorIfPanicked : 1;                              // 0x0288(0x0004) (Edit)
	unsigned long                                      bFleeDestination : 1;                                     // 0x0288(0x0004) (Edit)
	unsigned long                                      bMustReachExactly : 1;                                    // 0x0288(0x0004) (Edit)
	unsigned long                                      bHasRestrictions : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bAllowsSpawning : 1;                                      // 0x0288(0x0004) (Edit)
	unsigned long                                      bAllowCloudSpawning : 1;                                  // 0x0288(0x0004) (Edit)
	unsigned long                                      bAllowVisibleSpawning : 1;                                // 0x0288(0x0004) (Edit)
	unsigned long                                      bLineSpawner : 1;                                         // 0x0288(0x0004) (Edit)
	unsigned long                                      bSpawnAtEdge : 1;                                         // 0x0288(0x0004) (Edit)
	unsigned long                                      bSoftPerimeter : 1;                                       // 0x0288(0x0004) (Edit)
	unsigned long                                      bIsVisible : 1;                                           // 0x0288(0x0004)
	unsigned long                                      bWillBeVisible : 1;                                       // 0x0288(0x0004)
	unsigned long                                      bCanSpawnHereNow : 1;                                     // 0x0288(0x0004)
	unsigned long                                      bIsBeyondSpawnDistance : 1;                               // 0x0288(0x0004)
	unsigned long                                      bAdjacentToVisibleNode : 1;                               // 0x0288(0x0004)
	unsigned long                                      bHasNavigationMesh : 1;                                   // 0x0288(0x0004)
	TArray<class AGameCrowdDestination*>               NextDestinations;                                         // 0x028C(0x0010) (Edit, DuplicateTransient, NeedCtorLink)
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                                // 0x029C(0x0008) (Edit, DuplicateTransient)
	int                                                Capacity;                                                 // 0x02A4(0x0004) (Edit)
	float                                              Frequency;                                                // 0x02A8(0x0004) (Edit)
	int                                                CustomerCount;                                            // 0x02AC(0x0004)
	TArray<class UClass*>                              SupportedAgentClasses;                                    // 0x02B0(0x0010) (Edit, NeedCtorLink)
	TArray<class UObject*>                             SupportedArchetypes;                                      // 0x02C0(0x0010) (Edit, NeedCtorLink)
	TArray<class UClass*>                              RestrictedAgentClasses;                                   // 0x02D0(0x0010) (Edit, NeedCtorLink)
	TArray<class UObject*>                             RestrictedArchetypes;                                     // 0x02E0(0x0010) (Edit, NeedCtorLink)
	float                                              ExactReachTolerance;                                      // 0x02F0(0x0004)
	struct FName                                       InteractionTag;                                           // 0x02F4(0x0008) (Edit)
	float                                              InteractionDelay;                                         // 0x02FC(0x0004) (Edit)
	TArray<struct FBehaviorEntry>                      ReachedBehaviors;                                         // 0x0300(0x0010) (Edit, NeedCtorLink)
	class AGameCrowdAgent*                             AgentEnRoute;                                             // 0x0310(0x0008)
	float                                              Priority;                                                 // 0x0318(0x0004)
	float                                              LastSpawnTime;                                            // 0x031C(0x0004)
	class AGameCrowdPopulationManager*                 MyPopMgr;                                                 // 0x0320(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		return ptr;
	}


	void DrawDebug(bool bPresistent, TArray<struct FCrowdSpawnerPlayerInfo>* PlayerInfo);
	float GetDestinationRadius();
	void PrioritizeSpawnPoint(float MaxSpawnDist, TArray<struct FCrowdSpawnerPlayerInfo>* PlayerInfo);
	bool AnalyzeSpawnPoint(float MaxSpawnDistSq, bool bForceNavMeshPathing, class UNavigationHandle* NavHandle, TArray<struct FCrowdSpawnerPlayerInfo>* PlayerInfo);
	void GetSpawnPosition(class USeqAct_GameCrowdSpawner* Spawner, struct FVector* SpawnPos, struct FRotator* SpawnRot);
	float GetSpawnRadius();
	bool AllowableDestinationFor(class AGameCrowdAgent* Agent);
	bool AtCapacity(unsigned char CheckCnt);
	void IncrementCustomerCount(class AGameCrowdAgent* ArrivingAgent);
	void DecrementCustomerCount(class AGameCrowdAgent* DepartingAgent);
	void PickNewDestinationFor(class AGameCrowdAgent* Agent, bool bIgnoreRestrictions);
	void ReachedDestination(class AGameCrowdAgent* Agent);
	void Destroyed();
	void PostBeginPlay();
	bool ReachedByAgent(class AGameCrowdAgent* Agent, const struct FVector& TestPosition, bool bTestExactly);
};


// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x0030 (0x02B0 - 0x0280)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                                        // 0x0280(0x0008) (Edit)
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                                    // 0x0288(0x0008)
	class AGameCrowdAgent*                             QueuedAgent;                                              // 0x0290(0x0008)
	class AGameCrowdDestination*                       QueueDestination;                                         // 0x0298(0x0008) (Transient)
	unsigned long                                      bClearingQueue : 1;                                       // 0x02A0(0x0004)
	unsigned long                                      bPendingAdvance : 1;                                      // 0x02A0(0x0004)
	float                                              AverageReactionTime;                                      // 0x02A4(0x0004) (Edit)
	class UClass*                                      QueueBehaviorClass;                                       // 0x02A8(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		return ptr;
	}


	bool HasCustomer();
	void ClearQueue(class AGameCrowdAgent* OldCustomer);
	void AddCustomer(class AGameCrowdAgent* NewCustomer, class AGameCrowdInteractionPoint* PreviousPosition);
	void ActuallyAdvance();
	void AdvanceCustomerTo(class AGameCrowdInteractionPoint* FrontPosition);
	void ReachedDestination(class AGameCrowdAgent* Agent);
	bool HasSpace();
	bool QueueReachedBy(class AGameCrowdAgent* Agent, const struct FVector& TestPosition);
};


// Class GameFramework.GameCrowdPopulationManager
// 0x00FC (0x0370 - 0x0274)
class AGameCrowdPopulationManager : public ACrowdPopulationManagerBase
{
public:
	struct FPointer                                    VfTable_IInterface_NavigationHandle;                      // 0x0274(0x0008) (Const, Native, NoExport)
	struct FCrowdSpawnInfoItem                         CloudSpawnInfo;                                           // 0x027C(0x0090) (NeedCtorLink)
	TArray<struct FCrowdSpawnInfoItem>                 ScriptedSpawnInfo;                                        // 0x030C(0x0010) (NeedCtorLink)
	class AGameCrowdInfoVolume*                        ActiveCrowdInfoVolume;                                    // 0x031C(0x0008)
	TArray<class AGameCrowdDestination*>               GlobalPotentialSpawnPoints;                               // 0x0324(0x0010) (NeedCtorLink)
	float                                              SplitScreenNumReduction;                                  // 0x0334(0x0004)
	float                                              PlayerPositionPredictionTime;                             // 0x0338(0x0004)
	float                                              HeadVisibilityOffset;                                     // 0x033C(0x0004)
	class UClass*                                      NavigationHandleClass;                                    // 0x0340(0x0008)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0348(0x0008)
	class AGameCrowdAgent*                             QueryingAgent;                                            // 0x0350(0x0008)
	TArray<struct FCrowdSpawnerPlayerInfo>             PlayerInfo;                                               // 0x0358(0x0010) (NeedCtorLink)
	float                                              LastPlayerInfoUpdateTime;                                 // 0x0368(0x0004)
	unsigned long                                      bDebugSpawns : 1;                                         // 0x036C(0x0004) (Edit)
	unsigned long                                      bPauseCrowd : 1;                                          // 0x036C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		return ptr;
	}


	class AGameCrowdAgent* CreateNewAgent(class AGameCrowdDestination* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, struct FCrowdSpawnInfoItem* Item);
	bool Warmup(int WarmupNum, struct FCrowdSpawnInfoItem* Item);
	class AGameCrowdAgent* SpawnAgent(class AGameCrowdDestination* SpawnLoc, struct FCrowdSpawnInfoItem* Item);
	class AGameCrowdAgent* SpawnAgentByIdx(int SpawnerIdx, class AGameCrowdDestination* SpawnLoc);
	bool ValidateSpawnAt(class AGameCrowdDestination* Candidate, struct FCrowdSpawnInfoItem* Item);
	void AddPrioritizedSpawnPoint(class AGameCrowdDestination* GCD, struct FCrowdSpawnInfoItem* Item);
	void AnalyzeSpawnPoints(int StartIndex, int NumToUpdate, struct FCrowdSpawnInfoItem* Item);
	void PrioritizeSpawnPoints(float DeltaTime, struct FCrowdSpawnInfoItem* Item);
	bool STATIC_StaticGetPlayerInfo(TArray<struct FCrowdSpawnerPlayerInfo>* out_PlayerInfo);
	bool GetPlayerInfo();
	class AGameCrowdDestination* PickSpawnPoint(struct FCrowdSpawnInfoItem* Item);
	bool UpdateSpawner(float DeltaTime, struct FCrowdSpawnInfoItem* Item);
	void UpdateAllSpawners(float DeltaTime);
	void Tick(float DeltaTime);
	bool ShouldDebugDestinations();
	bool IsSpawningActive();
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void AgentDestroyed(class AGameCrowdAgent* Agent);
	void FlushAllAgents();
	void FlushAgents(const struct FCrowdSpawnInfoItem& Item);
	int CreateSpawner(class USeqAct_GameCrowdPopulationManagerToggle* inAction);
	void SetCrowdInfoVolume(class AGameCrowdInfoVolume* Vol);
	void RemoveSpawnPoint(class AGameCrowdDestination* GCD);
	void AddSpawnPoint(class AGameCrowdDestination* GCD);
	void NotifyPathChanged();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdReplicationActor
// 0x0010 (0x0284 - 0x0274)
class AGameCrowdReplicationActor : public AActor
{
public:
	class USeqAct_GameCrowdSpawner*                    Spawner;                                                  // 0x0274(0x0008) (Net)
	unsigned long                                      bSpawningActive : 1;                                      // 0x027C(0x0004) (Net)
	int                                                DestroyAllCount;                                          // 0x0280(0x0004) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdReplicationActor");
		return ptr;
	}


	void ReplicatedEvent(const struct FName& VarName);
};


// Class GameFramework.GameCrowdSpawnRelativeActor
// 0x0000 (0x0274 - 0x0274)
class AGameCrowdSpawnRelativeActor : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdSpawnRelativeActor");
		return ptr;
	}

};


// Class GameFramework.GameDestinationConnRenderingComponent
// 0x0000 (0x0284 - 0x0284)
class UGameDestinationConnRenderingComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameDestinationConnRenderingComponent");
		return ptr;
	}

};


// Class GameFramework.GameExplosion
// 0x00E8 (0x0140 - 0x0058)
class UGameExplosion : public UObject
{
public:
	unsigned long                                      bDirectionalExplosion : 1;                                // 0x0058(0x0004) (Edit)
	unsigned long                                      bIgnoreInstigator : 1;                                    // 0x0058(0x0004) (Transient)
	unsigned long                                      bAllowTeammateCringes : 1;                                // 0x0058(0x0004) (Edit)
	unsigned long                                      bFullDamageToAttachee : 1;                                // 0x0058(0x0004) (Transient)
	unsigned long                                      bAttachExplosionEmitterToAttachee : 1;                    // 0x0058(0x0004) (Edit)
	unsigned long                                      bPerformRadialBlurRelevanceCheck : 1;                     // 0x0058(0x0004) (Edit)
	unsigned long                                      bCausesFracture : 1;                                      // 0x0058(0x0004) (Edit)
	unsigned long                                      bAllowPerMaterialFX : 1;                                  // 0x0058(0x0004) (Edit)
	unsigned long                                      bParticleSystemIsBeingOverriddenDontUsePhysMatVersion : 1;// 0x0058(0x0004) (Edit)
	unsigned long                                      bSkipDefaultPhysMatParticleSystem : 1;                    // 0x0058(0x0004) (Edit)
	unsigned long                                      bUseMapSpecificValues : 1;                                // 0x0058(0x0004) (Edit)
	unsigned long                                      bUseOverlapCheck : 1;                                     // 0x0058(0x0004) (Edit)
	unsigned long                                      bOrientCameraShakeTowardsEpicenter : 1;                   // 0x0058(0x0004) (Edit)
	unsigned long                                      bAutoControllerVibration : 1;                             // 0x0058(0x0004) (Edit)
	float                                              DirectionalExplosionAngleDeg;                             // 0x005C(0x0004) (Edit)
	float                                              DamageDelay;                                              // 0x0060(0x0004) (Edit)
