#pragma once

// LostArk (0.0.01) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class EFGame.EFActionNotify_AnimEvent
// 0x001C (0x006C - 0x0050)
class UEFActionNotify_AnimEvent : public UObject
{
public:
	struct FString                                     Desc;                                                     // 0x0050(0x0010) (Edit, NeedCtorLink)
	unsigned long                                      IsActive : 1;                                             // 0x0060(0x0004) (Edit)
	float                                              StartTime;                                                // 0x0064(0x0004) (Edit)
	float                                              InterpTime;                                               // 0x0068(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_CancelParticles
// 0x0000 (0x006C - 0x006C)
class UEFActionNotify_AnimEvent_CancelParticles : public UEFActionNotify_AnimEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_CancelParticles");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor
// 0x0030 (0x009C - 0x006C)
class UEFActionNotify_AnimEvent_MaterialParamterLinearColor : public UEFActionNotify_AnimEvent
{
public:
	struct FString                                     ParamName;                                                // 0x006C(0x0010) (Edit, NeedCtorLink)
	struct FLinearColor                                StartValue;                                               // 0x007C(0x0010) (Edit)
	struct FLinearColor                                EndValue;                                                 // 0x008C(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterLinearColor");
		return ptr;
	}

};


// Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar
// 0x0018 (0x0084 - 0x006C)
class UEFActionNotify_AnimEvent_MaterialParamterScalar : public UEFActionNotify_AnimEvent
{
public:
	struct FString                                     ParamName;                                                // 0x006C(0x0010) (Edit, NeedCtorLink)
	float                                              StartValue;                                               // 0x007C(0x0004) (Edit)
	float                                              EndValue;                                                 // 0x0080(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActionNotify_AnimEvent_MaterialParamterScalar");
		return ptr;
	}

};


// Class EFGame.EFActorMotionBase
// 0x0000 (0x0050 - 0x0050)
class UEFActorMotionBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionBase");
		return ptr;
	}

};


// Class EFGame.EFActorMotionLocationCycle
// 0x0019 (0x0069 - 0x0050)
class UEFActorMotionLocationCycle : public UEFActorMotionBase
{
public:
	float                                              fTime;                                                    // 0x0050(0x0004)
	struct FVector                                     vPreValue;                                                // 0x0054(0x000C)
	float                                              fMotionRange;                                             // 0x0060(0x0004) (Edit)
	float                                              fMotionCycle;                                             // 0x0064(0x0004) (Edit)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x0068(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionLocationCycle");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationAcyclic
// 0x0005 (0x0055 - 0x0050)
class UEFActorMotionRotationAcyclic : public UEFActorMotionBase
{
public:
	float                                              fMotionVel;                                               // 0x0050(0x0004) (Edit)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x0054(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationAcyclic");
		return ptr;
	}

};


// Class EFGame.EFActorMotionRotationCyclic
// 0x0019 (0x0069 - 0x0050)
class UEFActorMotionRotationCyclic : public UEFActorMotionBase
{
public:
	float                                              fTime;                                                    // 0x0050(0x0004)
	struct FRotator                                    vPreValue;                                                // 0x0054(0x000C)
	float                                              fMotionRange;                                             // 0x0060(0x0004) (Edit)
	float                                              fMotionCycle;                                             // 0x0064(0x0004) (Edit)
	TEnumAsByte<EAxis>                                 eMotionAxis;                                              // 0x0068(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFActorMotionRotationCyclic");
		return ptr;
	}

};


// Class EFGame.EFAfterImageSkeletalMeshComponent
// 0x0000 (0x08D4 - 0x08D4)
class UEFAfterImageSkeletalMeshComponent : public USkeletalMeshComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAfterImageSkeletalMeshComponent");
		return ptr;
	}

};


// Class EFGame.EFAkAudioDevice
// 0x0240 (0x0350 - 0x0110)
class UEFAkAudioDevice : public UAkAudioDevice
{
public:
	unsigned char                                      UnknownData00[0x240];                                     // 0x0110(0x0240) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAkAudioDevice");
		return ptr;
	}

};


// Class EFGame.EFAN_Params
// 0x001C (0x006C - 0x0050)
class UEFAN_Params : public UObject
{
public:
	struct FString                                     Desc;                                                     // 0x0050(0x0010) (Edit, AlwaysInit, NeedCtorLink)
	unsigned long                                      IsActive : 1;                                             // 0x0060(0x0004) (Edit)
	float                                              StartTime;                                                // 0x0064(0x0004) (Edit)
	float                                              InterpTime;                                               // 0x0068(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Params");
		return ptr;
	}

};


// Class EFGame.EFParticleSystemType
// 0x0000 (0x0050 - 0x0050)
class UEFParticleSystemType : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleSystemType");
		return ptr;
	}

};


// Class EFGame.EFAN_Particle
// 0x017C (0x01E8 - 0x006C)
class UEFAN_Particle : public UEFAN_Params
{
public:
	struct FString                                     LookInfoKey;                                              // 0x006C(0x0010) (Edit, NeedCtorLink)
	float                                              RelativeSpawnTime;                                        // 0x007C(0x0004) (Edit)
	float                                              DurationTime;                                             // 0x0080(0x0004) (Edit)
	struct FEFParticleSystemInfo                       ParticleInfo;                                             // 0x0084(0x0158) (Component, NeedCtorLink, Deprecated)
	class UEFParticleData*                             ParticleDataInfo;                                         // 0x01DC(0x0008) (Edit, ExportObject, NeedCtorLink, EditInline)
	unsigned long                                      bSkipIfOwnerIsHidden : 1;                                 // 0x01E4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Particle");
		return ptr;
	}

};


// Class EFGame.EFAN_Trail
// 0x001C (0x0088 - 0x006C)
class UEFAN_Trail : public UEFAN_Params
{
public:
	float                                              RelativeSpawnTime;                                        // 0x006C(0x0004) (Edit)
	float                                              Duration;                                                 // 0x0070(0x0004) (Edit)
	class UAnimNotify_Trails*                          AnimTrails;                                               // 0x0074(0x0008) (Edit, ExportObject, NeedCtorLink, EditInline)
	TEnumAsByte<EFEQUIP_PART>                          TrailParts;                                               // 0x007C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	int                                                TrailPartsIndex;                                          // 0x0080(0x0004) (Edit)
	unsigned long                                      bSkipIfOwnerIsHidden : 1;                                 // 0x0084(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAN_Trail");
		return ptr;
	}

};


// Class EFGame.EFBarrier
// 0x0008 (0x0274 - 0x026C)
class AEFBarrier : public AActor
{
public:
	class UStaticMeshComponent*                        StaticMeshComponent;                                      // 0x026C(0x0008) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFBarrier");
		return ptr;
	}

};


// Class EFGame.EFCharacterParts
// 0x002C (0x05AC - 0x0580)
class AEFCharacterParts : public APawn
{
public:
	struct FName                                       AttachSocketName;                                         // 0x0580(0x0008)
	class UEFPartsSkelComponent*                       PartsMeshComponent;                                       // 0x0588(0x0008) (ExportObject, Component, EditInline)
	class APawn*                                       ParentPawn;                                               // 0x0590(0x0008)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0598(0x0008) (ExportObject, Component, EditInline)
	int                                                AttachedPSIIndex;                                         // 0x05A0(0x0004) (Transient)
	class AEFPawn*                                     AttachOtherPawn;                                          // 0x05A4(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCharacterParts");
		return ptr;
	}


	void OnParticleSystemFinished(class UParticleSystemComponent* PSC);
	void ClearAttachedPSIIndex();
	void BaseChange();
	bool EncroachingOn(class AActor** Other);
	void EncroachedBy(class AActor** Other);
	void Destroyed();
};


// Class EFGame.EFCheatManager
// 0x0000 (0x0090 - 0x0090)
class UEFCheatManager : public UGameCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFCheatManager");
		return ptr;
	}


	void InternalDebugLookAt();
	void InternalVisualizePhysicsCompartmentUsage();
	void InternalSetPhysicsCompartmentCount(int inCount);
	void InternalTogglePhysicsCompartmentForEFPawns();
	void InternalSetCamTargetBlendTime(float a_Time, float a_Exp);
	void InternalClearCamTarget();
	void InternalSetCamTarget(const struct FString& a_Nickname);
	void InternalCamPrevTarget();
	void InternalCamNextTarget();
	class AEFPlayerCamera* InternalGetPlayerCamera();
	void InternalToggleCullDistanceVolume();
	void InternalToggleCPUSkinning(const struct FString& InMeshName);
	void InternalToggleOneFrameThreadLag();
	void InternalToggleDynamicFoliageOptimize();
	void InternalToggleParticleOptimizeILG();
};


// Class EFGame.EFClient
// 0x0030 (0x0260 - 0x0230)
class UEFClient : public UWindowsClient
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0230(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFClient");
		return ptr;
	}

};


// Class EFGame.EFConsole
// 0x0014 (0x0274 - 0x0260)
class UEFConsole : public UConsole
{
public:
	TArray<struct FEFAutoCompleteCommand>              EFAutoCompleteCommandList;                                // 0x0260(0x0010) (Native, Transient)
	unsigned long                                      bInputPaused : 1;                                         // 0x0270(0x0004) (Native, Transient)
	unsigned char                                      UnknownData00[0xE7C8F9C];                                 // 0x0274(0xE7C8F9C) MISSED OFFSET
	unsigned char                                      UnknownData01[0x5D0C7C2A00];                              // 0x0274(0x5D0C7C2A00) UNKNOWN PROPERTY: State EFGame.EFConsole.Open

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFConsole");
		return ptr;
	}


	bool IsValidEFCommand(int Idx);
	bool InputAxis(int ControllerId, const struct FName& Key, float Delta, float DeltaTime, bool bGamepad);
	bool InputKey(int* ControllerId, struct FName* Key, TEnumAsByte<EInputEvent>* Event, float* AmountDepressed, bool* bGamepad);
};


// Class EFGame.EFDecalCollisionComponent
// 0x000C (0x0280 - 0x0274)
class UEFDecalCollisionComponent : public UPrimitiveComponent
{
public:
	float                                              ApplyOwnerSizeRate;                                       // 0x0274(0x0004) (Edit)
	struct FColor                                      DecalCollisionColor;                                      // 0x0278(0x0004) (Edit, Const)
	unsigned long                                      bDrawBoundingBox : 1;                                     // 0x027C(0x0004) (Const)
	unsigned long                                      bDrawNonColliding : 1;                                    // 0x027C(0x0004) (Const)
	unsigned long                                      bAlwaysRenderIfSelected : 1;                              // 0x027C(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalCollisionComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalComponent
// 0x0010 (0x0410 - 0x0400)
class UEFDecalComponent : public UDecalComponent
{
public:
	unsigned long                                      bSkipChangeLocation : 1;                                  // 0x0400(0x0004) (Transient)
	unsigned long                                      bFirstUpdate : 1;                                         // 0x0400(0x0004) (Transient, DuplicateTransient)
	unsigned long                                      bSpawnedByParticleModule : 1;                             // 0x0400(0x0004) (Transient)
	unsigned long                                      bDropDistortion : 1;                                      // 0x0400(0x0004) (Transient)
	struct FVector                                     SpawnLocation;                                            // 0x0404(0x000C) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalComponent");
		return ptr;
	}

};


// Class EFGame.EFDecalFloorActor
// 0x000C (0x0288 - 0x027C)
class AEFDecalFloorActor : public ADecalActor
{
public:
	unsigned long                                      bUseFloorChecks : 1;                                      // 0x027C(0x0004) (Edit)
	class UEFDecalCollisionComponent*                  FloorCollisionComponent;                                  // 0x0280(0x0008) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalFloorActor");
		return ptr;
	}


	void GetBoundingCylinder(float* CollisionRadius, float* CollisionHeight);
};


// Class EFGame.EFDecalManager
// 0x0000 (0x02B0 - 0x02B0)
class AEFDecalManager : public ADecalManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFDecalManager");
		return ptr;
	}


	class UDecalComponent* SpawnDecalMinimal(class UMaterialInterface* DecalMaterial, const struct FVector& DecalLocation, const struct FRotator& DecalOrientation, float Width, float Height, float InLifeSpan, float Thickness, bool bNoClip, float DecalRotation);
};


// Class EFGame.EFFracturedStaticMeshActor
// 0x006C (0x0374 - 0x0308)
class AEFFracturedStaticMeshActor : public AFracturedStaticMeshActor
{
public:
	int                                                FracturedId;                                              // 0x0308(0x0004) (Edit, EditConst, DuplicateTransient)
	int                                                AttachedPSIIndex;                                         // 0x030C(0x0004) (Transient)
	unsigned long                                      bTraceGameLand : 1;                                       // 0x0310(0x0004)
	unsigned long                                      bDisableSpawnParts : 1;                                   // 0x0310(0x0004) (Transient)
	class ULightEnvironmentComponent*                  LightEnvironment;                                         // 0x0314(0x0008) (Const, ExportObject, EditConst, Component, EditInline)
	struct FVector                                     InteractionKeyOffset;                                     // 0x031C(0x000C) (Transient)
	TArray<struct FDeferredPartToSpawn>                DeferredPartsToSpawnByProp;                               // 0x0328(0x0010) (Transient, NeedCtorLink)
	TArray<class AEFFracturedStaticMeshPart*>          ManagedSpawnParts;                                        // 0x0338(0x0010) (Transient, NeedCtorLink)
	TArray<int>                                        Fragments_Hit_2;                                          // 0x0348(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	TArray<int>                                        Fragments_Hit_3;                                          // 0x0358(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	float                                              MinHeavyFragmentVolume;                                   // 0x0368(0x0004) (Transient)
	float                                              BaseMomentum;                                             // 0x036C(0x0004) (Transient)
	float                                              HeavyMomentum;                                            // 0x0370(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFFracturedStaticMeshActor");
		return ptr;
	}


	void ClearManagedSpawnParts();
	void ClearAttachedPSIIndex();
	void NotifyChangedBase();
	void BreakOffPartsInRadius(struct FVector* Origin, float* Radius, float* RBStrength, bool* bWantPhysChunksAndParticles);
	void BreakOffIsolatedIslands(TArray<int>* IgnoreFrags, struct FVector* ChunkDir, TArray<class AFracturedStaticMeshPart*>* DisableCollWithPart, bool* bWantPhysChunks, TArray<unsigned char>* FragmentVis);
	bool SpawnDeferredParts();
	void Explode();
	void TakeDamage(int* Damage, class AController** EventInstigator, struct FVector* HitLocation, struct FVector* Momentum, class UClass** DamageType, struct FTraceHitInfo* HitInfo, class AActor** DamageCauser);
	void BaseChange();
	void Destroyed();
	void PostBeginPlay();
};


// Class EFGame.EFFracturedStaticMeshPart
// 0x0000 (0x033C - 0x033C)
class AEFFracturedStaticMeshPart : public AFracturedStaticMeshPart
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFFracturedStaticMeshPart");
		return ptr;
	}


	void BreakOffPartsInRadius(struct FVector* Origin, float* Radius, float* RBStrength, bool* bWantPhysChunksAndParticles);
	void BreakOffIsolatedIslands(TArray<int>* IgnoreFrags, struct FVector* ChunkDir, TArray<class AFracturedStaticMeshPart*>* DisableCollWithPart, bool* bWantPhysChunks, TArray<unsigned char>* FragmentVis);
	bool SpawnDeferredParts();
	void Explode();
	void DoExplode();
	void TakeDamage(int* Damage, class AController** EventInstigator, struct FVector* HitLocation, struct FVector* Momentum, class UClass** DamageType, struct FTraceHitInfo* HitInfo, class AActor** DamageCauser);
	void PostBeginPlay();
	void RecyclePart(bool* bAddToFreePool);
	void Initialize();
};


// Class EFGame.EFGameInfo
// 0x00AC (0x0564 - 0x04B8)
class AEFGameInfo : public AGameInfo
{
public:
	unsigned long                                      bIsMapLoaded : 1;                                         // 0x04B8(0x0004)
	int                                                CurrentMapIndex;                                          // 0x04BC(0x0004) (Transient)
	TEnumAsByte<EZoneLevel>                            MapLevel;                                                 // 0x04C0(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04C1(0x0003) MISSED OFFSET
	TArray<class UMaterialInstanceConstant*>           EffectFenceMICs;                                          // 0x04C4(0x0010) (Transient, NeedCtorLink)
	TArray<class AEFSceneCapture2DActor*>              CaptureActors;                                            // 0x04D4(0x0010) (Transient, NeedCtorLink)
	TArray<class AEFSceneCaptureObjectLocation*>       CaptureObjectLocations;                                   // 0x04E4(0x0010) (Transient, NeedCtorLink)
	TArray<class AActor*>                              CaptureBGActors;                                          // 0x04F4(0x0010) (Transient, NeedCtorLink)
	TArray<int>                                        CaptureBGActorIndexPools;                                 // 0x0504(0x0010) (Transient, NeedCtorLink)
	TArray<class AActor*>                              HeadStatusActors;                                         // 0x0514(0x0010) (Transient, NeedCtorLink)
	TArray<int>                                        HeadStatusActorIndexPools;                                // 0x0524(0x0010) (Transient, NeedCtorLink)
	TArray<class AActor*>                              IndicatorActors;                                          // 0x0534(0x0010) (Transient, NeedCtorLink)
	TArray<int>                                        IndicatorActorIndexPools;                                 // 0x0544(0x0010) (Transient, NeedCtorLink)
	TArray<class AEFTranslucentVolume*>                WatchRestoreTranslucentVolumes;                           // 0x0554(0x0010) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFGameInfo");
		return ptr;
	}


	bool AllowCheats(class APlayerController** P);
	void PostSeamlessTravel();
	void GameEnding();
	void NotifyMapLoaded();
	void NotfiyLoadingStep(const struct FString& InStepName);
	void Tick(float* DeltaSeconds);
	void PostLogin(class APlayerController** NewPlayer);
	class APlayerController* Login(struct FString* Portal, struct FString* Options, struct FUniqueNetId* UniqueId, struct FString* ErrorMessage);
	void LoadLevel(const struct FString& LevelName);
	void RestartPlayer(class AController** NewPlayer);
};


// Class EFGame.EFMotionSkeletalMeshActor
// 0x002C (0x0334 - 0x0308)
class AEFMotionSkeletalMeshActor : public ASkeletalMeshActor
{
public:
	struct FVector                                     vOriginLocation;                                          // 0x0308(0x000C) (Transient)
	struct FRotator                                    vOriginRotation;                                          // 0x0314(0x000C) (Transient)
	unsigned long                                      bSaveSMCLocNRot : 1;                                      // 0x0320(0x0004) (Transient)
	unsigned long                                      bMotionToggle : 1;                                        // 0x0320(0x0004) (Edit, Transient)
	TArray<class UEFActorMotionBase*>                  MotionArr;                                                // 0x0324(0x0010) (Edit, ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFMotionStaticMeshActor
// 0x002C (0x0334 - 0x0308)
class AEFMotionStaticMeshActor : public AInterpActor
{
public:
	struct FVector                                     vOriginLocation;                                          // 0x0308(0x000C) (Transient)
	struct FRotator                                    vOriginRotation;                                          // 0x0314(0x000C) (Transient)
	unsigned long                                      bSaveSMCLocNRot : 1;                                      // 0x0320(0x0004) (Transient)
	unsigned long                                      bMotionToggle : 1;                                        // 0x0320(0x0004) (Edit, Transient)
	TArray<class UEFActorMotionBase*>                  MotionArr;                                                // 0x0324(0x0010) (Edit, ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMotionStaticMeshActor");
		return ptr;
	}

};


// Class EFGame.EFParticleSkeletalMeshActor
// 0x0094 (0x0300 - 0x026C)
class AEFParticleSkeletalMeshActor : public AActor
{
public:
	TArray<struct FEFAnimDataItem>                     AnimDataList;                                             // 0x026C(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	int                                                CurAnimDataIndex;                                         // 0x027C(0x0004) (Transient, AlwaysInit)
	struct FName                                       CurAnimSeqName;                                           // 0x0280(0x0008) (Transient)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0288(0x0008) (Edit, ExportObject, Component, EditInline)
	class UEFSkeletalMeshComponent*                    Mesh;                                                     // 0x0290(0x0008) (Edit, ExportObject, Component, EditInline)
	TArray<class UEFSkeletalMeshComponent*>            ManagedPartMeshs;                                         // 0x0298(0x0010) (ExportObject, Component, NeedCtorLink, EditInline)
	TArray<struct FEFExtraSkelMeshInfo>                ExtraSkelMeshList;                                        // 0x02A8(0x0010) (Transient, Component, AlwaysInit, NeedCtorLink)
	TArray<class UMaterialInterface*>                  Materials;                                                // 0x02B8(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	class AActor*                                      OwnerActor;                                               // 0x02C8(0x0008) (Transient, AlwaysInit)
	struct FString                                     OwnerLookInfoKey;                                         // 0x02D0(0x0010) (Transient, NeedCtorLink)
	float                                              NonAniGuaranteeDuration;                                  // 0x02E0(0x0004) (Transient, AlwaysInit)
	unsigned long                                      bActionSpawned : 1;                                       // 0x02E4(0x0004) (Transient)
	unsigned long                                      NeedStopAction : 1;                                       // 0x02E4(0x0004) (Transient)
	TArray<struct FString>                             ActionNotifyTagList;                                      // 0x02E8(0x0010) (Transient, AlwaysInit, NeedCtorLink)
	float                                              PlayRate;                                                 // 0x02F8(0x0004) (Transient)
	int                                                AttachedPSIIndex;                                         // 0x02FC(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFParticleSkeletalMeshActor");
		return ptr;
	}

};


// Class EFGame.EFAction_Notify
// 0x0088 (0x00D8 - 0x0050)
class UEFAction_Notify : public UObject
{
public:
	int                                                UniqueIndex;                                              // 0x0050(0x0004)
	int                                                TriggerSkillEffectId;                                     // 0x0054(0x0004) (Edit)
	unsigned long                                      ActiveByMemoryPos : 1;                                    // 0x0058(0x0004) (Edit)
	unsigned long                                      FullRange : 1;                                            // 0x0058(0x0004) (Edit)
	unsigned long                                      Enable : 1;                                               // 0x0058(0x0004)
	unsigned long                                      PrivateTemplate : 1;                                      // 0x0058(0x0004) (Edit)
	unsigned long                                      OverwriteTemplate : 1;                                    // 0x0058(0x0004) (Edit)
	float                                              Time;                                                     // 0x005C(0x0004) (Edit)
	float                                              OriginalTime;                                             // 0x0060(0x0004)
	float                                              Duration;                                                 // 0x0064(0x0004) (Edit)
	TEnumAsByte<ECTE_NOTIFY_ACTIVATE_TYPE>             NotifyType;                                               // 0x0068(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	int                                                RepeatCount;                                              // 0x006C(0x0004) (Edit)
	float                                              RepeatTerm;                                               // 0x0070(0x0004) (Edit)
	struct FString                                     ToolTip;                                                  // 0x0074(0x0010) (Edit, NeedCtorLink)
	struct FString                                     NotifyName;                                               // 0x0084(0x0010) (Edit, NeedCtorLink)
	int                                                SortPriority;                                             // 0x0094(0x0004) (Transient)
	struct FColor                                      NotifyColor;                                              // 0x0098(0x0004)
	struct FString                                     GroupName;                                                // 0x009C(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     SharedNotifyGroupId;                                      // 0x00AC(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<struct FString>                             ViewGroupList;                                            // 0x00BC(0x0010) (NeedCtorLink)
	struct FPointer                                    TmpActionNotifyData;                                      // 0x00CC(0x0008) (Native, DuplicateTransient)
	int                                                Probability;                                              // 0x00D4(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFAction_Notify");
		return ptr;
	}

};


// Class EFGame.EFPawn
// 0x030C (0x088C - 0x0580)
class AEFPawn : public APawn
{
public:
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0580(0x0008) (Edit, ExportObject, Component, EditInline)
	unsigned long                                      bDefaultMeshHide : 1;                                     // 0x0588(0x0004)
	unsigned long                                      bRootMotionFallingCheck : 1;                              // 0x0588(0x0004) (DuplicateTransient)
	unsigned long                                      bJumpSkill : 1;                                           // 0x0588(0x0004) (Transient)
	unsigned long                                      bCanDoFloorConform : 1;                                   // 0x0588(0x0004)
	unsigned long                                      bCanDoStepsSmoothing : 1;                                 // 0x0588(0x0004) (Edit)
	unsigned long                                      bJointPropAttachOffsetZ : 1;                              // 0x0588(0x0004) (Const, Transient)
	unsigned long                                      IsMatineePlay : 1;                                        // 0x0588(0x0004) (Transient)
	unsigned long                                      PhysFallingByAction : 1;                                  // 0x0588(0x0004) (Transient)
	unsigned long                                      bMergeAction : 1;                                         // 0x0588(0x0004) (Transient)
	unsigned long                                      bIgnoreBlockActors : 1;                                   // 0x0588(0x0004) (Transient)
	unsigned long                                      bEnableMaxRootMotionDistance : 1;                         // 0x0588(0x0004) (Transient)
	unsigned long                                      bChangedMaxRootMotionDistance : 1;                        // 0x0588(0x0004) (Transient)
	unsigned long                                      RootMotionBeHitControlHeight : 1;                         // 0x0588(0x0004) (Transient)
	unsigned long                                      bForceUniformVelocity : 1;                                // 0x0588(0x0004) (Transient)
	unsigned long                                      bNeedMoveChangedBase : 1;                                 // 0x0588(0x0004) (Transient)
	unsigned long                                      IsJustFinishedCinematicAnim : 1;                          // 0x0588(0x0004) (Transient)
	unsigned long                                      bUseDynamicFoliage : 1;                                   // 0x0588(0x0004)
	unsigned long                                      bValidCurrentFloorTypeCheck : 1;                          // 0x0588(0x0004) (Transient)
	unsigned long                                      bUseMeshMerge : 1;                                        // 0x0588(0x0004) (Const)
	unsigned long                                      bHideOnNextMeshMergeRequest : 1;                          // 0x0588(0x0004) (Transient)
	unsigned long                                      bDisableJumpOffPawn : 1;                                  // 0x0588(0x0004) (Transient)
	unsigned long                                      bGrabbed : 1;                                             // 0x0588(0x0004) (Transient)
	unsigned long                                      bGrabCameraInterpolation : 1;                             // 0x0588(0x0004) (Transient)
	unsigned long                                      bIgnoreStartFalling : 1;                                  // 0x0588(0x0004) (Transient)
	unsigned long                                      bCinematicUnfixed : 1;                                    // 0x0588(0x0004) (Transient)
	unsigned long                                      bCinematicChangeAngularSpring : 1;                        // 0x0588(0x0004) (Transient)
	unsigned long                                      bForceSyncRBBonesAfterNextInterpMove : 1;                 // 0x0588(0x0004) (Transient)
	unsigned long                                      bDefaultMaterialChanged : 1;                              // 0x0588(0x0004) (Transient)
	class UEFSkeletalMeshComponent*                    ExtendMesh;                                               // 0x058C(0x0008) (ExportObject, Component, EditInline)
	TEnumAsByte<ERootBoneAxis>                         RootBoneOption[0x3];                                      // 0x0594(0x0001)
	TEnumAsByte<EPhysics>                              ForceActionPhysics;                                       // 0x0597(0x0001) (Transient)
	TEnumAsByte<EBlockPCRootMotionSkillPenetrateType>  BlockPCRootMotionSkillPenetrate;                          // 0x0598(0x0001) (Transient)
	TEnumAsByte<EFMATERIAL_FOOTSTEP>                   CurrentFloorType;                                         // 0x0599(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x2];                                       // 0x059A(0x0002) MISSED OFFSET
	struct FVector                                     LastFloorConformLocation;                                 // 0x059C(0x000C) (Const, Transient)
	float                                              MTO_FloorConformZTranslation;                             // 0x05A8(0x0004) (Const, Transient)
	float                                              MTO_BlendedFloorConformZTranslation;                      // 0x05AC(0x0004) (Const, Transient)
	struct FVector                                     MRO_FloorConformRotationAxis;                             // 0x05B0(0x000C) (Const, Transient)
	float                                              MRO_FloorConformRotationAngle;                            // 0x05BC(0x0004) (Const, Transient)
	float                                              MRO_BlendedFloorConformRotationAngle;                     // 0x05C0(0x0004) (Const, Transient)
	float                                              MTO_MeshLocSmootherZOffset;                               // 0x05C4(0x0004) (Const, Transient)
	struct FVector                                     MeshOffset;                                               // 0x05C8(0x000C) (Const, Transient)
	struct FVector                                     LastLocation;                                             // 0x05D4(0x000C) (Const, Transient)
	float                                              JointPropAttachSocketLocationZ;                           // 0x05E0(0x0004) (Const, Transient)
	float                                              DefaultGroundSpeed;                                       // 0x05E4(0x0004) (Transient)
	float                                              GravityFactor;                                            // 0x05E8(0x0004) (Transient)
	float                                              RagdollGravityFactor;                                     // 0x05EC(0x0004) (Transient)
	struct FVector                                     SkillStartPos;                                            // 0x05F0(0x000C) (Transient)
	struct FVector                                     HitReactionPushLoc;                                       // 0x05FC(0x000C) (Transient)
	struct FVector                                     LastRootMotionAccumTranslation;                           // 0x0608(0x000C) (Transient)
	struct FVector                                     RootMotionStartLoc;                                       // 0x0614(0x000C) (Transient)
	struct FMatrix                                     RootMotionStartRot;                                       // 0x0620(0x0040) (Transient)
	struct FVector                                     TargetRootMotionLoc;                                      // 0x0660(0x000C) (Transient)
	float                                              MaxRootMotionDistance;                                    // 0x066C(0x0004) (Transient)
	float                                              MaxRootMotionSquaredDistance;                             // 0x0670(0x0004) (Transient)
	int                                                ChangeRootMotion;                                         // 0x0674(0x0004) (Transient)
	int                                                PrevChangeRootMotion;                                     // 0x0678(0x0004) (Transient)
	float                                              RootMotionBeHitControlSetTime;                            // 0x067C(0x0004) (Transient)
	float                                              RootMotionBeHitControlDuration;                           // 0x0680(0x0004) (Transient)
	float                                              RootMotionBeHitMaxHeight;                                 // 0x0684(0x0004) (Transient)
	struct FRotator                                    MoveRotation;                                             // 0x0688(0x000C) (Transient)
	class AEFPawn*                                     BlockedPawnWhenSkillStart;                                // 0x0694(0x0008) (Transient)
	class AActor*                                      CinematicActor;                                           // 0x069C(0x0008) (Transient)
	struct FBasedPosition                              CachedBasePositionBySelf;                                 // 0x06A4(0x0038) (Transient)
	struct FBasedPosition                              CachedBasePositionByTarget;                               // 0x06DC(0x0038) (Transient)
	struct FVector                                     SyncDeltaMove;                                            // 0x0714(0x000C) (Transient)
	struct FVector                                     SaveLocation;                                             // 0x0720(0x000C) (Transient)
	struct FRotator                                    SaveRotation;                                             // 0x072C(0x000C) (Transient)
	struct FPlayerLocationInfo                         CinematicPlayerLocation;                                  // 0x0738(0x0008) (Transient)
	struct FVector                                     UniformVelocity;                                          // 0x0740(0x000C) (Transient)
	class AEFPawn*                                     DrivenEFVehicle;                                          // 0x074C(0x0008) (Transient)
	struct FQWord                                      TryNextMoveTransitIndex;                                  // 0x0754(0x0008) (Transient)
	TArray<class UMaterialInstanceConstant*>           AffectedFoliageMICs;                                      // 0x075C(0x0010) (Transient, NeedCtorLink)
	int                                                AttachedPSIIndex;                                         // 0x076C(0x0004) (Transient)
	struct FEFBasedLocation                            PrevFloorCheckLocation;                                   // 0x0770(0x0010) (Transient)
	struct FVector                                     LastRootMotionPosition;                                   // 0x0780(0x000C) (Transient)
	float                                              LastRootMotionRecordedTime;                               // 0x078C(0x0004) (Transient)
	class UEFMainSkelComponent*                        OriginMesh;                                               // 0x0790(0x0008) (ExportObject, Transient, Component, EditInline)
	struct FPointer                                    MeshMergeSourceLookInfoPointer;                           // 0x0798(0x0008) (Native, Transient)
	TArray<struct FPointer>                            MeshMergeSourcePartsArray;                                // 0x07A0(0x0010) (Native, Transient, AlwaysInit)
	struct FVector                                     Momentum;                                                 // 0x07B0(0x000C) (Const, Transient)
	unsigned char                                      UnknownData01[0x48];                                      // 0x07BC(0x0048) UNKNOWN PROPERTY: MapProperty EFGame.EFPawn.TrailNotifyToParticleSystemMap
	class UAnimNodeAimOffset*                          AimOffsetAnimNode;                                        // 0x0804(0x0008) (Transient)
	TArray<class AEFParticleSkeletalMeshActor*>        ActionParticleSkeletalMeshActors;                         // 0x080C(0x0010) (Transient, NeedCtorLink)
	struct FEFCharacterAfterImageEffectInfo            AfterImageInfo;                                           // 0x081C(0x0030) (Transient)
	TArray<struct FEFAfterImageChildInfo>              AfterImageChildren;                                       // 0x084C(0x0010) (Transient, Component, NeedCtorLink)
	class UEFData_SkelControlGroup*                    SkelControlGroup;                                         // 0x085C(0x0008) (Transient)
	struct FActorTickDropRate                          TickDropRate;                                             // 0x0864(0x0014) (Transient)
	int                                                TickDropRatePriority;                                     // 0x0878(0x0004) (Transient)
	TArray<int>                                        CinematicUnfixedBodyIndices;                              // 0x087C(0x0010) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPawn");
		return ptr;
	}


	void StopAfterImageEffect(bool bForceRemoveAllChildren);
	void StartAfterImageEffect(struct FEFCharacterAfterImageEffectInfo* EffectParams);
	class UParticleSystem* GetAnimTrailParticleSystem(class UAnimNotify_Trails** AnimNotifyData);
	void ApplyFluidSurfaceContinuousForce(class AFluidSurfaceActor** Fluid);
	void ApplyFluidSurfaceImpact(class AFluidSurfaceActor** Fluid, struct FVector* HitLocation);
	void NotifyChangedBase();
	void BaseChange();
	void MAT_FinishAnimControl(class UInterpGroup** InInterpGroup);
	void MAT_BeginAnimControl(class UInterpGroup** InInterpGroup);
	void InterpolationFinished(class USeqAct_Interp** InterpAction);
	void InterpolationStarted(class USeqAct_Interp** InterpAction, class UInterpGroupInst** GroupInst);
	void RigidBodyCollision(class UPrimitiveComponent** HitComponent, class UPrimitiveComponent** OtherComponent, int* ContactIndex, struct FCollisionImpactData* RigidCollisionData);
	void DoKismetAttachment(class AActor** Attachment, class USeqAct_AttachToActor** Action);
	void AttachmentCameraActor(class AActor* Attachment, const struct FVector& RelativeViewOffset);
	float GetGravityZ();
	void OnForceFieldDestroy(class UNxForceFieldComponent* FFC);
	bool CreateForceField(class UAnimNotify_ForceField** AnimNotifyData);
	void ExplodeActor(class AActor* ExplodeActor);
	void FinishDyingDelay();
	void SetDefaultStateColor();
	void SetStateColor(const struct FLinearColor& StateColor, float fIntensity);
	void AttackFreezeAnim(float PauseTime);
	void AttackContinueAnim();
	void SetPPOutlineWidth(float Width);
	void SetPPOutlineColor(const struct FVector& InColor);
	void SetPPOutline(bool bPPOutline);
	void SetCloakMode(bool bEnable, float CloakAlpha, bool bRimLight);
	void SetOccludedOutlineColor(const struct FVector& InColor, float InScale);
	void SetOccludedOutline(bool bOutline, float Width);
	void OutsideWorldBounds();
	void FellOutOfWorld(class UClass** dmgType);
	void Landed(struct FVector* HitNormal, class AActor** FloorActor);
	void Falling();
	bool SetDesiredRotation(struct FRotator* TargetDesiredRotation, bool* InLockDesiredRotation, bool* InUnlockWhenReached, float* InterpolationTime, bool* bResetRotationRate);
	void OnParticleSystemFinished(class UParticleSystemComponent* PSC);
	void PostInitAll();
	void ClearAttachedPSIIndex();
	void Destroyed();
	struct FName GetDefaultCameraMode(class APlayerController** RequestedBy);
	struct FName GetObjectCameraStyle();
	bool EncroachingOn(class AActor** Other);
	void EncroachedBy(class AActor** Other);
};


// Class EFGame.EFMonster
// 0x0000 (0x088C - 0x088C)
class AEFMonster : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFMonster");
		return ptr;
	}

};


// Class EFGame.EFNonPlayer
// 0x0000 (0x088C - 0x088C)
class AEFNonPlayer : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFNonPlayer");
		return ptr;
	}

};


// Class EFGame.EFPet
// 0x0000 (0x088C - 0x088C)
class AEFPet : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPet");
		return ptr;
	}

};


// Class EFGame.EFPlayer
// 0x001C (0x08A8 - 0x088C)
class AEFPlayer : public AEFPawn
{
public:
	class ULightEnvironmentComponent*                  PickupPropLightEnvironment;                               // 0x088C(0x0008) (ExportObject, Transient, Component, EditInline)
	int                                                PickupPropLightEnvironmentCount;                          // 0x0894(0x0004) (Transient)
	unsigned long                                      ControlledByTrackMove : 1;                                // 0x0898(0x0004) (Transient)
	unsigned long                                      ControlledByTrackMoveOnServer : 1;                        // 0x0898(0x0004) (Transient)
	float                                              TrackMoveStartPosition;                                   // 0x089C(0x0004) (Transient)
	class AEFChangePlayerCameraVolume*                 ActivateCameraVolume;                                     // 0x08A0(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayer");
		return ptr;
	}


	void OnUpdatePropertyDrawScale();
	void OnUpdatePropertyDrawScale3D();
};


// Class EFGame.EFSummonNpc
// 0x0000 (0x088C - 0x088C)
class AEFSummonNpc : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFSummonNpc");
		return ptr;
	}

};


// Class EFGame.EFTransit
// 0x0010 (0x089C - 0x088C)
class AEFTransit : public AEFPawn
{
public:
	int                                                TransitIndex;                                             // 0x088C(0x0004) (Transient)
	struct FVector                                     CollisionBoxExtent;                                       // 0x0890(0x000C) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTransit");
		return ptr;
	}


	bool EncroachingOn(class AActor** Other);
};


// Class EFGame.EFTrap
// 0x0000 (0x088C - 0x088C)
class AEFTrap : public AEFPawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFTrap");
		return ptr;
	}

};


// Class EFGame.EFVehicle
// 0x0008 (0x0894 - 0x088C)
class AEFVehicle : public AEFPawn
{
public:
	class AEFChangePlayerCameraVolume*                 ActivateCameraVolume;                                     // 0x088C(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFVehicle");
		return ptr;
	}

};


// Class EFGame.EFPhysicalMaterialProperty
// 0x0001 (0x0051 - 0x0050)
class UEFPhysicalMaterialProperty : public UPhysicalMaterialPropertyBase
{
public:
	TEnumAsByte<EFMATERIAL_FOOTSTEP>                   MaterialFootstep;                                         // 0x0050(0x0001) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPhysicalMaterialProperty");
		return ptr;
	}

};


// Class EFGame.EFPlayerController
// 0x0298 (0x0A20 - 0x0788)
class AEFPlayerController : public AGamePlayerController
{
public:
	TArray<struct FEFInputState>                       m_InputStateFlow;                                         // 0x0788(0x0010) (Transient, NeedCtorLink)
	unsigned long                                      bGamePadInput : 1;                                        // 0x0798(0x0004) (Transient)
	unsigned long                                      bInteractionMode : 1;                                     // 0x0798(0x0004) (Transient)
	unsigned long                                      bCallFromTargetCastMode : 1;                              // 0x0798(0x0004) (Transient)
	unsigned long                                      bHideSwitch : 1;                                          // 0x0798(0x0004) (Transient)
	unsigned long                                      bPickMe : 1;                                              // 0x0798(0x0004) (Transient)
	unsigned long                                      bForceMoveReservation : 1;                                // 0x0798(0x0004) (Transient)
	unsigned long                                      bForceMoveRelease : 1;                                    // 0x0798(0x0004) (Transient)
	unsigned long                                      bCruiseMode : 1;                                          // 0x0798(0x0004) (Transient)
	unsigned long                                      bCruiseBoostMode : 1;                                     // 0x0798(0x0004) (Transient)
	unsigned long                                      bPrevCruiseMode : 1;                                      // 0x0798(0x0004) (Transient)
	struct FEFInputCommand                             m_CurInputCommand;                                        // 0x079C(0x0040) (Transient)
	TEnumAsByte<EFPlayerControlInputCondition>         m_CurInputCondition;                                      // 0x07DC(0x0001) (Transient)
	TEnumAsByte<ETargetCastMode>                       TargetCastMode;                                           // 0x07DD(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x2];                                       // 0x07DE(0x0002) MISSED OFFSET
	float                                              fCheckPathTime;                                           // 0x07E0(0x0004) (Transient)
	float                                              fCheckPickEffectTime;                                     // 0x07E4(0x0004) (Transient)
	float                                              fUpdateMaxPathTime;                                       // 0x07E8(0x0004) (Transient)
	class AActor*                                      HitWorldActor;                                            // 0x07EC(0x0008) (Transient)
	class AActor*                                      HitActor;                                                 // 0x07F4(0x0008) (Transient)
	struct FVector                                     HitWorldLocation;                                         // 0x07FC(0x000C) (Transient)
	struct FVector                                     HitActorLocation;                                         // 0x0808(0x000C) (Transient)
	class AEmitter*                                    PickingEffect;                                            // 0x0814(0x0008) (Transient)
	TArray<class AEFPickingEmitter*>                   PickingEffectArr;                                         // 0x081C(0x0010) (Transient, NeedCtorLink)
	TArray<class AEFPickingEmitter*>                   PickingEffectUseArr;                                      // 0x082C(0x0010) (Transient, NeedCtorLink)
	int                                                PickingEffectCount;                                       // 0x083C(0x0004)
	class UEFPlayerInput*                              EFPlayerInput;                                            // 0x0840(0x0008) (Transient)
	class AActor*                                      SelectedActor;                                            // 0x0848(0x0008) (Transient)
	class AActor*                                      PreSelectedActor;                                         // 0x0850(0x0008) (Transient)
	class AActor*                                      OverActor;                                                // 0x0858(0x0008) (Transient)
	struct FVector                                     OverActorHitLocation;                                     // 0x0860(0x000C) (Transient)
	float                                              SelectedMaxDistance;                                      // 0x086C(0x0004) (Transient)
	struct FVector                                     ForceMoveReservationPos;                                  // 0x0870(0x000C) (Transient)
	struct FQWord                                      DebugOverObjectId;                                        // 0x087C(0x0008) (Transient)
	struct FEFBasedLocation                            LastMoveToPos;                                            // 0x0884(0x0010) (Transient)
	struct FVector                                     CruiseModeDirection;                                      // 0x0894(0x000C) (Transient)
	float                                              fPressedMoveIgnoreRadius;                                 // 0x08A0(0x0004) (Transient)
	float                                              fPressedMoveIgnoreAngle;                                  // 0x08A4(0x0004) (Transient)
	struct FPostProcessSettings                        WithOutDominantLightPPSettings;                           // 0x08A8(0x0174) (Transient, NeedCtorLink)
	float                                              WithOutDominantLightPPAlpha;                              // 0x0A1C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class EFGame.EFPlayerController");
		return ptr;
	}


	void ModifyOnSetCameraTargetBlendTime(class AActor** inEventOriginator, class AActor** inRealCameraTarget, float* outBlendTime);
	struct FString ConsoleCommand(struct FString* Command, bool* bWriteToLog);
	void ProcessCinematic(bool* bInCinematicMode);
	void GetPlayerInitPosition(struct FVector* out_Location, struct FRotator* out_Rotation);
	void GetPlayerViewPointQuat(struct FVector* out_Location, struct FQuat* out_Quaternion);
	void GetPlayerViewPoint(struct FVector* out_Location, struct FRotator* out_Rotation);
	void DisplayDebug(class AHUD** HUD, float* out_YL, float* out_YPos);
	void DrawHUD(class AHUD** H);
	void SpawnDefaultHUD();
	bool IsStopMovieLoading();
	void PlayerTick(float* DeltaTime);
	void UpdateRotation(float* DeltaTime);
	void StopMovieLoading();
	void Destroyed();
	void PostBeginPlay();
	void InitInputSystem();
};


// Class EFGame.EFPlayerInput
// 0x0030 (0x02E0 - 0x02B0)
class UEFPlayerInput : public UPlayerInput
{
public:
	struct FVector2D                                   CurMouseDeltaPos;                                         // 0x02B0(0x0008)
	struct FVector2D                                   OldMouseDeltaPos;                                         // 0x02B8(0x0008)
	struct FIntPoint                                   CurMousePos;                                              // 0x02C0(0x0008)
	struct FIntPoint                                   OldMousePos;                                              // 0x02C8(0x0008)
	unsigned long                                      bCtrl : 1;                                                // 0x02D0(0x0004) (Transient)
	unsigned long                                      bShift : 1;                                               // 0x02D0(0x0004) (Transient)
	unsigned long                                      bAlt : 1;                                                 // 0x02D0(0x0004) (Transient)
	unsigned long                                      bMouseLButton_Pressed : 1;                                // 0x02D0(0x0004) (Transient)
	unsigned long                                      bMouseLButton_Released : 1;                               // 0x02D0(0x0004) (Transient)
	unsigned long                                      bMouseLButton_Repeated : 1;                               // 0x02D0(0x0004) (Transient)
	unsigned long                                      bMouseRButton_Pressed : 1;                                // 0x02D0(0x0004) (Transient)
	unsigned long                                      bMouseRButton_Released : 1;                               // 0x02D0(0x0004) (Transient)
